Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-W_DFP/1.8.326/atdf/PIC32MZ2051W104132.atdf
<?xml version="1.0" encoding="UTF-8"?>
<!--
 Copyright (c) 2019 Microchip Technology Inc.

 SPDX-License-Identifier: Apache-2.0

 Licensed under the Apache License, Version 2.0 (the "License");
 you may not use this file except in compliance with the License.
 You may obtain a copy of the License at

 http://www.apache.org/licenses/LICENSE-2.0

 Unless required by applicable law or agreed to in writing, software
 distributed under the License is distributed on an "AS IS" BASIS,
 WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 See the License for the specific language governing permissions and
 limitations under the License.
-->
<avr-tools-device-file xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:mhc="http://www.atmel.com/schemas/avr-tools-device-file/mhc" schema-version="4.4" xsi:noNamespaceSchemaLocation="../../schema/avr_tools_device_file.xsd">
  <file timestamp="2020-01-09T20:31:13Z"/>
  <variants>
    <variant package="DQFN132" pinout="DQFN132" speedmax="250000000" tempmax="+85" tempmin="-40" vccmax="3.6" vccmin="3.0"/>
  </variants>
  <devices>
    <device architecture="MIPS" family="PIC32MZW" name="PIC32MZ2051W104132" series="PIC32MZW">
      <address-spaces>
        <address-space endianness="little" id="base" name="base" size="0x100000000" start="0">
          <memory-segment exec="" name="altCodeProtect" rw="" size="0x4" start="0x1FC55EBC" type=""/>
          <memory-segment exec="" name="altConfig" rw="" size="0x2c" start="0x1FC55E88" type=""/>
          <memory-segment exec="" name="lowerbootalias" rw="" size="0x10000" start="0x1FC00000" type=""/>
          <memory-segment exec="" name="otpmemory" rw="" size="0x1000" start="0x1FC16000" type=""/>
          <memory-segment exec="" name="code" rw="" size="0x200000" start="0x10000000" type=""/>
          <memory-segment exec="" name="codeProtect" rw="" size="0x4" start="0x1FC55FBC" type=""/>
          <memory-segment exec="" name="config" rw="" size="0x2c" start="0x1FC55F88" type=""/>
          <memory-segment exec="" name="devid" rw="" size="0x0" start="0xffffffff" type=""/>
          <memory-segment exec="" name="emulation" rw="" size="0x100000" start="0xff300000" type=""/>
          <memory-segment exec="" name="kseg0_data_mem" rw="" size="0x80000" start="0x0" type=""/>
          <memory-segment exec="" name="wcmDataMem" rw="" size="0x2000" start="0x1f803000" type=""/>
          <memory-segment exec="" name="crypto1SCM" rw="" size="0x2000" start="0x1F900000" type=""/>
          <memory-segment exec="" name="crypto1UCM" rw="" size="0x2000" start="0x1F902000" type=""/>
          <memory-segment exec="" name="configSfr0" rw="" size="0x70" start="0x1F800000" type=""/>
          <memory-segment exec="" name="configSfr1" rw="" size="0x490" start="0x1F800070" type=""/>
          <memory-segment exec="" name="periph_pb1a" rw="" size="0x2b00" start="0x1F800500" type=""/>
          <memory-segment exec="" name="periph_pb1b" rw="" size="0x5100" start="0x1f80fe00" type=""/>
          <memory-segment exec="" name="periph_pb2" rw="" size="0x20000" start="0x1F820000" type=""/>
          <memory-segment exec="" name="periph_pb3" rw="" size="0x20000" start="0x1F840000" type=""/>
          <memory-segment exec="" name="periph_pb4" rw="" size="0x10000" start="0x1F870000" type=""/>
          <memory-segment exec="" name="periph_indep_a" rw="" size="0x26000" start="0x1F8C0000" type=""/>
          <memory-segment exec="" name="periph_indep_b" rw="" size="0x20000" start="0x1F920000" type=""/>
        </address-space>
      </address-spaces>
      <property-groups>
        <property-group name="SIGNATURES">
          <property name="JTAGID" value=""/>
          <property name="CHIPID_CIDR" value=""/>
          <property name="CHIPID_EXID" value=""/>
        </property-group>
        <property-group name="LEGACY_INSTANCE_IDS"/>
      </property-groups>
      <parameters>
        <param caption="MPU present or not" name="__MPU_PRESENT" value="1"/>
        <param caption="Vector Table Offset Register present or not" name="__VTOR_PRESENT" value="0"/>
        <param caption="Number of interrupt priority levels" name="__INT_PRIO_LEVELS" value="7"/>
        <param caption="Number of interrupt subpriority levels" name="__INT_SUBPRIO_LEVELS" value="4"/>
        <param caption="Number of interrupt shadow register sets" name="__INT_NUM_SHADOW_SETS" value="7"/>
        <param caption="FPU present or not" name="__FPU_PRESENT" value="1"/>
        <param caption="Double Precision FPU implemented or not" name="__FPU_DP" value="0"/>
        <param caption="Instruction Cache present or not" name="__ICACHE_PRESENT" value="1"/>
        <param caption="Data Cache present or not" name="__DCACHE_PRESENT" value="1"/>
        <param caption="Instruction TCM present or not" name="__ITCM_PRESENT" value="0"/>
        <param caption="Data TCM present or not" name="__DTCM_PRESENT" value="0"/>
        <param caption="Little endian used or not" name="LITTLE_ENDIAN" value="1"/>
        <param caption="ARM architecture or not" name="__ARCH_ARM" value="0"/>
        <param caption="Primary Oscillator Input Default Frequency" name="__POSC_DEF_FREQ" value="40000000"/>
        <param caption="Secondary Oscillator Input Default Frequency" name="__SOSC_DEF_FREQ" value="32768"/>
        <param caption="System Clock Default Frequency" name="__SYS_DEF_FREQ" value="200000000"/>
        <param caption="FRC Default Frequency" name="__FRC_DEF_FREQ" value="8000000"/>
        <param caption="REFCLKI Pin Input Default Frequency" name="__REFCLKI_DEF_FREQ" value="8000000"/>
        <param caption="Peripheral Bus 1 Default Clock Frequency" name="__PB1_DEF_FREQ" value="100000000"/>
        <param caption="Peripheral Bus 2 Default Clock Frequency" name="__PB2_DEF_FREQ" value="100000000"/>
        <param caption="Peripheral Bus 3 Default Clock Frequency" name="__PB3_DEF_FREQ" value="100000000"/>
        <param caption="Peripheral Bus 4 Default Clock Frequency" name="__PB4_DEF_FREQ" value="100000000"/>
        <param caption="Peripheral Bus 5 Default Clock Frequency" name="__PB5_DEF_FREQ" value="100000000"/>
        <param caption="Peripheral Bus 6 Default Clock Frequency" name="__PB6_DEF_FREQ" value="200000000"/>
        <param caption="Reference Clock 1 Default Frequency" name="__REFCLK1_DEF_FREQ" value="200000000"/>
        <param caption="Reference Clock 2 Default Frequency" name="__REFCLK2_DEF_FREQ" value="200000000"/>
        <param caption="Reference Clock 3 Default Frequency" name="__REFCLK3_DEF_FREQ" value="200000000"/>
        <param caption="Reference Clock 4 Default Frequency" name="__REFCLK4_DEF_FREQ" value="200000000"/>
        <param caption="Number of DMA Channels" name="__NUM_DMA_CHANNELS" value="8"/>
      </parameters>
      <peripherals>
        <module id="02508" name="ADCHS" version="">
          <instance name="ADCHS">
            <register-group address-space="periph_pb2" name="ADCHS0" name-in-module="ADCHS" offset="0x1f821000"/>
            <parameters>
              <param name=""/>
            </parameters>
          </instance>
        </module>
