Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-W_DFP/1.8.326/atdf/PIC32MZ2051W104132.atdf
        <register caption="ADC Digital Filter x Register" name="ADCFLTR2" offset="0x1b0" rw="RW" size="4">
          <bitfield mask="0x0000FFFF" name="FLTRDATA"/>
          <bitfield caption="Digital Filter Analog Input Selection bits" mask="0x001F0000" name="CHNLID" values="ADCFLTR2__CHNLID"/>
          <bitfield caption="Digital Filter x Data Ready Status bit" mask="0x01000000" name="AFRDY" values="ADCFLTR2__AFRDY"/>
          <bitfield caption="Digital Filter x Interrupt Enable bit" mask="0x02000000" name="AFGIEN" values="ADCFLTR2__AFGIEN"/>
          <bitfield caption="Oversampling Filter Ratio bits" mask="0x1C000000" name="OVRSAM" values="ADCFLTR2__OVRSAM"/>
          <bitfield caption="ADC Filter Mode bit" mask="0x20000000" name="DFMODE" values="ADCFLTR2__DFMODE"/>
          <bitfield caption="Filter Significant Data Length bit" mask="0x40000000" name="DATA16EN" values="ADCFLTR2__DATA16EN"/>
          <bitfield caption="Digital Filter x Enable bit" mask="0x80000000" name="AFEN" values="ADCFLTR2__AFEN"/>
        </register>
        <register caption="ADC Trigger Source 1 Register" name="ADCTRG1" offset="0x200" rw="RW" size="4">
          <bitfield caption="Trigger Source for Conversion of ADC0 Module Select bits" mask="0x0000001F" name="TRGSRC0" values="ADCTRG1__TRGSRC0"/>
          <bitfield caption="Trigger Source for Conversion of Analog Input AN1 Select bits" mask="0x00001F00" name="TRGSRC1" values="ADCTRG1__TRGSRC1"/>
          <bitfield caption="Trigger Source for Conversion of Analog Input AN2 Select bits" mask="0x001F0000" name="TRGSRC2" values="ADCTRG1__TRGSRC2"/>
          <bitfield caption="Trigger Source for Conversion of Analog Input AN3 Select bits" mask="0x1F000000" name="TRGSRC3" values="ADCTRG1__TRGSRC3"/>
        </register>
        <register caption="ADC Trigger Source 2 Register" name="ADCTRG2" offset="0x210" rw="RW" size="4">
          <bitfield caption="Trigger Source for Conversion of Analog Input AN4 Select bits" mask="0x0000001F" name="TRGSRC4" values="ADCTRG2__TRGSRC4"/>
          <bitfield caption="Trigger Source for Conversion of Analog Input AN5 Select bits" mask="0x00001F00" name="TRGSRC5" values="ADCTRG2__TRGSRC5"/>
          <bitfield caption="Trigger Source for Conversion of Analog Input AN6 Select bits" mask="0x001F0000" name="TRGSRC6" values="ADCTRG2__TRGSRC6"/>
          <bitfield caption="Trigger Source for Conversion of Analog Input AN7 Select bits" mask="0x1F000000" name="TRGSRC7" values="ADCTRG2__TRGSRC7"/>
        </register>
        <register caption="ADC Digital Comparator 1 Control Register" name="ADCCMPCON1" offset="0x280" rw="RW" size="4">
          <bitfield mask="0x00000001" name="IELOLO"/>
          <bitfield mask="0x00000002" name="IELOHI"/>
          <bitfield mask="0x00000004" name="IEHILO"/>
          <bitfield mask="0x00000008" name="IEHIHI"/>
          <bitfield mask="0x00000010" name="IEBTWN"/>
          <bitfield mask="0x00000020" name="DCMPED"/>
          <bitfield mask="0x00000040" name="DCMPGIEN"/>
          <bitfield mask="0x00000080" name="ENDCMP"/>
          <bitfield mask="0x00003F00" name="AINID"/>
          <bitfield mask="0xFFFF0000" name="CVDDATA"/>
        </register>
        <register caption="ADC Digital Comparator 2 Control Register" name="ADCCMPCON2" offset="0x290" rw="RW" size="4">
          <bitfield mask="0x00000001" name="IELOLO"/>
          <bitfield mask="0x00000002" name="IELOHI"/>
          <bitfield mask="0x00000004" name="IEHILO"/>
          <bitfield mask="0x00000008" name="IEHIHI"/>
          <bitfield mask="0x00000010" name="IEBTWN"/>
          <bitfield mask="0x00000020" name="DCMPED"/>
          <bitfield mask="0x00000040" name="DCMPGIEN"/>
          <bitfield mask="0x00000080" name="ENDCMP"/>
          <bitfield mask="0x00001F00" name="AINID"/>
        </register>
        <register caption="ADC FIFO Status Register" name="ADCFSTAT" offset="0x2e0" rw="RW" size="4">
          <bitfield caption="ADCx Identifier bits" mask="0x00000007" name="ADCID" values="ADCFSTAT__ADCID"/>
          <bitfield mask="0x00000080" name="FSIGN"/>
          <bitfield mask="0x0000FF00" name="FCNT"/>
          <bitfield caption="FIFO Write Overflow Error Status bit" mask="0x00200000" name="FWROVERR" values="ADCFSTAT__FWROVERR"/>
          <bitfield caption="FIFO Data Ready Interrupt Status bit" mask="0x00400000" name="FRDY" values="ADCFSTAT__FRDY"/>
          <bitfield caption="FIFO Interrupt Enable bit" mask="0x00800000" name="FIEN" values="ADCFSTAT__FIEN"/>
          <bitfield caption="ADC0 Enable bit" mask="0x01000000" name="ADC0EN" values="ADCFSTAT__ADC0EN"/>
          <bitfield caption="FIFO Enable bit" mask="0x80000000" name="FEN" values="ADCFSTAT__FEN"/>
        </register>
        <register caption="ADC FIFO Data Register" name="ADCFIFO" offset="0x2f0" rw="R" size="4">
          <bitfield mask="0xFFFFFFFF" name="DATA"/>
        </register>
        <register caption="ADC Base Register" name="ADCBASE" offset="0x300" rw="RW" size="4">
          <bitfield mask="0x0000FFFF" name="ADCBASE"/>
        </register>
        <register caption="" name="ADCDMAST" offset="0x310" rw="RW" size="4">
          <bitfield mask="0x00000001" name="RAF0"/>
          <bitfield mask="0x00000100" name="RAF0IEN"/>
          <bitfield mask="0x00008000" name="DMACNTEN"/>
          <bitfield mask="0x00010000" name="RBF0"/>
          <bitfield mask="0x00800000" name="WROVRERR"/>
          <bitfield mask="0x01000000" name="RBF0IEN"/>
          <bitfield mask="0x80000000" name="DMAEN"/>
        </register>
        <register caption="" name="ADCCNTB" offset="0x320" rw="RW" size="4">
          <bitfield mask="0xFFFFFFFF" name="ADCCNTB"/>
        </register>
        <register caption="" name="ADCDMAB" offset="0x330" rw="RW" size="4">
          <bitfield mask="0xFFFFFFFF" name="ADDMAB"/>
        </register>
        <register caption="ADC Trigger Level/Edge Sensitivity Register" name="ADCTRGSNS" offset="0x340" rw="RW" size="4">
          <bitfield caption="Trigger Level and Edge Sensitivity bit 0" mask="0x00000001" name="LVL0" values="ADCTRGSNS__LVL0"/>
          <bitfield caption="Trigger Level and Edge Sensitivity bit 1" mask="0x00000002" name="LVL1" values="ADCTRGSNS__LVL1"/>
          <bitfield caption="Trigger Level and Edge Sensitivity bit 2" mask="0x00000004" name="LVL2" values="ADCTRGSNS__LVL2"/>
          <bitfield caption="Trigger Level and Edge Sensitivity bit 3" mask="0x00000008" name="LVL3" values="ADCTRGSNS__LVL3"/>
          <bitfield caption="Trigger Level and Edge Sensitivity bit 4" mask="0x00000010" name="LVL4" values="ADCTRGSNS__LVL4"/>
          <bitfield caption="Trigger Level and Edge Sensitivity bit 5" mask="0x00000020" name="LVL5" values="ADCTRGSNS__LVL5"/>
          <bitfield caption="Trigger Level and Edge Sensitivity bit 6" mask="0x00000040" name="LVL6" values="ADCTRGSNS__LVL6"/>
          <bitfield caption="Trigger Level and Edge Sensitivity bit 7" mask="0x00000080" name="LVL7" values="ADCTRGSNS__LVL7"/>
        </register>
        <register caption="Dedicated ADCx Timing Register 0" name="ADC0TIME" offset="0x350" rw="RW" size="4">
          <bitfield caption="ADCx Sample Time bits" mask="0x000003FF" name="SAMC" values="ADC0TIME__SAMC"/>
          <bitfield caption="ADCx Clock Divisor bits" mask="0x007F0000" name="ADCDIV" values="ADC0TIME__ADCDIV"/>
          <bitfield caption="ADCx Resolution Select bits" mask="0x03000000" name="SELRES" values="ADC0TIME__SELRES"/>
          <bitfield caption="ADCx Early Interrupt Select bits" mask="0x1C000000" name="ADCEIS" values="ADC0TIME__ADCEIS"/>
        </register>
        <register caption="" name="ADCEISTAT1" offset="0x3e0" rw="RW" size="4">
          <bitfield caption="Early Interrupt for Corresponding Analog Input Ready bit 0" mask="0x00000001" name="EIRDY0" values="ADCEISTAT1__EIRDY0"/>
          <bitfield caption="Early Interrupt for Corresponding Analog Input Ready bit 1" mask="0x00000002" name="EIRDY1" values="ADCEISTAT1__EIRDY1"/>
          <bitfield caption="Early Interrupt for Corresponding Analog Input Ready bit 2" mask="0x00000004" name="EIRDY2" values="ADCEISTAT1__EIRDY2"/>
          <bitfield caption="Early Interrupt for Corresponding Analog Input Ready bit 3" mask="0x00000008" name="EIRDY3" values="ADCEISTAT1__EIRDY3"/>
          <bitfield caption="Early Interrupt for Corresponding Analog Input Ready bit 4" mask="0x00000010" name="EIRDY4" values="ADCEISTAT1__EIRDY4"/>
          <bitfield caption="Early Interrupt for Corresponding Analog Input Ready bit 5" mask="0x00000020" name="EIRDY5" values="ADCEISTAT1__EIRDY5"/>
          <bitfield caption="Early Interrupt for Corresponding Analog Input Ready bit 6" mask="0x00000040" name="EIRDY6" values="ADCEISTAT1__EIRDY6"/>
          <bitfield caption="Early Interrupt for Corresponding Analog Input Ready bit 7" mask="0x00000080" name="EIRDY7" values="ADCEISTAT1__EIRDY7"/>
          <bitfield caption="Early Interrupt for Corresponding Analog Input Ready bit 8" mask="0x00000100" name="EIRDY8" values="ADCEISTAT1__EIRDY8"/>
          <bitfield caption="Early Interrupt for Corresponding Analog Input Ready bit 9" mask="0x00000200" name="EIRDY9" values="ADCEISTAT1__EIRDY9"/>
          <bitfield caption="Early Interrupt for Corresponding Analog Input Ready bit 10" mask="0x00000400" name="EIRDY10" values="ADCEISTAT1__EIRDY10"/>
          <bitfield caption="Early Interrupt for Corresponding Analog Input Ready bit 11" mask="0x00000800" name="EIRDY11" values="ADCEISTAT1__EIRDY11"/>
          <bitfield caption="Early Interrupt for Corresponding Analog Input Ready bit 12" mask="0x00001000" name="EIRDY12" values="ADCEISTAT1__EIRDY12"/>
          <bitfield caption="Early Interrupt for Corresponding Analog Input Ready bit 13" mask="0x00002000" name="EIRDY13" values="ADCEISTAT1__EIRDY13"/>
          <bitfield caption="Early Interrupt for Corresponding Analog Input Ready bit 14" mask="0x00004000" name="EIRDY14" values="ADCEISTAT1__EIRDY14"/>
          <bitfield caption="Early Interrupt for Corresponding Analog Input Ready bit 15" mask="0x00008000" name="EIRDY15" values="ADCEISTAT1__EIRDY15"/>
          <bitfield caption="Early Interrupt for Corresponding Analog Input Ready bit 16" mask="0x00010000" name="EIRDY16" values="ADCEISTAT1__EIRDY16"/>
          <bitfield caption="Early Interrupt for Corresponding Analog Input Ready bit 17" mask="0x00020000" name="EIRDY17" values="ADCEISTAT1__EIRDY17"/>
          <bitfield caption="Early Interrupt for Corresponding Analog Input Ready bit 18" mask="0x00040000" name="EIRDY18" values="ADCEISTAT1__EIRDY18"/>
          <bitfield caption="Early Interrupt for Corresponding Analog Input Ready bit 19" mask="0x00080000" name="EIRDY19" values="ADCEISTAT1__EIRDY19"/>
        </register>
        <register caption="ADC Analog Warm-up Control Register" name="ADCANCON" offset="0x400" rw="RW" size="4">
          <bitfield caption="ADC0 Analog and Bias Circuitry Enable bit" mask="0x00000001" name="ANEN0" values="ADCANCON__ANEN0"/>
          <bitfield caption="Shared ADC Analog and Bias Circuitry Enable bit" mask="0x00000080" name="ANEN7" values="ADCANCON__ANEN7"/>
          <bitfield caption="ADC 0 Wake-up Status bit" mask="0x00000100" name="WKRDY0" values="ADCANCON__WKRDY0"/>
          <bitfield caption="Shared ADC Wake-up Status bit" mask="0x00008000" name="WKRDY7" values="ADCANCON__WKRDY7"/>
          <bitfield caption="ADC 0 Wake-up Interrupt Enable bit" mask="0x00010000" name="WKIEN0" values="ADCANCON__WKIEN0"/>
          <bitfield caption="Shared ADC Wake-up Interrupt Enable bit" mask="0x00800000" name="WKIEN7" values="ADCANCON__WKIEN7"/>
          <bitfield caption="Wake-up Clock Count bits" mask="0x0F000000" name="WKUPCLKCNT" values="ADCANCON__WKUPCLKCNT"/>
        </register>
        <register caption="" name="ADC0CFG" offset="0x600" rw="RW" size="4">
          <bitfield mask="0xFFFFFFFF" name="ADCCFG"/>
        </register>
        <register caption="" name="ADC7CFG" offset="0x670" rw="RW" size="4">
          <bitfield mask="0xFFFFFFFF" name="ADCCFG"/>
        </register>
        <register caption="" name="ADCSVCON" offset="0x680" rw="RW" size="4">
          <bitfield mask="0x0000003F" name="SVSEL"/>
          <bitfield mask="0x00000040" name="SVCLKEN"/>
          <bitfield mask="0x00000080" name="ADSVEN"/>
        </register>
