Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-W_DFP/1.8.326/atdf/PIC32MZ2051W104132.atdf
        <register caption="" name="ADCSYSCFG0" offset="0x700" rw="RW" size="4">
          <bitfield mask="0x00000001" name="AN0"/>
          <bitfield mask="0x00000002" name="AN1"/>
          <bitfield mask="0x00000004" name="AN2"/>
          <bitfield mask="0x00000008" name="AN3"/>
          <bitfield mask="0x00000010" name="AN4"/>
          <bitfield mask="0x00000020" name="AN5"/>
          <bitfield mask="0x00000040" name="AN6"/>
          <bitfield mask="0x00000080" name="AN7"/>
          <bitfield mask="0x00000100" name="AN8"/>
          <bitfield mask="0x00000200" name="AN9"/>
          <bitfield mask="0x00000400" name="AN10"/>
          <bitfield mask="0x00000800" name="AN11"/>
          <bitfield mask="0x00001000" name="AN12"/>
          <bitfield mask="0x00002000" name="AN13"/>
          <bitfield mask="0x00004000" name="AN14"/>
          <bitfield mask="0x00008000" name="AN15"/>
          <bitfield mask="0x00010000" name="AN16"/>
          <bitfield mask="0x00020000" name="AN17"/>
          <bitfield mask="0x00040000" name="AN18"/>
          <bitfield mask="0x00080000" name="AN19"/>
        </register>
        <register caption="" name="ADCDATA0" offset="0xa00" rw="RW" size="4">
          <bitfield mask="0xFFFFFFFF" name="DATA"/>
        </register>
        <register caption="" name="ADCDATA1" offset="0xa10" rw="RW" size="4">
          <bitfield mask="0xFFFFFFFF" name="DATA"/>
        </register>
        <register caption="" name="ADCDATA2" offset="0xa20" rw="RW" size="4">
          <bitfield mask="0xFFFFFFFF" name="DATA"/>
        </register>
        <register caption="" name="ADCDATA3" offset="0xa30" rw="RW" size="4">
          <bitfield mask="0xFFFFFFFF" name="DATA"/>
        </register>
        <register caption="" name="ADCDATA4" offset="0xa40" rw="RW" size="4">
          <bitfield mask="0xFFFFFFFF" name="DATA"/>
        </register>
        <register caption="" name="ADCDATA5" offset="0xa50" rw="RW" size="4">
          <bitfield mask="0xFFFFFFFF" name="DATA"/>
        </register>
        <register caption="" name="ADCDATA6" offset="0xa60" rw="RW" size="4">
          <bitfield mask="0xFFFFFFFF" name="DATA"/>
        </register>
        <register caption="" name="ADCDATA7" offset="0xa70" rw="RW" size="4">
          <bitfield mask="0xFFFFFFFF" name="DATA"/>
        </register>
        <register caption="" name="ADCDATA8" offset="0xa80" rw="RW" size="4">
          <bitfield mask="0xFFFFFFFF" name="DATA"/>
        </register>
        <register caption="" name="ADCDATA9" offset="0xa90" rw="RW" size="4">
          <bitfield mask="0xFFFFFFFF" name="DATA"/>
        </register>
        <register caption="" name="ADCDATA10" offset="0xaa0" rw="RW" size="4">
          <bitfield mask="0xFFFFFFFF" name="DATA"/>
        </register>
        <register caption="" name="ADCDATA11" offset="0xab0" rw="RW" size="4">
          <bitfield mask="0xFFFFFFFF" name="DATA"/>
        </register>
        <register caption="" name="ADCDATA12" offset="0xac0" rw="RW" size="4">
          <bitfield mask="0xFFFFFFFF" name="DATA"/>
        </register>
        <register caption="" name="ADCDATA13" offset="0xad0" rw="RW" size="4">
          <bitfield mask="0xFFFFFFFF" name="DATA"/>
        </register>
        <register caption="" name="ADCDATA14" offset="0xae0" rw="RW" size="4">
          <bitfield mask="0xFFFFFFFF" name="DATA"/>
        </register>
        <register caption="" name="ADCDATA15" offset="0xaf0" rw="RW" size="4">
          <bitfield mask="0xFFFFFFFF" name="DATA"/>
        </register>
        <register caption="" name="ADCDATA16" offset="0xb00" rw="RW" size="4">
          <bitfield mask="0xFFFFFFFF" name="DATA"/>
        </register>
        <register caption="" name="ADCDATA17" offset="0xb10" rw="RW" size="4">
          <bitfield mask="0xFFFFFFFF" name="DATA"/>
        </register>
        <register caption="" name="ADCDATA18" offset="0xb20" rw="RW" size="4">
          <bitfield mask="0xFFFFFFFF" name="DATA"/>
        </register>
        <register caption="" name="ADCDATA19" offset="0xb30" rw="RW" size="4">
          <bitfield mask="0xFFFFFFFF" name="DATA"/>
        </register>
        <register caption="" name="ADCDATA20" offset="0xb40" rw="RW" size="4">
          <bitfield mask="0xFFFFFFFF" name="DATA"/>
        </register>
        <register caption="" name="ADCDATA21" offset="0xb50" rw="RW" size="4">
          <bitfield mask="0xFFFFFFFF" name="DATA"/>
        </register>
        <register caption="" name="ADCDATA22" offset="0xb60" rw="RW" size="4">
          <bitfield mask="0xFFFFFFFF" name="DATA"/>
        </register>
        <register caption="" name="ADCDATA23" offset="0xb70" rw="RW" size="4">
          <bitfield mask="0xFFFFFFFF" name="DATA"/>
        </register>
      </register-group>
	  <value-group caption="DMA to System RAM Buffer Length Size bits" name="ADCCON1__DMABL">
         <value caption="Allocates 128 locations in system memory to each analog input" name="" value="0x7" />
         <value caption="Allocates 64 locations in system memory to each analog input" name="" value="0x6" />
         <value caption="Allocates 32 locations in system memory to each analog input" name="" value="0x5" />
         <value caption="Allocates 16 locations in system memory to each analog input" name="" value="0x4" />
         <value caption="Allocates 8 locations in system memory to each analog input" name="" value="0x3" />
         <value caption="Allocates 4 locations in system memory to each analog input" name="" value="0x2" />
         <value caption="Allocates 2 locations in system memory to each analog input" name="" value="0x1" />
         <value caption="Allocates 1 location in system memory to each analog input" name="" value="0x0" />
      </value-group>
      <value-group caption="Scan Trigger High Level/Positive Edge Sensitivity bit" name="ADCCON1__STRGLVL">
        <value caption="Scan trigger is high level sensitive. Once STRIG mode is selected (TRGSRCx in the ADCTRGx register)" name="" value="0x1"/>
        <value caption="Scan trigger is positive edge sensitive. Once STRIG mode is selected (TRGSRCx in the ADCTRGx register)" name="" value="0x0"/>
      </value-group>
