Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-W_DFP/1.8.326/atdf/PIC32MZ2051W104132.atdf
      <value-group caption="Voltage Reference Input Selection bits" name="ADCCON3__VREFSEL">
        <value caption="Reserved" name="" value="0x7"/>
        <value caption="Reserved" name="" value="0x6"/>
        <value caption="Reserved" name="" value="0x5"/>
        <value caption="Reserved" name="" value="0x4"/>
        <value caption="Reserved" name="" value="0x3"/>
        <value caption="Reserved" name="" value="0x2"/>
        <value caption="Reserved" name="" value="0x1"/>
        <value caption="External AVDD and AVSS" name="" value="0x0"/>
      </value-group>
      <value-group caption="ADC0 Digital Enable bit" name="ADCCON3__DIGEN0">
        <value caption="ADC0 is digital enabled" name="" value="0x1"/>
        <value caption="ADC0 is digital disabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="Shared ADC Digital Enable bit" name="ADCCON3__DIGEN7">
        <value caption="ADC7 is digital enabled" name="" value="0x1"/>
        <value caption="ADC7 is digital disabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="Analog-to-Digital Control Clock Divider bits" name="ADCCON3__CONCLKDIV">
        <value caption="64 * Tclk = Tq" name="" value="0x3f"/>
        <value caption="4 * Tclk = Tq" name="" value="0x3"/>
        <value caption="3 * Tclk = Tq" name="" value="0x2"/>
        <value caption="2 * Tclk = Tq" name="" value="0x1"/>
        <value caption="Tclk = Tq" name="" value="0x0"/>
      </value-group>
      <value-group caption="Analog-to-Digital Clock Source bits" name="ADCCON3__ADCSEL">
        <value caption="System Clock (Tcy)" name="" value="0x3"/>
        <value caption="REFCLK3" name="" value="0x2"/>
        <value caption="FRC" name="" value="0x1"/>
        <value caption="PBCLK2" name="" value="0x0"/>
      </value-group>
      <value-group caption="ADC0 Synchronous Sampling bit" name="ADCTRGMODE__SSAMPEN0">
        <value caption="ADC0 uses synchronous sampling for the first sample after being idle or disabled" name="" value="0x1"/>
        <value caption="ADC0 does not use synchronous sampling" name="" value="0x0"/>
      </value-group>
      <value-group caption="ADC0 Presynchronized Triggers bit" name="ADCTRGMODE__STRGEN0">
        <value caption="ADC0 uses presynchronized triggers" name="" value="0x1"/>
        <value caption="ADC0 does not use presynchronized triggers" name="" value="0x0"/>
      </value-group>
      <value-group caption="ADC0 Analog Input Select bit" name="ADCTRGMODE__SH0ALT">
        <value caption="Reserved" name="" value="0x3"/>
        <value caption="ANB0" name="" value="0x2"/>
        <value caption="ANA0" name="" value="0x1"/>
        <value caption="AN0" name="" value="0x0"/>
      </value-group>
      <value-group caption="AN0 Signed Data Mode bit" name="ADCIMCON1__SIGN0">
        <value caption="AN0 is using Signed Data mode" name="" value="0x1"/>
        <value caption="AN0 is using Unsigned Data mode" name="" value="0x0"/>
      </value-group>
      <value-group caption="AN0 Mode bit" name="ADCIMCON1__DIFF0">
        <value caption="AN0 is using Differential mode" name="" value="0x1"/>
        <value caption="AN0 is using Single-ended mode" name="" value="0x0"/>
      </value-group>
      <value-group caption="AN1 Signed Data Mode bit" name="ADCIMCON1__SIGN1">
        <value caption="AN1 is using Signed Data mode" name="" value="0x1"/>
        <value caption="AN1 is using Unsigned Data mode" name="" value="0x0"/>
      </value-group>
      <value-group caption="AN1 Mode bit" name="ADCIMCON1__DIFF1">
        <value caption="AN1 is using Differential mode" name="" value="0x1"/>
        <value caption="AN1 is using Single-ended mode" name="" value="0x0"/>
      </value-group>
      <value-group caption="AN2 Signed Data Mode bit" name="ADCIMCON1__SIGN2">
        <value caption="AN2 is using Signed Data mode" name="" value="0x1"/>
        <value caption="AN2 is using Unsigned Data mode" name="" value="0x0"/>
      </value-group>
      <value-group caption="AN2 Mode bit" name="ADCIMCON1__DIFF2">
        <value caption="AN2 is using Differential mode" name="" value="0x1"/>
        <value caption="AN2 is using Single-ended mode" name="" value="0x0"/>
      </value-group>
      <value-group caption="AN3 Signed Data Mode bit" name="ADCIMCON1__SIGN3">
        <value caption="AN3 is using Signed Data mode" name="" value="0x1"/>
        <value caption="AN3 is using Unsigned Data mode" name="" value="0x0"/>
      </value-group>
      <value-group caption="AN3 Mode bit" name="ADCIMCON1__DIFF3">
        <value caption="AN3 is using Differential mode" name="" value="0x1"/>
        <value caption="AN3 is using Single-ended mode" name="" value="0x0"/>
      </value-group>
      <value-group caption="AN4 Signed Data Mode bit" name="ADCIMCON1__SIGN4">
        <value caption="AN4 is using Signed Data mode" name="" value="0x1"/>
        <value caption="AN4 is using Unsigned Data mode" name="" value="0x0"/>
      </value-group>
      <value-group caption="AN4 Mode bit" name="ADCIMCON1__DIFF4">
        <value caption="AN4 is using Differential mode" name="" value="0x1"/>
        <value caption="AN4 is using Single-ended mode" name="" value="0x0"/>
      </value-group>
      <value-group caption="AN5 Signed Data Mode bit" name="ADCIMCON1__SIGN5">
        <value caption="AN5 is using Signed Data mode" name="" value="0x1"/>
        <value caption="AN5 is using Unsigned Data mode" name="" value="0x0"/>
      </value-group>
      <value-group caption="AN5 Mode bit" name="ADCIMCON1__DIFF5">
        <value caption="AN5 is using Differential mode" name="" value="0x1"/>
        <value caption="AN5 is using Single-ended mode" name="" value="0x0"/>
      </value-group>
      <value-group caption="AN6 Signed Data Mode bit" name="ADCIMCON1__SIGN6">
        <value caption="AN6 is using Signed Data mode" name="" value="0x1"/>
        <value caption="AN6 is using Unsigned Data mode" name="" value="0x0"/>
      </value-group>
      <value-group caption="AN6 Mode bit" name="ADCIMCON1__DIFF6">
        <value caption="AN6 is using Differential mode" name="" value="0x1"/>
        <value caption="AN6 is using Single-ended mode" name="" value="0x0"/>
      </value-group>
      <value-group caption="AN7 Signed Data Mode bit" name="ADCIMCON1__SIGN7">
        <value caption="AN7 is using Signed Data mode" name="" value="0x1"/>
        <value caption="AN7 is using Unsigned Data mode" name="" value="0x0"/>
      </value-group>
