Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-W_DFP/1.8.326/atdf/PIC32MZ2051W104132.atdf
      <value-group caption="Analog Common Scan Select bits 17" name="ADCCSS1__CSS17">
        <value caption="Select ANx for input scan" name="" value="0x1"/>
        <value caption="Skip ANx for input scan" name="" value="0x0"/>
      </value-group>
      <value-group caption="Analog Common Scan Select bits 18" name="ADCCSS1__CSS18">
        <value caption="Select ANx for input scan" name="" value="0x1"/>
        <value caption="Skip ANx for input scan" name="" value="0x0"/>
      </value-group>
      <value-group caption="Analog Common Scan Select bits 19" name="ADCCSS1__CSS19">
        <value caption="Select ANx for input scan" name="" value="0x1"/>
        <value caption="Skip ANx for input scan" name="" value="0x0"/>
      </value-group>
      <value-group caption="Conversion Data Ready for Corresponding Analog Input Ready bit 0" name="ADCDSTAT1__ARDY0">
        <value caption="This bit is set when converted data is ready in the data register" name="" value="0x1"/>
        <value caption="This bit is cleared when the associated data register is read" name="" value="0x0"/>
      </value-group>
      <value-group caption="Conversion Data Ready for Corresponding Analog Input Ready bit 1" name="ADCDSTAT1__ARDY1">
        <value caption="This bit is set when converted data is ready in the data register" name="" value="0x1"/>
        <value caption="This bit is cleared when the associated data register is read" name="" value="0x0"/>
      </value-group>
      <value-group caption="Conversion Data Ready for Corresponding Analog Input Ready bit 2" name="ADCDSTAT1__ARDY2">
        <value caption="This bit is set when converted data is ready in the data register" name="" value="0x1"/>
        <value caption="This bit is cleared when the associated data register is read" name="" value="0x0"/>
      </value-group>
      <value-group caption="Conversion Data Ready for Corresponding Analog Input Ready bit 3" name="ADCDSTAT1__ARDY3">
        <value caption="This bit is set when converted data is ready in the data register" name="" value="0x1"/>
        <value caption="This bit is cleared when the associated data register is read" name="" value="0x0"/>
      </value-group>
      <value-group caption="Conversion Data Ready for Corresponding Analog Input Ready bit 4" name="ADCDSTAT1__ARDY4">
        <value caption="This bit is set when converted data is ready in the data register" name="" value="0x1"/>
        <value caption="This bit is cleared when the associated data register is read" name="" value="0x0"/>
      </value-group>
      <value-group caption="Conversion Data Ready for Corresponding Analog Input Ready bit 5" name="ADCDSTAT1__ARDY5">
        <value caption="This bit is set when converted data is ready in the data register" name="" value="0x1"/>
        <value caption="This bit is cleared when the associated data register is read" name="" value="0x0"/>
      </value-group>
      <value-group caption="Conversion Data Ready for Corresponding Analog Input Ready bit 6" name="ADCDSTAT1__ARDY6">
        <value caption="This bit is set when converted data is ready in the data register" name="" value="0x1"/>
        <value caption="This bit is cleared when the associated data register is read" name="" value="0x0"/>
      </value-group>
      <value-group caption="Conversion Data Ready for Corresponding Analog Input Ready bit 7" name="ADCDSTAT1__ARDY7">
        <value caption="This bit is set when converted data is ready in the data register" name="" value="0x1"/>
        <value caption="This bit is cleared when the associated data register is read" name="" value="0x0"/>
      </value-group>
      <value-group caption="Conversion Data Ready for Corresponding Analog Input Ready bit 8" name="ADCDSTAT1__ARDY8">
        <value caption="This bit is set when converted data is ready in the data register" name="" value="0x1"/>
        <value caption="This bit is cleared when the associated data register is read" name="" value="0x0"/>
      </value-group>
      <value-group caption="Conversion Data Ready for Corresponding Analog Input Ready bit 9" name="ADCDSTAT1__ARDY9">
        <value caption="This bit is set when converted data is ready in the data register" name="" value="0x1"/>
        <value caption="This bit is cleared when the associated data register is read" name="" value="0x0"/>
      </value-group>
      <value-group caption="Conversion Data Ready for Corresponding Analog Input Ready bit 10" name="ADCDSTAT1__ARDY10">
        <value caption="This bit is set when converted data is ready in the data register" name="" value="0x1"/>
        <value caption="This bit is cleared when the associated data register is read" name="" value="0x0"/>
      </value-group>
      <value-group caption="Conversion Data Ready for Corresponding Analog Input Ready bit 11" name="ADCDSTAT1__ARDY11">
        <value caption="This bit is set when converted data is ready in the data register" name="" value="0x1"/>
        <value caption="This bit is cleared when the associated data register is read" name="" value="0x0"/>
      </value-group>
      <value-group caption="Conversion Data Ready for Corresponding Analog Input Ready bit 12" name="ADCDSTAT1__ARDY12">
        <value caption="This bit is set when converted data is ready in the data register" name="" value="0x1"/>
        <value caption="This bit is cleared when the associated data register is read" name="" value="0x0"/>
      </value-group>
      <value-group caption="Conversion Data Ready for Corresponding Analog Input Ready bit 13" name="ADCDSTAT1__ARDY13">
        <value caption="This bit is set when converted data is ready in the data register" name="" value="0x1"/>
        <value caption="This bit is cleared when the associated data register is read" name="" value="0x0"/>
      </value-group>
      <value-group caption="Conversion Data Ready for Corresponding Analog Input Ready bit 14" name="ADCDSTAT1__ARDY14">
        <value caption="This bit is set when converted data is ready in the data register" name="" value="0x1"/>
        <value caption="This bit is cleared when the associated data register is read" name="" value="0x0"/>
      </value-group>
      <value-group caption="Conversion Data Ready for Corresponding Analog Input Ready bit 15" name="ADCDSTAT1__ARDY15">
        <value caption="This bit is set when converted data is ready in the data register" name="" value="0x1"/>
        <value caption="This bit is cleared when the associated data register is read" name="" value="0x0"/>
      </value-group>
