Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-W_DFP/1.8.326/atdf/PIC32MZ2051W104132.atdf
      <value-group caption="Conversion Data Ready for Corresponding Analog Input Ready bit 16" name="ADCDSTAT1__ARDY16">
        <value caption="This bit is set when converted data is ready in the data register" name="" value="0x1"/>
        <value caption="This bit is cleared when the associated data register is read" name="" value="0x0"/>
      </value-group>
      <value-group caption="Conversion Data Ready for Corresponding Analog Input Ready bit 17" name="ADCDSTAT1__ARDY17">
        <value caption="This bit is set when converted data is ready in the data register" name="" value="0x1"/>
        <value caption="This bit is cleared when the associated data register is read" name="" value="0x0"/>
      </value-group>
      <value-group caption="Conversion Data Ready for Corresponding Analog Input Ready bit 18" name="ADCDSTAT1__ARDY18">
        <value caption="This bit is set when converted data is ready in the data register" name="" value="0x1"/>
        <value caption="This bit is cleared when the associated data register is read" name="" value="0x0"/>
      </value-group>
      <value-group caption="Conversion Data Ready for Corresponding Analog Input Ready bit 19" name="ADCDSTAT1__ARDY19">
        <value caption="This bit is set when converted data is ready in the data register" name="" value="0x1"/>
        <value caption="This bit is cleared when the associated data register is read" name="" value="0x0"/>
      </value-group>
      <value-group caption="Digital Filter Analog Input Selection bits" name="ADCFLTR1__CHNLID">
        <value caption="Reserved" name="" value="0x1f"/>
        <value caption="Reserved" name="" value="0xc"/>
        <value caption="AN11" name="" value="0xb"/>
        <value caption="AN2" name="" value="0x2"/>
        <value caption="AN1" name="" value="0x1"/>
        <value caption="AN0" name="" value="0x0"/>
      </value-group>
      <value-group caption="Digital Filter x Data Ready Status bit" name="ADCFLTR1__AFRDY">
        <value caption="Data is ready in the FLTRDATA bits" name="" value="0x1"/>
        <value caption="Data is not ready" name="" value="0x0"/>
      </value-group>
      <value-group caption="Digital Filter x Interrupt Enable bit" name="ADCFLTR1__AFGIEN">
        <value caption="Digital filter interrupt is enabled and is generated by the AFRDY status bit" name="" value="0x1"/>
        <value caption="Digital filter is disabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="Oversampling Filter Ratio bits" name="ADCFLTR1__OVRSAM">
        <value caption="(If DFMODE is 0) 128 samples (shift sum 3 bits to right" name="" value="0x7"/>
        <value caption="(If DFMODE is 0) 32 samples (shift sum 2 bits to right" name="" value="0x6"/>
        <value caption="(If DFMODE is 0) 8 samples (shift sum 1 bit to right" name="" value="0x5"/>
        <value caption="(If DFMODE is 0) 2 samples (shift sum 0 bits to right" name="" value="0x4"/>
        <value caption="(If DFMODE is 0) 256 samples (shift sum 4 bits to right" name="" value="0x3"/>
        <value caption="(If DFMODE is 0) 64 samples (shift sum 3 bits to right" name="" value="0x2"/>
        <value caption="(If DFMODE is 0) 16 samples (shift sum 2 bits to right" name="" value="0x1"/>
        <value caption="(If DFMODE is 0) 4 samples (shift sum 1 bit to right" name="" value="0x0"/>
      </value-group>
      <value-group caption="ADC Filter Mode bit" name="ADCFLTR1__DFMODE">
        <value caption="Filter x works in Averaging mode" name="" value="0x1"/>
        <value caption="Filter x works in Oversampling Filter mode (default)" name="" value="0x0"/>
      </value-group>
      <value-group caption="Filter Significant Data Length bit" name="ADCFLTR1__DATA16EN">
        <value caption="All 16 bits of the filter output data are significant" name="" value="0x1"/>
        <value caption="Only the first 12 bits are significant" name="" value="0x0"/>
      </value-group>
      <value-group caption="Digital Filter x Enable bit" name="ADCFLTR1__AFEN">
        <value caption="Digital filter is enabled" name="" value="0x1"/>
        <value caption="Digital filter is disabled and the AFRDY status bit is cleared" name="" value="0x0"/>
      </value-group>
      <value-group caption="Digital Filter Analog Input Selection bits" name="ADCFLTR2__CHNLID">
        <value caption="Reserved" name="" value="0x1f"/>
        <value caption="Reserved" name="" value="0xc"/>
        <value caption="AN11" name="" value="0xb"/>
        <value caption="AN2" name="" value="0x2"/>
        <value caption="AN1" name="" value="0x1"/>
        <value caption="AN0" name="" value="0x0"/>
      </value-group>
      <value-group caption="Digital Filter x Data Ready Status bit" name="ADCFLTR2__AFRDY">
        <value caption="Data is ready in the FLTRDATA bits" name="" value="0x1"/>
        <value caption="Data is not ready" name="" value="0x0"/>
      </value-group>
      <value-group caption="Digital Filter x Interrupt Enable bit" name="ADCFLTR2__AFGIEN">
        <value caption="Digital filter interrupt is enabled and is generated by the AFRDY status bit" name="" value="0x1"/>
        <value caption="Digital filter is disabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="Oversampling Filter Ratio bits" name="ADCFLTR2__OVRSAM">
        <value caption="(If DFMODE is 0) 128 samples (shift sum 3 bits to right" name="" value="0x7"/>
        <value caption="(If DFMODE is 0) 32 samples (shift sum 2 bits to right" name="" value="0x6"/>
        <value caption="(If DFMODE is 0) 8 samples (shift sum 1 bit to right" name="" value="0x5"/>
        <value caption="(If DFMODE is 0) 2 samples (shift sum 0 bits to right" name="" value="0x4"/>
        <value caption="(If DFMODE is 0) 256 samples (shift sum 4 bits to right" name="" value="0x3"/>
        <value caption="(If DFMODE is 0) 64 samples (shift sum 3 bits to right" name="" value="0x2"/>
        <value caption="(If DFMODE is 0) 16 samples (shift sum 2 bits to right" name="" value="0x1"/>
        <value caption="(If DFMODE is 0) 4 samples (shift sum 1 bit to right" name="" value="0x0"/>
      </value-group>
      <value-group caption="ADC Filter Mode bit" name="ADCFLTR2__DFMODE">
        <value caption="Filter x works in Averaging mode" name="" value="0x1"/>
        <value caption="Filter x works in Oversampling Filter mode (default)" name="" value="0x0"/>
      </value-group>
