Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-W_DFP/1.8.326/atdf/PIC32MZ2051W104132.atdf
      <value-group caption="Trigger Source for Conversion of Analog Input AN6 Select bits" name="ADCTRG2__TRGSRC7">
        <value caption="External Trigger for Validation" name="" value="0x1f"/>
        <value caption="PTG Trigger Out 15" name="" value="0x17"/>
        <value caption="PTG Trigger Out 14" name="" value="0x16"/>
        <value caption="PTG Trigger Out 13" name="" value="0x15"/>
        <value caption="PTG Trigger Out 12" name="" value="0x14"/>
        <value caption="Output Compare 4 period end" name="" value="0x12"/>
        <value caption="Output Compare 3 period end" name="" value="0x11"/>
        <value caption="Output Compare 2 period end" name="" value="0x10"/>
        <value caption="Output Compare 1 period end" name="" value="0x9"/>
        <value caption="General Purpose Timer7" name="" value="0x8"/>
        <value caption="General Purpose Timer5" name="" value="0x7"/>
        <value caption="General Purpose Timer3" name="" value="0x6"/>
        <value caption="General Purpose Timer1" name="" value="0x5"/>
        <value caption="INT0" name="" value="0x4"/>
        <value caption="Scan trigger (see Note)" name="" value="0x3"/>
        <value caption="Software level trigger" name="" value="0x2"/>
        <value caption="Software edge trigger" name="" value="0x1"/>
        <value caption="No Trigger" name="" value="0x0"/>
      </value-group>
      <value-group caption="ADCx Identifier bits" name="ADCFSTAT__ADCID">
        <value caption="Reserved" name="" value="0x7"/>
        <value caption="Reserved" name="" value="0x6"/>
        <value caption="Reserved" name="" value="0x5"/>
        <value caption="Converted data of ADC4 is stored in FIFO" name="" value="0x4"/>
        <value caption="Converted data of ADC0 is stored in FIFO" name="" value="0x0"/>
      </value-group>
      <value-group caption="FIFO Write Overflow Error Status bit" name="ADCFSTAT__FWROVERR">
        <value caption="A write overflow error in the FIFO has occurred (circular FIFO)" name="" value="0x1"/>
        <value caption="A write overflow error in the FIFO has not occurred" name="" value="0x0"/>
      </value-group>
      <value-group caption="FIFO Data Ready Interrupt Status bit" name="ADCFSTAT__FRDY">
        <value caption="FIFO has data to be read" name="" value="0x1"/>
        <value caption="No data is available in the FIFO" name="" value="0x0"/>
      </value-group>
      <value-group caption="FIFO Interrupt Enable bit" name="ADCFSTAT__FIEN">
        <value caption="FIFO interrupts are enabled; an interrupt is generated once the FRDY bit is set" name="" value="0x1"/>
        <value caption="FIFO interrupts are disabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="ADC0 Enable bit" name="ADCFSTAT__ADC0EN">
        <value caption="Converted output data of ADC is stored in the FIFO" name="" value="0x1"/>
        <value caption="Converted output data of ADC is not stored in the FIFO" name="" value="0x0"/>
      </value-group>
      <value-group caption="FIFO Enable bit" name="ADCFSTAT__FEN">
        <value caption="FIFO is enabled" name="" value="0x1"/>
        <value caption="FIFO is disabled; no data is being saved into the FIFO" name="" value="0x0"/>
      </value-group>
      <value-group caption="Trigger Level and Edge Sensitivity bit 0" name="ADCTRGSNS__LVL0">
        <value caption="Analog input is sensitive to the high level of its trigger (level sensitivity implies retriggering as long as the trigger signal remains high)" name="" value="0x1"/>
        <value caption="Analog input is sensitive to the positive edge of its trigger (this is the value after a reset)" name="" value="0x0"/>
      </value-group>
      <value-group caption="Trigger Level and Edge Sensitivity bit 1" name="ADCTRGSNS__LVL1">
        <value caption="Analog input is sensitive to the high level of its trigger (level sensitivity implies retriggering as long as the trigger signal remains high)" name="" value="0x1"/>
        <value caption="Analog input is sensitive to the positive edge of its trigger (this is the value after a reset)" name="" value="0x0"/>
      </value-group>
      <value-group caption="Trigger Level and Edge Sensitivity bit 2" name="ADCTRGSNS__LVL2">
        <value caption="Analog input is sensitive to the high level of its trigger (level sensitivity implies retriggering as long as the trigger signal remains high)" name="" value="0x1"/>
        <value caption="Analog input is sensitive to the positive edge of its trigger (this is the value after a reset)" name="" value="0x0"/>
      </value-group>
      <value-group caption="Trigger Level and Edge Sensitivity bit 3" name="ADCTRGSNS__LVL3">
        <value caption="Analog input is sensitive to the high level of its trigger (level sensitivity implies retriggering as long as the trigger signal remains high)" name="" value="0x1"/>
        <value caption="Analog input is sensitive to the positive edge of its trigger (this is the value after a reset)" name="" value="0x0"/>
      </value-group>
      <value-group caption="Trigger Level and Edge Sensitivity bit 4" name="ADCTRGSNS__LVL4">
        <value caption="Analog input is sensitive to the high level of its trigger (level sensitivity implies retriggering as long as the trigger signal remains high)" name="" value="0x1"/>
        <value caption="Analog input is sensitive to the positive edge of its trigger (this is the value after a reset)" name="" value="0x0"/>
      </value-group>
      <value-group caption="Trigger Level and Edge Sensitivity bit 5" name="ADCTRGSNS__LVL5">
        <value caption="Analog input is sensitive to the high level of its trigger (level sensitivity implies retriggering as long as the trigger signal remains high)" name="" value="0x1"/>
        <value caption="Analog input is sensitive to the positive edge of its trigger (this is the value after a reset)" name="" value="0x0"/>
      </value-group>
      <value-group caption="Trigger Level and Edge Sensitivity bit 6" name="ADCTRGSNS__LVL6">
        <value caption="Analog input is sensitive to the high level of its trigger (level sensitivity implies retriggering as long as the trigger signal remains high)" name="" value="0x1"/>
        <value caption="Analog input is sensitive to the positive edge of its trigger (this is the value after a reset)" name="" value="0x0"/>
      </value-group>
      <value-group caption="Trigger Level and Edge Sensitivity bit 7" name="ADCTRGSNS__LVL7">
        <value caption="Analog input is sensitive to the high level of its trigger (level sensitivity implies retriggering as long as the trigger signal remains high)" name="" value="0x1"/>
        <value caption="Analog input is sensitive to the positive edge of its trigger (this is the value after a reset)" name="" value="0x0"/>
      </value-group>
      <value-group caption="ADCx Sample Time bits" name="ADC0TIME__SAMC">
        <value caption="1025 Tadx" name="" value="0x3ff"/>
        <value caption="3 Tadx" name="" value="0x1"/>
        <value caption="2 Tadx" name="" value="0x0"/>
      </value-group>
      <value-group caption="ADCx Clock Divisor bits" name="ADC0TIME__ADCDIV">
        <value caption="254 * Tq = Tadx" name="" value="0x7f"/>
        <value caption="6 * Tq = Tadx" name="" value="0x3"/>
        <value caption="4 * Tq = Tadx" name="" value="0x2"/>
        <value caption="2 * Tq = Tadx" name="" value="0x1"/>
        <value caption="Reserved" name="" value="0x0"/>
      </value-group>
      <value-group caption="ADCx Resolution Select bits" name="ADC0TIME__SELRES">
        <value caption="12 bits" name="" value="0x3"/>
        <value caption="10 bits" name="" value="0x2"/>
        <value caption="8 bits" name="" value="0x1"/>
        <value caption="6 bits" name="" value="0x0"/>
      </value-group>
