Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-W_DFP/1.8.326/atdf/PIC32MZ2051W104132.atdf
        <register caption="CAN FIFO Interrupt Register " name="C1FIFOINT0" offset="0x360" rw="RW" size="4">
          <bitfield caption="Receive Buffer Not Empty Interrupt Flag bit" mask="0x00000001" name="RXNEMPTYIF" values="C1FIFOINT0__RXNEMPTYIF"/>
          <bitfield caption="Receive FIFO Half Full Interrupt Flag bit" mask="0x00000002" name="RXHALFIF" values="C1FIFOINT0__RXHALFIF"/>
          <bitfield caption="Receive FIFO Full Interrupt Flag bit" mask="0x00000004" name="RXFULLIF" values="C1FIFOINT0__RXFULLIF"/>
          <bitfield caption="Receive FIFO Overflow Interrupt Flag bit" mask="0x00000008" name="RXOVFLIF" values="C1FIFOINT0__RXOVFLIF"/>
          <bitfield caption="Transmit FIFO Empty Interrupt Flag bit" mask="0x00000100" name="TXEMPTYIF" values="C1FIFOINT0__TXEMPTYIF"/>
          <bitfield caption="FIFO Transmit FIFO Half Empty Interrupt Flag bit" mask="0x00000200" name="TXHALFIF" values="C1FIFOINT0__TXHALFIF"/>
          <bitfield caption="Transmit FIFO Not Full Interrupt Flag bit" mask="0x00000400" name="TXNFULLIF" values="C1FIFOINT0__TXNFULLIF"/>
          <bitfield caption="Empty Interrupt Enable bit" mask="0x00010000" name="RXNEMPTYIE" values="C1FIFOINT0__RXNEMPTYIE"/>
          <bitfield caption="FIFO Half Full Interrupt Enable bit" mask="0x00020000" name="RXHALFIE" values="C1FIFOINT0__RXHALFIE"/>
          <bitfield caption="Full Interrupt Enable bit" mask="0x00040000" name="RXFULLIE" values="C1FIFOINT0__RXFULLIE"/>
          <bitfield caption="Overflow Interrupt Enable bit" mask="0x00080000" name="RXOVFLIE" values="C1FIFOINT0__RXOVFLIE"/>
          <bitfield caption="Transmit FIFO Empty Interrupt Enable bit" mask="0x01000000" name="TXEMPTYIE" values="C1FIFOINT0__TXEMPTYIE"/>
          <bitfield caption="Transmit FIFO Half Full Interrupt Enable bit" mask="0x02000000" name="TXHALFIE" values="C1FIFOINT0__TXHALFIE"/>
          <bitfield caption="Transmit FIFO Not Full Interrupt Enable bit" mask="0x04000000" name="TXNFULLIE" values="C1FIFOINT0__TXNFULLIE"/>
        </register>
        <register caption="CAN FIFO User Address Register " name="C1FIFOUA0" offset="0x370" rw="R" size="4">
          <bitfield mask="0xFFFFFFFC" name="FIFOUA"/>
        </register>
        <register caption="CAN Module Message Index Register " name="C1FIFOCI0" offset="0x380" rw="R" size="4">
          <bitfield mask="0x0000001F" name="CFIFOCI"/>
        </register>
        <register caption="CAN FIFO Control Register " name="C1FIFOCON1" offset="0x390" rw="RW" size="4">
          <bitfield caption="Message Transmit Priority bits" mask="0x00000003" name="TXPRI" values="C1FIFOCON1__TXPRI"/>
          <bitfield caption="Auto RTR Enable bit" mask="0x00000004" name="RTREN" values="C1FIFOCON1__RTREN"/>
          <bitfield caption="Message Send Request" mask="0x00000008" name="TXREQ" values="C1FIFOCON1__TXREQ"/>
          <bitfield caption="Error Detected During Transmission bit" mask="0x00000010" name="TXERR" values="C1FIFOCON1__TXERR"/>
          <bitfield caption="Message Lost Arbitration bit" mask="0x00000020" name="TXLARB" values="C1FIFOCON1__TXLARB"/>
          <bitfield caption="Message Aborted bit" mask="0x00000040" name="TXABAT" values="C1FIFOCON1__TXABAT"/>
          <bitfield caption="TX/RX Buffer Selection bit" mask="0x00000080" name="TXEN" values="C1FIFOCON1__TXEN"/>
          <bitfield caption="Store Message Data Only bit" mask="0x00001000" name="DONLY" values="C1FIFOCON1__DONLY"/>
          <bitfield caption="Increment Head/Tail bit" mask="0x00002000" name="UINC" values="C1FIFOCON1__UINC"/>
          <bitfield caption="FIFO Reset bits" mask="0x00004000" name="FRESET" values="C1FIFOCON1__FRESET"/>
          <bitfield caption="FIFO Size bits" mask="0x001F0000" name="FSIZE" values="C1FIFOCON1__FSIZE"/>
        </register>
        <register caption="CAN FIFO Interrupt Register " name="C1FIFOINT1" offset="0x3a0" rw="RW" size="4">
          <bitfield caption="Receive Buffer Not Empty Interrupt Flag bit" mask="0x00000001" name="RXNEMPTYIF" values="C1FIFOINT1__RXNEMPTYIF"/>
          <bitfield caption="Receive FIFO Half Full Interrupt Flag bit" mask="0x00000002" name="RXHALFIF" values="C1FIFOINT1__RXHALFIF"/>
          <bitfield caption="Receive FIFO Full Interrupt Flag bit" mask="0x00000004" name="RXFULLIF" values="C1FIFOINT1__RXFULLIF"/>
          <bitfield caption="Receive FIFO Overflow Interrupt Flag bit" mask="0x00000008" name="RXOVFLIF" values="C1FIFOINT1__RXOVFLIF"/>
          <bitfield caption="Transmit FIFO Empty Interrupt Flag bit" mask="0x00000100" name="TXEMPTYIF" values="C1FIFOINT1__TXEMPTYIF"/>
          <bitfield caption="FIFO Transmit FIFO Half Empty Interrupt Flag bit" mask="0x00000200" name="TXHALFIF" values="C1FIFOINT1__TXHALFIF"/>
          <bitfield caption="Transmit FIFO Not Full Interrupt Flag bit" mask="0x00000400" name="TXNFULLIF" values="C1FIFOINT1__TXNFULLIF"/>
          <bitfield caption="Empty Interrupt Enable bit" mask="0x00010000" name="RXNEMPTYIE" values="C1FIFOINT1__RXNEMPTYIE"/>
          <bitfield caption="FIFO Half Full Interrupt Enable bit" mask="0x00020000" name="RXHALFIE" values="C1FIFOINT1__RXHALFIE"/>
          <bitfield caption="Full Interrupt Enable bit" mask="0x00040000" name="RXFULLIE" values="C1FIFOINT1__RXFULLIE"/>
          <bitfield caption="Overflow Interrupt Enable bit" mask="0x00080000" name="RXOVFLIE" values="C1FIFOINT1__RXOVFLIE"/>
          <bitfield caption="Transmit FIFO Empty Interrupt Enable bit" mask="0x01000000" name="TXEMPTYIE" values="C1FIFOINT1__TXEMPTYIE"/>
          <bitfield caption="Transmit FIFO Half Full Interrupt Enable bit" mask="0x02000000" name="TXHALFIE" values="C1FIFOINT1__TXHALFIE"/>
          <bitfield caption="Transmit FIFO Not Full Interrupt Enable bit" mask="0x04000000" name="TXNFULLIE" values="C1FIFOINT1__TXNFULLIE"/>
        </register>
        <register caption="CAN FIFO User Address Register " name="C1FIFOUA1" offset="0x3b0" rw="R" size="4">
          <bitfield mask="0xFFFFFFFC" name="FIFOUA"/>
        </register>
