Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-W_DFP/1.8.326/atdf/PIC32MZ2051W104132.atdf
        <register caption="CAN FIFO Interrupt Register " name="C1FIFOINT9" offset="0x5a0" rw="RW" size="4">
          <bitfield caption="Receive Buffer Not Empty Interrupt Flag bit" mask="0x00000001" name="RXNEMPTYIF" values="C1FIFOINT9__RXNEMPTYIF"/>
          <bitfield caption="Receive FIFO Half Full Interrupt Flag bit" mask="0x00000002" name="RXHALFIF" values="C1FIFOINT9__RXHALFIF"/>
          <bitfield caption="Receive FIFO Full Interrupt Flag bit" mask="0x00000004" name="RXFULLIF" values="C1FIFOINT9__RXFULLIF"/>
          <bitfield caption="Receive FIFO Overflow Interrupt Flag bit" mask="0x00000008" name="RXOVFLIF" values="C1FIFOINT9__RXOVFLIF"/>
          <bitfield caption="Transmit FIFO Empty Interrupt Flag bit" mask="0x00000100" name="TXEMPTYIF" values="C1FIFOINT9__TXEMPTYIF"/>
          <bitfield caption="FIFO Transmit FIFO Half Empty Interrupt Flag bit" mask="0x00000200" name="TXHALFIF" values="C1FIFOINT9__TXHALFIF"/>
          <bitfield caption="Transmit FIFO Not Full Interrupt Flag bit" mask="0x00000400" name="TXNFULLIF" values="C1FIFOINT9__TXNFULLIF"/>
          <bitfield caption="Empty Interrupt Enable bit" mask="0x00010000" name="RXNEMPTYIE" values="C1FIFOINT9__RXNEMPTYIE"/>
          <bitfield caption="FIFO Half Full Interrupt Enable bit" mask="0x00020000" name="RXHALFIE" values="C1FIFOINT9__RXHALFIE"/>
          <bitfield caption="Full Interrupt Enable bit" mask="0x00040000" name="RXFULLIE" values="C1FIFOINT9__RXFULLIE"/>
          <bitfield caption="Overflow Interrupt Enable bit" mask="0x00080000" name="RXOVFLIE" values="C1FIFOINT9__RXOVFLIE"/>
          <bitfield caption="Transmit FIFO Empty Interrupt Enable bit" mask="0x01000000" name="TXEMPTYIE" values="C1FIFOINT9__TXEMPTYIE"/>
          <bitfield caption="Transmit FIFO Half Full Interrupt Enable bit" mask="0x02000000" name="TXHALFIE" values="C1FIFOINT9__TXHALFIE"/>
          <bitfield caption="Transmit FIFO Not Full Interrupt Enable bit" mask="0x04000000" name="TXNFULLIE" values="C1FIFOINT9__TXNFULLIE"/>
        </register>
        <register caption="CAN FIFO User Address Register " name="C1FIFOUA9" offset="0x5b0" rw="R" size="4">
          <bitfield mask="0xFFFFFFFC" name="FIFOUA"/>
        </register>
        <register caption="CAN Module Message Index Register " name="C1FIFOCI9" offset="0x5c0" rw="R" size="4">
          <bitfield mask="0x0000001F" name="CFIFOCI"/>
        </register>
        <register caption="CAN FIFO Control Register " name="C1FIFOCON10" offset="0x5d0" rw="RW" size="4">
          <bitfield caption="Message Transmit Priority bits" mask="0x00000003" name="TXPRI" values="C1FIFOCON10__TXPRI"/>
          <bitfield caption="Auto RTR Enable bit" mask="0x00000004" name="RTREN" values="C1FIFOCON10__RTREN"/>
          <bitfield caption="Message Send Request" mask="0x00000008" name="TXREQ" values="C1FIFOCON10__TXREQ"/>
          <bitfield caption="Error Detected During Transmission bit" mask="0x00000010" name="TXERR" values="C1FIFOCON10__TXERR"/>
          <bitfield caption="Message Lost Arbitration bit" mask="0x00000020" name="TXLARB" values="C1FIFOCON10__TXLARB"/>
          <bitfield caption="Message Aborted bit" mask="0x00000040" name="TXABAT" values="C1FIFOCON10__TXABAT"/>
          <bitfield caption="TX/RX Buffer Selection bit" mask="0x00000080" name="TXEN" values="C1FIFOCON10__TXEN"/>
          <bitfield caption="Store Message Data Only bit" mask="0x00001000" name="DONLY" values="C1FIFOCON10__DONLY"/>
          <bitfield caption="Increment Head/Tail bit" mask="0x00002000" name="UINC" values="C1FIFOCON10__UINC"/>
          <bitfield caption="FIFO Reset bits" mask="0x00004000" name="FRESET" values="C1FIFOCON10__FRESET"/>
          <bitfield caption="FIFO Size bits" mask="0x001F0000" name="FSIZE" values="C1FIFOCON10__FSIZE"/>
        </register>
        <register caption="CAN FIFO Interrupt Register " name="C1FIFOINT10" offset="0x5e0" rw="RW" size="4">
          <bitfield caption="Receive Buffer Not Empty Interrupt Flag bit" mask="0x00000001" name="RXNEMPTYIF" values="C1FIFOINT10__RXNEMPTYIF"/>
          <bitfield caption="Receive FIFO Half Full Interrupt Flag bit" mask="0x00000002" name="RXHALFIF" values="C1FIFOINT10__RXHALFIF"/>
          <bitfield caption="Receive FIFO Full Interrupt Flag bit" mask="0x00000004" name="RXFULLIF" values="C1FIFOINT10__RXFULLIF"/>
          <bitfield caption="Receive FIFO Overflow Interrupt Flag bit" mask="0x00000008" name="RXOVFLIF" values="C1FIFOINT10__RXOVFLIF"/>
          <bitfield caption="Transmit FIFO Empty Interrupt Flag bit" mask="0x00000100" name="TXEMPTYIF" values="C1FIFOINT10__TXEMPTYIF"/>
          <bitfield caption="FIFO Transmit FIFO Half Empty Interrupt Flag bit" mask="0x00000200" name="TXHALFIF" values="C1FIFOINT10__TXHALFIF"/>
          <bitfield caption="Transmit FIFO Not Full Interrupt Flag bit" mask="0x00000400" name="TXNFULLIF" values="C1FIFOINT10__TXNFULLIF"/>
          <bitfield caption="Empty Interrupt Enable bit" mask="0x00010000" name="RXNEMPTYIE" values="C1FIFOINT10__RXNEMPTYIE"/>
          <bitfield caption="FIFO Half Full Interrupt Enable bit" mask="0x00020000" name="RXHALFIE" values="C1FIFOINT10__RXHALFIE"/>
          <bitfield caption="Full Interrupt Enable bit" mask="0x00040000" name="RXFULLIE" values="C1FIFOINT10__RXFULLIE"/>
          <bitfield caption="Overflow Interrupt Enable bit" mask="0x00080000" name="RXOVFLIE" values="C1FIFOINT10__RXOVFLIE"/>
          <bitfield caption="Transmit FIFO Empty Interrupt Enable bit" mask="0x01000000" name="TXEMPTYIE" values="C1FIFOINT10__TXEMPTYIE"/>
          <bitfield caption="Transmit FIFO Half Full Interrupt Enable bit" mask="0x02000000" name="TXHALFIE" values="C1FIFOINT10__TXHALFIE"/>
          <bitfield caption="Transmit FIFO Not Full Interrupt Enable bit" mask="0x04000000" name="TXNFULLIE" values="C1FIFOINT10__TXNFULLIE"/>
        </register>
        <register caption="CAN FIFO User Address Register " name="C1FIFOUA10" offset="0x5f0" rw="R" size="4">
          <bitfield mask="0xFFFFFFFC" name="FIFOUA"/>
        </register>
        <register caption="CAN Module Message Index Register " name="C1FIFOCI10" offset="0x600" rw="R" size="4">
          <bitfield mask="0x0000001F" name="CFIFOCI"/>
        </register>
        <register caption="CAN FIFO Control Register " name="C1FIFOCON11" offset="0x610" rw="RW" size="4">
          <bitfield caption="Message Transmit Priority bits" mask="0x00000003" name="TXPRI" values="C1FIFOCON11__TXPRI"/>
          <bitfield caption="Auto RTR Enable bit" mask="0x00000004" name="RTREN" values="C1FIFOCON11__RTREN"/>
          <bitfield caption="Message Send Request" mask="0x00000008" name="TXREQ" values="C1FIFOCON11__TXREQ"/>
          <bitfield caption="Error Detected During Transmission bit" mask="0x00000010" name="TXERR" values="C1FIFOCON11__TXERR"/>
          <bitfield caption="Message Lost Arbitration bit" mask="0x00000020" name="TXLARB" values="C1FIFOCON11__TXLARB"/>
          <bitfield caption="Message Aborted bit" mask="0x00000040" name="TXABAT" values="C1FIFOCON11__TXABAT"/>
          <bitfield caption="TX/RX Buffer Selection bit" mask="0x00000080" name="TXEN" values="C1FIFOCON11__TXEN"/>
          <bitfield caption="Store Message Data Only bit" mask="0x00001000" name="DONLY" values="C1FIFOCON11__DONLY"/>
          <bitfield caption="Increment Head/Tail bit" mask="0x00002000" name="UINC" values="C1FIFOCON11__UINC"/>
          <bitfield caption="FIFO Reset bits" mask="0x00004000" name="FRESET" values="C1FIFOCON11__FRESET"/>
          <bitfield caption="FIFO Size bits" mask="0x001F0000" name="FSIZE" values="C1FIFOCON11__FSIZE"/>
        </register>
