Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-W_DFP/1.8.326/atdf/PIC32MZ2051W104132.atdf
      <value-group caption="Filter 6 Enable bit" name="C1FLTCON1__FLTEN6">
        <value caption="Filter is enabled" name="" value="0x1"/>
        <value caption="Filter is disabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="FIFO Selection bits" name="C1FLTCON1__FSEL7">
        <value caption="Message matching filter is stored in FIFO buffer 15" name="" value="0xf"/>
        <value caption="Message matching filter is stored in FIFO buffer 14" name="" value="0xe"/>
        <value caption="Message matching filter is stored in FIFO buffer 13" name="" value="0xd"/>
        <value caption="Message matching filter is stored in FIFO buffer 12" name="" value="0xc"/>
        <value caption="Message matching filter is stored in FIFO buffer 11" name="" value="0xb"/>
        <value caption="Message matching filter is stored in FIFO buffer 10" name="" value="0xa"/>
        <value caption="Message matching filter is stored in FIFO buffer 9" name="" value="0x9"/>
        <value caption="Message matching filter is stored in FIFO buffer 8" name="" value="0x8"/>
        <value caption="Message matching filter is stored in FIFO buffer 7" name="" value="0x7"/>
        <value caption="Message matching filter is stored in FIFO buffer 6" name="" value="0x6"/>
        <value caption="Message matching filter is stored in FIFO buffer 5" name="" value="0x5"/>
        <value caption="Message matching filter is stored in FIFO buffer 4" name="" value="0x4"/>
        <value caption="Message matching filter is stored in FIFO buffer 3" name="" value="0x3"/>
        <value caption="Message matching filter is stored in FIFO buffer 2" name="" value="0x2"/>
        <value caption="Message matching filter is stored in FIFO buffer 1" name="" value="0x1"/>
        <value caption="Message matching filter is stored in FIFO buffer 0" name="" value="0x0"/>
      </value-group>
      <value-group caption="Filter 7 Mask Select bits" name="C1FLTCON1__MSEL7">
        <value caption="Acceptance Mask 3 selected" name="" value="0x3"/>
        <value caption="Acceptance Mask 2 selected" name="" value="0x2"/>
        <value caption="Acceptance Mask 1 selected" name="" value="0x1"/>
        <value caption="Acceptance Mask 0 selected" name="" value="0x0"/>
      </value-group>
      <value-group caption="Filter 7 Enable bit" name="C1FLTCON1__FLTEN7">
        <value caption="Filter is enabled" name="" value="0x1"/>
        <value caption="Filter is disabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="FIFO Selection bits" name="C1FLTCON2__FSEL8">
        <value caption="Message matching filter is stored in FIFO buffer 15" name="" value="0xf"/>
        <value caption="Message matching filter is stored in FIFO buffer 14" name="" value="0xe"/>
        <value caption="Message matching filter is stored in FIFO buffer 13" name="" value="0xd"/>
        <value caption="Message matching filter is stored in FIFO buffer 12" name="" value="0xc"/>
        <value caption="Message matching filter is stored in FIFO buffer 11" name="" value="0xb"/>
        <value caption="Message matching filter is stored in FIFO buffer 10" name="" value="0xa"/>
        <value caption="Message matching filter is stored in FIFO buffer 9" name="" value="0x9"/>
        <value caption="Message matching filter is stored in FIFO buffer 8" name="" value="0x8"/>
        <value caption="Message matching filter is stored in FIFO buffer 7" name="" value="0x7"/>
        <value caption="Message matching filter is stored in FIFO buffer 6" name="" value="0x6"/>
        <value caption="Message matching filter is stored in FIFO buffer 5" name="" value="0x5"/>
        <value caption="Message matching filter is stored in FIFO buffer 4" name="" value="0x4"/>
        <value caption="Message matching filter is stored in FIFO buffer 3" name="" value="0x3"/>
        <value caption="Message matching filter is stored in FIFO buffer 2" name="" value="0x2"/>
        <value caption="Message matching filter is stored in FIFO buffer 1" name="" value="0x1"/>
        <value caption="Message matching filter is stored in FIFO buffer 0" name="" value="0x0"/>
      </value-group>
      <value-group caption="Filter 8 Mask Select bits" name="C1FLTCON2__MSEL8">
        <value caption="Acceptance Mask 3 selected" name="" value="0x3"/>
        <value caption="Acceptance Mask 2 selected" name="" value="0x2"/>
        <value caption="Acceptance Mask 1 selected" name="" value="0x1"/>
        <value caption="Acceptance Mask 0 selected" name="" value="0x0"/>
      </value-group>
      <value-group caption="Filter 8 Enable bit" name="C1FLTCON2__FLTEN8">
        <value caption="Filter is enabled" name="" value="0x1"/>
        <value caption="Filter is disabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="FIFO Selection bits" name="C1FLTCON2__FSEL9">
        <value caption="Message matching filter is stored in FIFO buffer 15" name="" value="0xf"/>
        <value caption="Message matching filter is stored in FIFO buffer 14" name="" value="0xe"/>
        <value caption="Message matching filter is stored in FIFO buffer 13" name="" value="0xd"/>
        <value caption="Message matching filter is stored in FIFO buffer 12" name="" value="0xc"/>
        <value caption="Message matching filter is stored in FIFO buffer 11" name="" value="0xb"/>
        <value caption="Message matching filter is stored in FIFO buffer 10" name="" value="0xa"/>
        <value caption="Message matching filter is stored in FIFO buffer 9" name="" value="0x9"/>
        <value caption="Message matching filter is stored in FIFO buffer 8" name="" value="0x8"/>
        <value caption="Message matching filter is stored in FIFO buffer 7" name="" value="0x7"/>
        <value caption="Message matching filter is stored in FIFO buffer 6" name="" value="0x6"/>
        <value caption="Message matching filter is stored in FIFO buffer 5" name="" value="0x5"/>
        <value caption="Message matching filter is stored in FIFO buffer 4" name="" value="0x4"/>
        <value caption="Message matching filter is stored in FIFO buffer 3" name="" value="0x3"/>
        <value caption="Message matching filter is stored in FIFO buffer 2" name="" value="0x2"/>
        <value caption="Message matching filter is stored in FIFO buffer 1" name="" value="0x1"/>
        <value caption="Message matching filter is stored in FIFO buffer 0" name="" value="0x0"/>
      </value-group>
      <value-group caption="Filter 9 Mask Select bits" name="C1FLTCON2__MSEL9">
        <value caption="Acceptance Mask 3 selected" name="" value="0x3"/>
        <value caption="Acceptance Mask 2 selected" name="" value="0x2"/>
        <value caption="Acceptance Mask 1 selected" name="" value="0x1"/>
        <value caption="Acceptance Mask 0 selected" name="" value="0x0"/>
      </value-group>
      <value-group caption="Filter 9 Enable bit" name="C1FLTCON2__FLTEN9">
        <value caption="Filter is enabled" name="" value="0x1"/>
        <value caption="Filter is disabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="FIFO Selection bits" name="C1FLTCON2__FSEL10">
        <value caption="Message matching filter is stored in FIFO buffer 15" name="" value="0xf"/>
        <value caption="Message matching filter is stored in FIFO buffer 14" name="" value="0xe"/>
        <value caption="Message matching filter is stored in FIFO buffer 13" name="" value="0xd"/>
        <value caption="Message matching filter is stored in FIFO buffer 12" name="" value="0xc"/>
        <value caption="Message matching filter is stored in FIFO buffer 11" name="" value="0xb"/>
        <value caption="Message matching filter is stored in FIFO buffer 10" name="" value="0xa"/>
        <value caption="Message matching filter is stored in FIFO buffer 9" name="" value="0x9"/>
        <value caption="Message matching filter is stored in FIFO buffer 8" name="" value="0x8"/>
        <value caption="Message matching filter is stored in FIFO buffer 7" name="" value="0x7"/>
        <value caption="Message matching filter is stored in FIFO buffer 6" name="" value="0x6"/>
        <value caption="Message matching filter is stored in FIFO buffer 5" name="" value="0x5"/>
        <value caption="Message matching filter is stored in FIFO buffer 4" name="" value="0x4"/>
        <value caption="Message matching filter is stored in FIFO buffer 3" name="" value="0x3"/>
        <value caption="Message matching filter is stored in FIFO buffer 2" name="" value="0x2"/>
        <value caption="Message matching filter is stored in FIFO buffer 1" name="" value="0x1"/>
        <value caption="Message matching filter is stored in FIFO buffer 0" name="" value="0x0"/>
      </value-group>
      <value-group caption="Filter 10 Mask Select bits" name="C1FLTCON2__MSEL10">
        <value caption="Acceptance Mask 3 selected" name="" value="0x3"/>
        <value caption="Acceptance Mask 2 selected" name="" value="0x2"/>
        <value caption="Acceptance Mask 1 selected" name="" value="0x1"/>
        <value caption="Acceptance Mask 0 selected" name="" value="0x0"/>
      </value-group>
      <value-group caption="Filter 10 Enable bit" name="C1FLTCON2__FLTEN10">
        <value caption="Filter is enabled" name="" value="0x1"/>
        <value caption="Filter is disabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="FIFO Selection bits" name="C1FLTCON2__FSEL11">
        <value caption="Message matching filter is stored in FIFO buffer 15" name="" value="0xf"/>
        <value caption="Message matching filter is stored in FIFO buffer 14" name="" value="0xe"/>
        <value caption="Message matching filter is stored in FIFO buffer 13" name="" value="0xd"/>
        <value caption="Message matching filter is stored in FIFO buffer 12" name="" value="0xc"/>
        <value caption="Message matching filter is stored in FIFO buffer 11" name="" value="0xb"/>
        <value caption="Message matching filter is stored in FIFO buffer 10" name="" value="0xa"/>
        <value caption="Message matching filter is stored in FIFO buffer 9" name="" value="0x9"/>
        <value caption="Message matching filter is stored in FIFO buffer 8" name="" value="0x8"/>
        <value caption="Message matching filter is stored in FIFO buffer 7" name="" value="0x7"/>
        <value caption="Message matching filter is stored in FIFO buffer 6" name="" value="0x6"/>
        <value caption="Message matching filter is stored in FIFO buffer 5" name="" value="0x5"/>
        <value caption="Message matching filter is stored in FIFO buffer 4" name="" value="0x4"/>
        <value caption="Message matching filter is stored in FIFO buffer 3" name="" value="0x3"/>
        <value caption="Message matching filter is stored in FIFO buffer 2" name="" value="0x2"/>
        <value caption="Message matching filter is stored in FIFO buffer 1" name="" value="0x1"/>
        <value caption="Message matching filter is stored in FIFO buffer 0" name="" value="0x0"/>
      </value-group>
