Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-W_DFP/1.8.326/atdf/PIC32MZ2051W104132.atdf
      <value-group caption="Filter 14 Mask Select bits" name="C1FLTCON3__MSEL14">
        <value caption="Acceptance Mask 3 selected" name="" value="0x3"/>
        <value caption="Acceptance Mask 2 selected" name="" value="0x2"/>
        <value caption="Acceptance Mask 1 selected" name="" value="0x1"/>
        <value caption="Acceptance Mask 0 selected" name="" value="0x0"/>
      </value-group>
      <value-group caption="Filter 14 Enable bit" name="C1FLTCON3__FLTEN14">
        <value caption="Filter is enabled" name="" value="0x1"/>
        <value caption="Filter is disabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="FIFO Selection bits" name="C1FLTCON3__FSEL15">
        <value caption="Message matching filter is stored in FIFO buffer 15" name="" value="0xf"/>
        <value caption="Message matching filter is stored in FIFO buffer 14" name="" value="0xe"/>
        <value caption="Message matching filter is stored in FIFO buffer 13" name="" value="0xd"/>
        <value caption="Message matching filter is stored in FIFO buffer 12" name="" value="0xc"/>
        <value caption="Message matching filter is stored in FIFO buffer 11" name="" value="0xb"/>
        <value caption="Message matching filter is stored in FIFO buffer 10" name="" value="0xa"/>
        <value caption="Message matching filter is stored in FIFO buffer 9" name="" value="0x9"/>
        <value caption="Message matching filter is stored in FIFO buffer 8" name="" value="0x8"/>
        <value caption="Message matching filter is stored in FIFO buffer 7" name="" value="0x7"/>
        <value caption="Message matching filter is stored in FIFO buffer 6" name="" value="0x6"/>
        <value caption="Message matching filter is stored in FIFO buffer 5" name="" value="0x5"/>
        <value caption="Message matching filter is stored in FIFO buffer 4" name="" value="0x4"/>
        <value caption="Message matching filter is stored in FIFO buffer 3" name="" value="0x3"/>
        <value caption="Message matching filter is stored in FIFO buffer 2" name="" value="0x2"/>
        <value caption="Message matching filter is stored in FIFO buffer 1" name="" value="0x1"/>
        <value caption="Message matching filter is stored in FIFO buffer 0" name="" value="0x0"/>
      </value-group>
      <value-group caption="Filter 15 Mask Select bits" name="C1FLTCON3__MSEL15">
        <value caption="Acceptance Mask 3 selected" name="" value="0x3"/>
        <value caption="Acceptance Mask 2 selected" name="" value="0x2"/>
        <value caption="Acceptance Mask 1 selected" name="" value="0x1"/>
        <value caption="Acceptance Mask 0 selected" name="" value="0x0"/>
      </value-group>
      <value-group caption="Filter 15 Enable bit" name="C1FLTCON3__FLTEN15">
        <value caption="Filter is enabled" name="" value="0x1"/>
        <value caption="Filter is disabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="Extended Identifier bits" name="C1RXF0__EID">
        <value caption="Message address bit EIDx must be 1 to match filter" name="" value="0x1"/>
        <value caption="Message address bit EIDx must be 0 to match filter" name="" value="0x0"/>
      </value-group>
      <value-group caption="Extended Identifier Enable bits" name="C1RXF0__EXID">
        <value caption="Match only messages with extended identifier addresses" name="" value="0x1"/>
        <value caption="Match only messages with standard identifier addresses" name="" value="0x0"/>
      </value-group>
      <value-group caption="Standard Identifier bits" name="C1RXF0__SID">
        <value caption="Message address bit SIDx must be 1 to match filter" name="" value="0x1"/>
        <value caption="Message address bit SIDx must be 0 to match filter" name="" value="0x0"/>
      </value-group>
      <value-group caption="Extended Identifier bits" name="C1RXF1__EID">
        <value caption="Message address bit EIDx must be 1 to match filter" name="" value="0x1"/>
        <value caption="Message address bit EIDx must be 0 to match filter" name="" value="0x0"/>
      </value-group>
      <value-group caption="Extended Identifier Enable bits" name="C1RXF1__EXID">
        <value caption="Match only messages with extended identifier addresses" name="" value="0x1"/>
        <value caption="Match only messages with standard identifier addresses" name="" value="0x0"/>
      </value-group>
      <value-group caption="Standard Identifier bits" name="C1RXF1__SID">
        <value caption="Message address bit SIDx must be 1 to match filter" name="" value="0x1"/>
        <value caption="Message address bit SIDx must be 0 to match filter" name="" value="0x0"/>
      </value-group>
      <value-group caption="Extended Identifier bits" name="C1RXF2__EID">
        <value caption="Message address bit EIDx must be 1 to match filter" name="" value="0x1"/>
        <value caption="Message address bit EIDx must be 0 to match filter" name="" value="0x0"/>
      </value-group>
      <value-group caption="Extended Identifier Enable bits" name="C1RXF2__EXID">
        <value caption="Match only messages with extended identifier addresses" name="" value="0x1"/>
        <value caption="Match only messages with standard identifier addresses" name="" value="0x0"/>
      </value-group>
      <value-group caption="Standard Identifier bits" name="C1RXF2__SID">
        <value caption="Message address bit SIDx must be 1 to match filter" name="" value="0x1"/>
        <value caption="Message address bit SIDx must be 0 to match filter" name="" value="0x0"/>
      </value-group>
      <value-group caption="Extended Identifier bits" name="C1RXF3__EID">
        <value caption="Message address bit EIDx must be 1 to match filter" name="" value="0x1"/>
        <value caption="Message address bit EIDx must be 0 to match filter" name="" value="0x0"/>
      </value-group>
      <value-group caption="Extended Identifier Enable bits" name="C1RXF3__EXID">
        <value caption="Match only messages with extended identifier addresses" name="" value="0x1"/>
        <value caption="Match only messages with standard identifier addresses" name="" value="0x0"/>
      </value-group>
      <value-group caption="Standard Identifier bits" name="C1RXF3__SID">
        <value caption="Message address bit SIDx must be 1 to match filter" name="" value="0x1"/>
        <value caption="Message address bit SIDx must be 0 to match filter" name="" value="0x0"/>
      </value-group>
      <value-group caption="Extended Identifier bits" name="C1RXF4__EID">
        <value caption="Message address bit EIDx must be 1 to match filter" name="" value="0x1"/>
        <value caption="Message address bit EIDx must be 0 to match filter" name="" value="0x0"/>
      </value-group>
      <value-group caption="Extended Identifier Enable bits" name="C1RXF4__EXID">
        <value caption="Match only messages with extended identifier addresses" name="" value="0x1"/>
        <value caption="Match only messages with standard identifier addresses" name="" value="0x0"/>
      </value-group>
      <value-group caption="Standard Identifier bits" name="C1RXF4__SID">
        <value caption="Message address bit SIDx must be 1 to match filter" name="" value="0x1"/>
        <value caption="Message address bit SIDx must be 0 to match filter" name="" value="0x0"/>
      </value-group>
      <value-group caption="Extended Identifier bits" name="C1RXF5__EID">
        <value caption="Message address bit EIDx must be 1 to match filter" name="" value="0x1"/>
        <value caption="Message address bit EIDx must be 0 to match filter" name="" value="0x0"/>
      </value-group>
      <value-group caption="Extended Identifier Enable bits" name="C1RXF5__EXID">
        <value caption="Match only messages with extended identifier addresses" name="" value="0x1"/>
        <value caption="Match only messages with standard identifier addresses" name="" value="0x0"/>
      </value-group>
      <value-group caption="Standard Identifier bits" name="C1RXF5__SID">
        <value caption="Message address bit SIDx must be 1 to match filter" name="" value="0x1"/>
        <value caption="Message address bit SIDx must be 0 to match filter" name="" value="0x0"/>
      </value-group>
      <value-group caption="Extended Identifier bits" name="C1RXF6__EID">
        <value caption="Message address bit EIDx must be 1 to match filter" name="" value="0x1"/>
        <value caption="Message address bit EIDx must be 0 to match filter" name="" value="0x0"/>
      </value-group>
      <value-group caption="Extended Identifier Enable bits" name="C1RXF6__EXID">
        <value caption="Match only messages with extended identifier addresses" name="" value="0x1"/>
        <value caption="Match only messages with standard identifier addresses" name="" value="0x0"/>
      </value-group>
      <value-group caption="Standard Identifier bits" name="C1RXF6__SID">
        <value caption="Message address bit SIDx must be 1 to match filter" name="" value="0x1"/>
        <value caption="Message address bit SIDx must be 0 to match filter" name="" value="0x0"/>
      </value-group>
