Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-W_DFP/1.8.326/atdf/PIC32MZ2051W104132.atdf
        <register caption="FIFO Control Register" name="CFD2FIFOCON9" offset="0xbc" rw="RW" size="4">
          <bitfield caption="Transmit/Receive FIFO Not Full/Not Empty Interrupt Enable bit" mask="0x00000001" name="TFNRFNIE" values="CFD2FIFOCON9__TFNRFNIE"/>
          <bitfield caption="Transmit/Receive FIFO Half Empty/Half Full Interrupt Enable bit" mask="0x00000002" name="TFHRFHIE" values="CFD2FIFOCON9__TFHRFHIE"/>
          <bitfield caption="Transmit/Receive FIFO Empty/Full Interrupt Enable bit" mask="0x00000004" name="TFERFFIE" values="CFD2FIFOCON9__TFERFFIE"/>
          <bitfield caption="Overflow Interrupt Enable bit" mask="0x00000008" name="RXOVIE" values="CFD2FIFOCON9__RXOVIE"/>
          <bitfield caption="Transmit Attempts Exhausted Interrupt Enable bit" mask="0x00000010" name="TXATIE" values="CFD2FIFOCON9__TXATIE"/>
          <bitfield caption="Received Message Time Stamp Enable bit" mask="0x00000020" name="RXTSEN" values="CFD2FIFOCON9__RXTSEN"/>
          <bitfield caption="Auto RTR Enable bit" mask="0x00000040" name="RTREN" values="CFD2FIFOCON9__RTREN"/>
          <bitfield caption="TX / RX Buffer Selection bit" mask="0x00000080" name="TXEN" values="CFD2FIFOCON9__TXEN"/>
          <bitfield caption="Increment Head / Tail bit" mask="0x00000100" name="UINC" values="CFD2FIFOCON9__UINC"/>
          <bitfield caption="Message Send Request bit" mask="0x00000200" name="TXREQ" values="CFD2FIFOCON9__TXREQ"/>
          <bitfield caption="FIFO Reset bit" mask="0x00000400" name="FRESET" values="CFD2FIFOCON9__FRESET"/>
          <bitfield caption="Message Transmit Priority bits (EXPANDED)" mask="0x001F0000" name="TXPRI" values="CFD2FIFOCON9__TXPRI"/>
          <bitfield caption="Retransmission Attempts bits" mask="0x00600000" name="TXAT" values="CFD2FIFOCON9__TXAT"/>
          <bitfield caption="FIFO Size bits" mask="0x1F000000" name="FSIZE" values="CFD2FIFOCON9__FSIZE"/>
          <bitfield caption="Payload Size bits" mask="0xE0000000" name="PLSIZE" values="CFD2FIFOCON9__PLSIZE"/>
        </register>
        <register caption="" name="CFD2FIFOSTA9" offset="0xc0" rw="RW" size="4">
          <bitfield mask="0x00000001" name="TFNRFNIF"/>
          <bitfield mask="0x00000002" name="TFHRFHIF"/>
          <bitfield mask="0x00000004" name="TFERFFIF"/>
          <bitfield mask="0x00000008" name="RXOVIF"/>
          <bitfield mask="0x00000010" name="TXATIF"/>
          <bitfield mask="0x00000020" name="TXERR"/>
          <bitfield mask="0x00000040" name="TXLARB"/>
          <bitfield mask="0x00000080" name="TXABT"/>
          <bitfield mask="0x00001F00" name="FIFOCI"/>
        </register>
        <register caption="" name="CFD2FIFOUA9" offset="0xc4" rw="RW" size="4">
          <bitfield caption="FIFO User Address bits" mask="0xFFFFFFFF" name="FIFOUA"/>
        </register>
        <register caption="FIFO Control Register" name="CFD2FIFOCON10" offset="0xc8" rw="RW" size="4">
          <bitfield caption="Transmit/Receive FIFO Not Full/Not Empty Interrupt Enable bit" mask="0x00000001" name="TFNRFNIE" values="CFD2FIFOCON10__TFNRFNIE"/>
          <bitfield caption="Transmit/Receive FIFO Half Empty/Half Full Interrupt Enable bit" mask="0x00000002" name="TFHRFHIE" values="CFD2FIFOCON10__TFHRFHIE"/>
          <bitfield caption="Transmit/Receive FIFO Empty/Full Interrupt Enable bit" mask="0x00000004" name="TFERFFIE" values="CFD2FIFOCON10__TFERFFIE"/>
          <bitfield caption="Overflow Interrupt Enable bit" mask="0x00000008" name="RXOVIE" values="CFD2FIFOCON10__RXOVIE"/>
          <bitfield caption="Transmit Attempts Exhausted Interrupt Enable bit" mask="0x00000010" name="TXATIE" values="CFD2FIFOCON10__TXATIE"/>
          <bitfield caption="Received Message Time Stamp Enable bit" mask="0x00000020" name="RXTSEN" values="CFD2FIFOCON10__RXTSEN"/>
          <bitfield caption="Auto RTR Enable bit" mask="0x00000040" name="RTREN" values="CFD2FIFOCON10__RTREN"/>
          <bitfield caption="TX / RX Buffer Selection bit" mask="0x00000080" name="TXEN" values="CFD2FIFOCON10__TXEN"/>
          <bitfield caption="Increment Head / Tail bit" mask="0x00000100" name="UINC" values="CFD2FIFOCON10__UINC"/>
          <bitfield caption="Message Send Request bit" mask="0x00000200" name="TXREQ" values="CFD2FIFOCON10__TXREQ"/>
          <bitfield caption="FIFO Reset bit" mask="0x00000400" name="FRESET" values="CFD2FIFOCON10__FRESET"/>
          <bitfield caption="Message Transmit Priority bits (EXPANDED)" mask="0x001F0000" name="TXPRI" values="CFD2FIFOCON10__TXPRI"/>
          <bitfield caption="Retransmission Attempts bits" mask="0x00600000" name="TXAT" values="CFD2FIFOCON10__TXAT"/>
          <bitfield caption="FIFO Size bits" mask="0x1F000000" name="FSIZE" values="CFD2FIFOCON10__FSIZE"/>
          <bitfield caption="Payload Size bits" mask="0xE0000000" name="PLSIZE" values="CFD2FIFOCON10__PLSIZE"/>
        </register>
        <register caption="" name="CFD2FIFOSTA10" offset="0xcc" rw="RW" size="4">
          <bitfield mask="0x00000001" name="TFNRFNIF"/>
          <bitfield mask="0x00000002" name="TFHRFHIF"/>
          <bitfield mask="0x00000004" name="TFERFFIF"/>
          <bitfield mask="0x00000008" name="RXOVIF"/>
          <bitfield mask="0x00000010" name="TXATIF"/>
          <bitfield mask="0x00000020" name="TXERR"/>
          <bitfield mask="0x00000040" name="TXLARB"/>
          <bitfield mask="0x00000080" name="TXABT"/>
          <bitfield mask="0x00001F00" name="FIFOCI"/>
        </register>
        <register caption="" name="CFD2FIFOUA10" offset="0xd0" rw="RW" size="4">
          <bitfield caption="FIFO User Address bits" mask="0xFFFFFFFF" name="FIFOUA"/>
        </register>
        <register caption="FIFO Control Registe" name="CFD2FIFOCON11" offset="0xd4" rw="RW" size="4">
          <bitfield caption="Transmit/Receive FIFO Not Full/Not Empty Interrupt Enable bit" mask="0x00000001" name="TFNRFNIE" values="CFD2FIFOCON11__TFNRFNIE"/>
          <bitfield caption="Transmit/Receive FIFO Half Empty/Half Full Interrupt Enable bit" mask="0x00000002" name="TFHRFHIE" values="CFD2FIFOCON11__TFHRFHIE"/>
          <bitfield caption="Transmit/Receive FIFO Empty/Full Interrupt Enable bit" mask="0x00000004" name="TFERFFIE" values="CFD2FIFOCON11__TFERFFIE"/>
          <bitfield caption="Overflow Interrupt Enable bit" mask="0x00000008" name="RXOVIE" values="CFD2FIFOCON11__RXOVIE"/>
          <bitfield caption="Transmit Attempts Exhausted Interrupt Enable bit" mask="0x00000010" name="TXATIE" values="CFD2FIFOCON11__TXATIE"/>
          <bitfield caption="Received Message Time Stamp Enable bit" mask="0x00000020" name="RXTSEN" values="CFD2FIFOCON11__RXTSEN"/>
          <bitfield caption="Auto RTR Enable bit" mask="0x00000040" name="RTREN" values="CFD2FIFOCON11__RTREN"/>
          <bitfield caption="TX / RX Buffer Selection bit" mask="0x00000080" name="TXEN" values="CFD2FIFOCON11__TXEN"/>
          <bitfield caption="Increment Head / Tail bit" mask="0x00000100" name="UINC" values="CFD2FIFOCON11__UINC"/>
          <bitfield caption="Message Send Request bit" mask="0x00000200" name="TXREQ" values="CFD2FIFOCON11__TXREQ"/>
          <bitfield caption="FIFO Reset bit" mask="0x00000400" name="FRESET" values="CFD2FIFOCON11__FRESET"/>
          <bitfield caption="Message Transmit Priority bits (EXPANDED)" mask="0x001F0000" name="TXPRI" values="CFD2FIFOCON11__TXPRI"/>
          <bitfield caption="Retransmission Attempts bits" mask="0x00600000" name="TXAT" values="CFD2FIFOCON11__TXAT"/>
          <bitfield caption="FIFO Size bits" mask="0x1F000000" name="FSIZE" values="CFD2FIFOCON11__FSIZE"/>
          <bitfield caption="Payload Size bits" mask="0xE0000000" name="PLSIZE" values="CFD2FIFOCON11__PLSIZE"/>
        </register>
        <register caption="" name="CFD2FIFOSTA11" offset="0xd8" rw="RW" size="4">
          <bitfield mask="0x00000001" name="TFNRFNIF"/>
          <bitfield mask="0x00000002" name="TFHRFHIF"/>
          <bitfield mask="0x00000004" name="TFERFFIF"/>
          <bitfield mask="0x00000008" name="RXOVIF"/>
          <bitfield mask="0x00000010" name="TXATIF"/>
          <bitfield mask="0x00000020" name="TXERR"/>
          <bitfield mask="0x00000040" name="TXLARB"/>
          <bitfield mask="0x00000080" name="TXABT"/>
          <bitfield mask="0x00001F00" name="FIFOCI"/>
        </register>
        <register caption="" name="CFD2FIFOUA11" offset="0xdc" rw="RW" size="4">
          <bitfield caption="FIFO User Address bits" mask="0xFFFFFFFF" name="FIFOUA"/>
        </register>
        <register caption="FIFO Control Register" name="CFD2FIFOCON12" offset="0xe0" rw="RW" size="4">
          <bitfield caption="Transmit/Receive FIFO Not Full/Not Empty Interrupt Enable bit" mask="0x00000001" name="TFNRFNIE" values="CFD2FIFOCON12__TFNRFNIE"/>
          <bitfield caption="Transmit/Receive FIFO Half Empty/Half Full Interrupt Enable bit" mask="0x00000002" name="TFHRFHIE" values="CFD2FIFOCON12__TFHRFHIE"/>
          <bitfield caption="Transmit/Receive FIFO Empty/Full Interrupt Enable bit" mask="0x00000004" name="TFERFFIE" values="CFD2FIFOCON12__TFERFFIE"/>
          <bitfield caption="Overflow Interrupt Enable bit" mask="0x00000008" name="RXOVIE" values="CFD2FIFOCON12__RXOVIE"/>
          <bitfield caption="Transmit Attempts Exhausted Interrupt Enable bit" mask="0x00000010" name="TXATIE" values="CFD2FIFOCON12__TXATIE"/>
          <bitfield caption="Received Message Time Stamp Enable bit" mask="0x00000020" name="RXTSEN" values="CFD2FIFOCON12__RXTSEN"/>
          <bitfield caption="Auto RTR Enable bit" mask="0x00000040" name="RTREN" values="CFD2FIFOCON12__RTREN"/>
          <bitfield caption="TX / RX Buffer Selection bit" mask="0x00000080" name="TXEN" values="CFD2FIFOCON12__TXEN"/>
          <bitfield caption="Increment Head / Tail bit" mask="0x00000100" name="UINC" values="CFD2FIFOCON12__UINC"/>
          <bitfield caption="Message Send Request bit" mask="0x00000200" name="TXREQ" values="CFD2FIFOCON12__TXREQ"/>
          <bitfield caption="FIFO Reset bit" mask="0x00000400" name="FRESET" values="CFD2FIFOCON12__FRESET"/>
          <bitfield caption="Message Transmit Priority bits (EXPANDED)" mask="0x001F0000" name="TXPRI" values="CFD2FIFOCON12__TXPRI"/>
          <bitfield caption="Retransmission Attempts bits" mask="0x00600000" name="TXAT" values="CFD2FIFOCON12__TXAT"/>
          <bitfield caption="FIFO Size bits" mask="0x1F000000" name="FSIZE" values="CFD2FIFOCON12__FSIZE"/>
          <bitfield caption="Payload Size bits" mask="0xE0000000" name="PLSIZE" values="CFD2FIFOCON12__PLSIZE"/>
        </register>
        <register caption="" name="CFD2FIFOSTA12" offset="0xe4" rw="RW" size="4">
          <bitfield mask="0x00000001" name="TFNRFNIF"/>
          <bitfield mask="0x00000002" name="TFHRFHIF"/>
          <bitfield mask="0x00000004" name="TFERFFIF"/>
          <bitfield mask="0x00000008" name="RXOVIF"/>
          <bitfield mask="0x00000010" name="TXATIF"/>
          <bitfield mask="0x00000020" name="TXERR"/>
          <bitfield mask="0x00000040" name="TXLARB"/>
          <bitfield mask="0x00000080" name="TXABT"/>
          <bitfield mask="0x00001F00" name="FIFOCI"/>
        </register>
        <register caption="" name="CFD2FIFOUA12" offset="0xe8" rw="RW" size="4">
          <bitfield caption="FIFO User Address bits" mask="0xFFFFFFFF" name="FIFOUA"/>
        </register>
