Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-W_DFP/1.8.326/atdf/PIC32MZ2051W104132.atdf
        <register caption="FIFO Control Register" name="CFD2FIFOCON13" offset="0xec" rw="RW" size="4">
          <bitfield caption="Transmit/Receive FIFO Not Full/Not Empty Interrupt Enable bit" mask="0x00000001" name="TFNRFNIE" values="CFD2FIFOCON13__TFNRFNIE"/>
          <bitfield caption="Transmit/Receive FIFO Half Empty/Half Full Interrupt Enable bit" mask="0x00000002" name="TFHRFHIE" values="CFD2FIFOCON13__TFHRFHIE"/>
          <bitfield caption="Transmit/Receive FIFO Empty/Full Interrupt Enable bit" mask="0x00000004" name="TFERFFIE" values="CFD2FIFOCON13__TFERFFIE"/>
          <bitfield caption="Overflow Interrupt Enable bit" mask="0x00000008" name="RXOVIE" values="CFD2FIFOCON13__RXOVIE"/>
          <bitfield caption="Transmit Attempts Exhausted Interrupt Enable bit" mask="0x00000010" name="TXATIE" values="CFD2FIFOCON13__TXATIE"/>
          <bitfield caption="Received Message Time Stamp Enable bit" mask="0x00000020" name="RXTSEN" values="CFD2FIFOCON13__RXTSEN"/>
          <bitfield caption="Auto RTR Enable bit" mask="0x00000040" name="RTREN" values="CFD2FIFOCON13__RTREN"/>
          <bitfield caption="TX / RX Buffer Selection bit" mask="0x00000080" name="TXEN" values="CFD2FIFOCON13__TXEN"/>
          <bitfield caption="Increment Head / Tail bit" mask="0x00000100" name="UINC" values="CFD2FIFOCON13__UINC"/>
          <bitfield caption="Message Send Request bit" mask="0x00000200" name="TXREQ" values="CFD2FIFOCON13__TXREQ"/>
          <bitfield caption="FIFO Reset bit" mask="0x00000400" name="FRESET" values="CFD2FIFOCON13__FRESET"/>
          <bitfield caption="Message Transmit Priority bits (EXPANDED)" mask="0x001F0000" name="TXPRI" values="CFD2FIFOCON13__TXPRI"/>
          <bitfield caption="Retransmission Attempts bits" mask="0x00600000" name="TXAT" values="CFD2FIFOCON13__TXAT"/>
          <bitfield caption="FIFO Size bits" mask="0x1F000000" name="FSIZE" values="CFD2FIFOCON13__FSIZE"/>
          <bitfield caption="Payload Size bits" mask="0xE0000000" name="PLSIZE" values="CFD2FIFOCON13__PLSIZE"/>
        </register>
        <register caption="" name="CFD2FIFOSTA13" offset="0xf0" rw="RW" size="4">
          <bitfield mask="0x00000001" name="TFNRFNIF"/>
          <bitfield mask="0x00000002" name="TFHRFHIF"/>
          <bitfield mask="0x00000004" name="TFERFFIF"/>
          <bitfield mask="0x00000008" name="RXOVIF"/>
          <bitfield mask="0x00000010" name="TXATIF"/>
          <bitfield mask="0x00000020" name="TXERR"/>
          <bitfield mask="0x00000040" name="TXLARB"/>
          <bitfield mask="0x00000080" name="TXABT"/>
          <bitfield mask="0x00001F00" name="FIFOCI"/>
        </register>
        <register caption="" name="CFD2FIFOUA13" offset="0xf4" rw="RW" size="4">
          <bitfield caption="FIFO User Address bits" mask="0xFFFFFFFF" name="FIFOUA"/>
        </register>
        <register caption="FIFO Control Register" name="CFD2FIFOCON14" offset="0xf8" rw="RW" size="4">
          <bitfield caption="Transmit/Receive FIFO Not Full/Not Empty Interrupt Enable bit" mask="0x00000001" name="TFNRFNIE" values="CFD2FIFOCON14__TFNRFNIE"/>
          <bitfield caption="Transmit/Receive FIFO Half Empty/Half Full Interrupt Enable bit" mask="0x00000002" name="TFHRFHIE" values="CFD2FIFOCON14__TFHRFHIE"/>
          <bitfield caption="Transmit/Receive FIFO Empty/Full Interrupt Enable bit" mask="0x00000004" name="TFERFFIE" values="CFD2FIFOCON14__TFERFFIE"/>
          <bitfield caption="Overflow Interrupt Enable bit" mask="0x00000008" name="RXOVIE" values="CFD2FIFOCON14__RXOVIE"/>
          <bitfield caption="Transmit Attempts Exhausted Interrupt Enable bit" mask="0x00000010" name="TXATIE" values="CFD2FIFOCON14__TXATIE"/>
          <bitfield caption="Received Message Time Stamp Enable bit" mask="0x00000020" name="RXTSEN" values="CFD2FIFOCON14__RXTSEN"/>
          <bitfield caption="Auto RTR Enable bit" mask="0x00000040" name="RTREN" values="CFD2FIFOCON14__RTREN"/>
          <bitfield caption="TX / RX Buffer Selection bit" mask="0x00000080" name="TXEN" values="CFD2FIFOCON14__TXEN"/>
          <bitfield caption="Increment Head / Tail bit" mask="0x00000100" name="UINC" values="CFD2FIFOCON14__UINC"/>
          <bitfield caption="Message Send Request bit" mask="0x00000200" name="TXREQ" values="CFD2FIFOCON14__TXREQ"/>
          <bitfield caption="FIFO Reset bit" mask="0x00000400" name="FRESET" values="CFD2FIFOCON14__FRESET"/>
          <bitfield caption="Message Transmit Priority bits (EXPANDED)" mask="0x001F0000" name="TXPRI" values="CFD2FIFOCON14__TXPRI"/>
          <bitfield caption="Retransmission Attempts bits" mask="0x00600000" name="TXAT" values="CFD2FIFOCON14__TXAT"/>
          <bitfield caption="FIFO Size bits" mask="0x1F000000" name="FSIZE" values="CFD2FIFOCON14__FSIZE"/>
          <bitfield caption="Payload Size bits" mask="0xE0000000" name="PLSIZE" values="CFD2FIFOCON14__PLSIZE"/>
        </register>
        <register caption="" name="CFD2FIFOSTA14" offset="0xfc" rw="RW" size="4">
          <bitfield mask="0x00000001" name="TFNRFNIF"/>
          <bitfield mask="0x00000002" name="TFHRFHIF"/>
          <bitfield mask="0x00000004" name="TFERFFIF"/>
          <bitfield mask="0x00000008" name="RXOVIF"/>
          <bitfield mask="0x00000010" name="TXATIF"/>
          <bitfield mask="0x00000020" name="TXERR"/>
          <bitfield mask="0x00000040" name="TXLARB"/>
          <bitfield mask="0x00000080" name="TXABT"/>
          <bitfield mask="0x00001F00" name="FIFOCI"/>
        </register>
        <register caption="" name="CFD2FIFOUA14" offset="0x100" rw="RW" size="4">
          <bitfield caption="FIFO User Address bits" mask="0xFFFFFFFF" name="FIFOUA"/>
        </register>
        <register caption="FIFO Control Register" name="CFD2FIFOCON15" offset="0x104" rw="RW" size="4">
          <bitfield caption="Transmit/Receive FIFO Not Full/Not Empty Interrupt Enable bit" mask="0x00000001" name="TFNRFNIE" values="CFD2FIFOCON15__TFNRFNIE"/>
          <bitfield caption="Transmit/Receive FIFO Half Empty/Half Full Interrupt Enable bit" mask="0x00000002" name="TFHRFHIE" values="CFD2FIFOCON15__TFHRFHIE"/>
          <bitfield caption="Transmit/Receive FIFO Empty/Full Interrupt Enable bit" mask="0x00000004" name="TFERFFIE" values="CFD2FIFOCON15__TFERFFIE"/>
          <bitfield caption="Overflow Interrupt Enable bit" mask="0x00000008" name="RXOVIE" values="CFD2FIFOCON15__RXOVIE"/>
          <bitfield caption="Transmit Attempts Exhausted Interrupt Enable bit" mask="0x00000010" name="TXATIE" values="CFD2FIFOCON15__TXATIE"/>
          <bitfield caption="Received Message Time Stamp Enable bit" mask="0x00000020" name="RXTSEN" values="CFD2FIFOCON15__RXTSEN"/>
          <bitfield caption="Auto RTR Enable bit" mask="0x00000040" name="RTREN" values="CFD2FIFOCON15__RTREN"/>
          <bitfield caption="TX / RX Buffer Selection bit" mask="0x00000080" name="TXEN" values="CFD2FIFOCON15__TXEN"/>
          <bitfield caption="Increment Head / Tail bit" mask="0x00000100" name="UINC" values="CFD2FIFOCON15__UINC"/>
          <bitfield caption="Message Send Request bit" mask="0x00000200" name="TXREQ" values="CFD2FIFOCON15__TXREQ"/>
          <bitfield caption="FIFO Reset bit" mask="0x00000400" name="FRESET" values="CFD2FIFOCON15__FRESET"/>
          <bitfield caption="Message Transmit Priority bits (EXPANDED)" mask="0x001F0000" name="TXPRI" values="CFD2FIFOCON15__TXPRI"/>
          <bitfield caption="Retransmission Attempts bits" mask="0x00600000" name="TXAT" values="CFD2FIFOCON15__TXAT"/>
          <bitfield caption="FIFO Size bits" mask="0x1F000000" name="FSIZE" values="CFD2FIFOCON15__FSIZE"/>
          <bitfield caption="Payload Size bits" mask="0xE0000000" name="PLSIZE" values="CFD2FIFOCON15__PLSIZE"/>
        </register>
        <register caption="" name="CFD2FIFOSTA15" offset="0x108" rw="RW" size="4">
          <bitfield mask="0x00000001" name="TFNRFNIF"/>
          <bitfield mask="0x00000002" name="TFHRFHIF"/>
          <bitfield mask="0x00000004" name="TFERFFIF"/>
          <bitfield mask="0x00000008" name="RXOVIF"/>
          <bitfield mask="0x00000010" name="TXATIF"/>
          <bitfield mask="0x00000020" name="TXERR"/>
          <bitfield mask="0x00000040" name="TXLARB"/>
          <bitfield mask="0x00000080" name="TXABT"/>
          <bitfield mask="0x00001F00" name="FIFOCI"/>
        </register>
        <register caption="" name="CFD2FIFOUA15" offset="0x10c" rw="RW" size="4">
          <bitfield caption="FIFO User Address bits" mask="0xFFFFFFFF" name="FIFOUA"/>
        </register>
        <register caption="Filter Control Registe" name="CFD2FLTCON0" offset="0x110" rw="RW" size="4">
          <bitfield caption="Pointer to Object when Filter n hits bits" mask="0x0000001F" name="F0BP" values="CFD2FLTCON0__F0BP"/>
          <bitfield caption="Enable Filter n to Accept Messages bits" mask="0x00000080" name="FLTEN0" values="CFD2FLTCON0__FLTEN0"/>
          <bitfield caption="Pointer to Object when Filter n hits bits" mask="0x00001F00" name="F1BP" values="CFD2FLTCON0__F1BP"/>
          <bitfield caption="Enable Filter n to Accept Messages bits" mask="0x00008000" name="FLTEN1" values="CFD2FLTCON0__FLTEN1"/>
          <bitfield caption="Pointer to Object when Filter n hits bits" mask="0x001F0000" name="F2BP" values="CFD2FLTCON0__F2BP"/>
          <bitfield caption="Enable Filter n to Accept Messages bits" mask="0x00800000" name="FLTEN2" values="CFD2FLTCON0__FLTEN2"/>
          <bitfield caption="Pointer to Object when Filter n hits bits" mask="0x1F000000" name="F3BP" values="CFD2FLTCON0__F3BP"/>
          <bitfield caption="Enable Filter n to Accept Messages bits" mask="0x80000000" name="FLTEN3" values="CFD2FLTCON0__FLTEN3"/>
        </register>
