Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-W_DFP/1.8.326/atdf/PIC32MZ2051W104132.atdf
        <register caption="Filter Object Register" name="CFD2FLTOBJ3" offset="0x138" rw="RW" size="4">
          <bitfield mask="0x000007FF" name="SID"/>
          <bitfield mask="0x1FFFF800" name="EID"/>
          <bitfield caption="Standard Identifier Filter bit" mask="0x20000000" name="SID11" values="CFD2FLTOBJ3__SID11"/>
          <bitfield caption="Extended Identifier Enable bit" mask="0x40000000" name="EXIDE" values="CFD2FLTOBJ3__EXIDE"/>
        </register>
        <register caption="" name="CFD2MASK3" offset="0x13c" rw="RW" size="4">
          <bitfield mask="0x000007FF" name="MSID"/>
          <bitfield mask="0x1FFFF800" name="MEID"/>
          <bitfield caption="Standard Identifier Mask bit" mask="0x20000000" name="MSID11" values="CFD2MASK3__MSID11"/>
          <bitfield caption="Identifier Receive Mode bit" mask="0x40000000" name="MIDE" values="CFD2MASK3__MIDE"/>
        </register>
        <register caption="Filter Object Register" name="CFD2FLTOBJ4" offset="0x140" rw="RW" size="4">
          <bitfield mask="0x000007FF" name="SID"/>
          <bitfield mask="0x1FFFF800" name="EID"/>
          <bitfield caption="Standard Identifier Filter bit" mask="0x20000000" name="SID11" values="CFD2FLTOBJ4__SID11"/>
          <bitfield caption="Extended Identifier Enable bit" mask="0x40000000" name="EXIDE" values="CFD2FLTOBJ4__EXIDE"/>
        </register>
        <register caption="Filter Object Register" name="CFD2MASK4" offset="0x144" rw="RW" size="4">
          <bitfield mask="0x000007FF" name="MSID"/>
          <bitfield mask="0x1FFFF800" name="MEID"/>
          <bitfield caption="Standard Identifier Mask bit" mask="0x20000000" name="MSID11" values="CFD2MASK4__MSID11"/>
          <bitfield caption="Identifier Receive Mode bit" mask="0x40000000" name="MIDE" values="CFD2MASK4__MIDE"/>
        </register>
        <register caption="Filter Object Register" name="CFD2FLTOBJ5" offset="0x148" rw="RW" size="4">
          <bitfield mask="0x000007FF" name="SID"/>
          <bitfield mask="0x1FFFF800" name="EID"/>
          <bitfield caption="Standard Identifier Filter bit" mask="0x20000000" name="SID11" values="CFD2FLTOBJ5__SID11"/>
          <bitfield caption="Extended Identifier Enable bit" mask="0x40000000" name="EXIDE" values="CFD2FLTOBJ5__EXIDE"/>
        </register>
        <register caption="Filter Object Register" name="CFD2MASK5" offset="0x14c" rw="RW" size="4">
          <bitfield mask="0x000007FF" name="MSID"/>
          <bitfield mask="0x1FFFF800" name="MEID"/>
          <bitfield caption="Standard Identifier Mask bit" mask="0x20000000" name="MSID11" values="CFD2MASK5__MSID11"/>
          <bitfield caption="Identifier Receive Mode bit" mask="0x40000000" name="MIDE" values="CFD2MASK5__MIDE"/>
        </register>
        <register caption="Filter Object Register" name="CFD2FLTOBJ6" offset="0x150" rw="RW" size="4">
          <bitfield mask="0x000007FF" name="SID"/>
          <bitfield mask="0x1FFFF800" name="EID"/>
          <bitfield caption="Standard Identifier Filter bit" mask="0x20000000" name="SID11" values="CFD2FLTOBJ6__SID11"/>
          <bitfield caption="Extended Identifier Enable bit" mask="0x40000000" name="EXIDE" values="CFD2FLTOBJ6__EXIDE"/>
        </register>
        <register caption="Filter Object Register" name="CFD2MASK6" offset="0x154" rw="RW" size="4">
          <bitfield mask="0x000007FF" name="MSID"/>
          <bitfield mask="0x1FFFF800" name="MEID"/>
          <bitfield caption="Standard Identifier Mask bit" mask="0x20000000" name="MSID11" values="CFD2MASK6__MSID11"/>
          <bitfield caption="Identifier Receive Mode bit" mask="0x40000000" name="MIDE" values="CFD2MASK6__MIDE"/>
        </register>
        <register caption="Filter Object Register" name="CFD2FLTOBJ7" offset="0x158" rw="RW" size="4">
          <bitfield mask="0x000007FF" name="SID"/>
          <bitfield mask="0x1FFFF800" name="EID"/>
          <bitfield caption="Standard Identifier Filter bit" mask="0x20000000" name="SID11" values="CFD2FLTOBJ7__SID11"/>
          <bitfield caption="Extended Identifier Enable bit" mask="0x40000000" name="EXIDE" values="CFD2FLTOBJ7__EXIDE"/>
        </register>
        <register caption="Filter Object Register" name="CFD2MASK7" offset="0x15c" rw="RW" size="4">
          <bitfield mask="0x000007FF" name="MSID"/>
          <bitfield mask="0x1FFFF800" name="MEID"/>
          <bitfield caption="Standard Identifier Mask bit" mask="0x20000000" name="MSID11" values="CFD2MASK7__MSID11"/>
          <bitfield caption="Identifier Receive Mode bit" mask="0x40000000" name="MIDE" values="CFD2MASK7__MIDE"/>
        </register>
        <register caption="Filter Object Register" name="CFD2FLTOBJ8" offset="0x160" rw="RW" size="4">
          <bitfield mask="0x000007FF" name="SID"/>
          <bitfield mask="0x1FFFF800" name="EID"/>
          <bitfield caption="Standard Identifier Filter bit" mask="0x20000000" name="SID11" values="CFD2FLTOBJ8__SID11"/>
          <bitfield caption="Extended Identifier Enable bit" mask="0x40000000" name="EXIDE" values="CFD2FLTOBJ8__EXIDE"/>
        </register>
        <register caption="Filter Object Register" name="CFD2MASK8" offset="0x164" rw="RW" size="4">
          <bitfield mask="0x000007FF" name="MSID"/>
          <bitfield mask="0x1FFFF800" name="MEID"/>
          <bitfield caption="Standard Identifier Mask bit" mask="0x20000000" name="MSID11" values="CFD2MASK8__MSID11"/>
          <bitfield caption="Identifier Receive Mode bit" mask="0x40000000" name="MIDE" values="CFD2MASK8__MIDE"/>
        </register>
        <register caption="Filter Object Register" name="CFD2FLTOBJ9" offset="0x168" rw="RW" size="4">
          <bitfield mask="0x000007FF" name="SID"/>
          <bitfield mask="0x1FFFF800" name="EID"/>
          <bitfield caption="Standard Identifier Filter bit" mask="0x20000000" name="SID11" values="CFD2FLTOBJ9__SID11"/>
          <bitfield caption="Extended Identifier Enable bit" mask="0x40000000" name="EXIDE" values="CFD2FLTOBJ9__EXIDE"/>
        </register>
