Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-W_DFP/1.8.326/atdf/PIC32MZ2051W104132.atdf
        <register caption="Filter Object Register" name="CFD2MASK9" offset="0x16c" rw="RW" size="4">
          <bitfield mask="0x000007FF" name="MSID"/>
          <bitfield mask="0x1FFFF800" name="MEID"/>
          <bitfield caption="Standard Identifier Mask bit" mask="0x20000000" name="MSID11" values="CFD2MASK9__MSID11"/>
          <bitfield caption="Identifier Receive Mode bit" mask="0x40000000" name="MIDE" values="CFD2MASK9__MIDE"/>
        </register>
        <register caption="Filter Object Register" name="CFD2FLTOBJ10" offset="0x170" rw="RW" size="4">
          <bitfield mask="0x000007FF" name="SID"/>
          <bitfield mask="0x1FFFF800" name="EID"/>
          <bitfield caption="Standard Identifier Filter bit" mask="0x20000000" name="SID11" values="CFD2FLTOBJ10__SID11"/>
          <bitfield caption="Extended Identifier Enable bit" mask="0x40000000" name="EXIDE" values="CFD2FLTOBJ10__EXIDE"/>
        </register>
        <register caption="Filter Object Register" name="CFD2MASK10" offset="0x174" rw="RW" size="4">
          <bitfield mask="0x000007FF" name="MSID"/>
          <bitfield mask="0x1FFFF800" name="MEID"/>
          <bitfield caption="Standard Identifier Mask bit" mask="0x20000000" name="MSID11" values="CFD2MASK10__MSID11"/>
          <bitfield caption="Identifier Receive Mode bit" mask="0x40000000" name="MIDE" values="CFD2MASK10__MIDE"/>
        </register>
        <register caption="Filter Object Registe" name="CFD2FLTOBJ11" offset="0x178" rw="RW" size="4">
          <bitfield mask="0x000007FF" name="SID"/>
          <bitfield mask="0x1FFFF800" name="EID"/>
          <bitfield caption="Standard Identifier Filter bit" mask="0x20000000" name="SID11" values="CFD2FLTOBJ11__SID11"/>
          <bitfield caption="Extended Identifier Enable bit" mask="0x40000000" name="EXIDE" values="CFD2FLTOBJ11__EXIDE"/>
        </register>
        <register caption="Filter Object Registe" name="CFD2MASK11" offset="0x17c" rw="RW" size="4">
          <bitfield mask="0x000007FF" name="MSID"/>
          <bitfield mask="0x1FFFF800" name="MEID"/>
          <bitfield caption="Standard Identifier Mask bit" mask="0x20000000" name="MSID11" values="CFD2MASK11__MSID11"/>
          <bitfield caption="Identifier Receive Mode bit" mask="0x40000000" name="MIDE" values="CFD2MASK11__MIDE"/>
        </register>
        <register caption="Filter Object Register" name="CFD2FLTOBJ12" offset="0x180" rw="RW" size="4">
          <bitfield mask="0x000007FF" name="SID"/>
          <bitfield mask="0x1FFFF800" name="EID"/>
          <bitfield caption="Standard Identifier Filter bit" mask="0x20000000" name="SID11" values="CFD2FLTOBJ12__SID11"/>
          <bitfield caption="Extended Identifier Enable bit" mask="0x40000000" name="EXIDE" values="CFD2FLTOBJ12__EXIDE"/>
        </register>
        <register caption="Filter Object Register" name="CFD2MASK12" offset="0x184" rw="RW" size="4">
          <bitfield mask="0x000007FF" name="MSID"/>
          <bitfield mask="0x1FFFF800" name="MEID"/>
          <bitfield caption="Standard Identifier Mask bit" mask="0x20000000" name="MSID11" values="CFD2MASK12__MSID11"/>
          <bitfield caption="Identifier Receive Mode bit" mask="0x40000000" name="MIDE" values="CFD2MASK12__MIDE"/>
        </register>
        <register caption="Filter Object Register" name="CFD2FLTOBJ13" offset="0x188" rw="RW" size="4">
          <bitfield mask="0x000007FF" name="SID"/>
          <bitfield mask="0x1FFFF800" name="EID"/>
          <bitfield caption="Standard Identifier Filter bit" mask="0x20000000" name="SID11" values="CFD2FLTOBJ13__SID11"/>
          <bitfield caption="Extended Identifier Enable bit" mask="0x40000000" name="EXIDE" values="CFD2FLTOBJ13__EXIDE"/>
        </register>
        <register caption="Filter Object Register" name="CFD2MASK13" offset="0x18c" rw="RW" size="4">
          <bitfield mask="0x000007FF" name="MSID"/>
          <bitfield mask="0x1FFFF800" name="MEID"/>
          <bitfield caption="Standard Identifier Mask bit" mask="0x20000000" name="MSID11" values="CFD2MASK13__MSID11"/>
          <bitfield caption="Identifier Receive Mode bit" mask="0x40000000" name="MIDE" values="CFD2MASK13__MIDE"/>
        </register>
        <register caption="Filter Object Register" name="CFD2FLTOBJ14" offset="0x190" rw="RW" size="4">
          <bitfield mask="0x000007FF" name="SID"/>
          <bitfield mask="0x1FFFF800" name="EID"/>
          <bitfield caption="Standard Identifier Filter bit" mask="0x20000000" name="SID11" values="CFD2FLTOBJ14__SID11"/>
          <bitfield caption="Extended Identifier Enable bit" mask="0x40000000" name="EXIDE" values="CFD2FLTOBJ14__EXIDE"/>
        </register>
        <register caption="Filter Object Register" name="CFD2MASK14" offset="0x194" rw="RW" size="4">
          <bitfield mask="0x000007FF" name="MSID"/>
          <bitfield mask="0x1FFFF800" name="MEID"/>
          <bitfield caption="Standard Identifier Mask bit" mask="0x20000000" name="MSID11" values="CFD2MASK14__MSID11"/>
          <bitfield caption="Identifier Receive Mode bit" mask="0x40000000" name="MIDE" values="CFD2MASK14__MIDE"/>
        </register>
        <register caption="Filter Object Register" name="CFD2FLTOBJ15" offset="0x198" rw="RW" size="4">
          <bitfield mask="0x000007FF" name="SID"/>
          <bitfield mask="0x1FFFF800" name="EID"/>
          <bitfield caption="Standard Identifier Filter bit" mask="0x20000000" name="SID11" values="CFD2FLTOBJ15__SID11"/>
          <bitfield caption="Extended Identifier Enable bit" mask="0x40000000" name="EXIDE" values="CFD2FLTOBJ15__EXIDE"/>
        </register>
        <register caption="Filter Object Register" name="CFD2MASK15" offset="0x19c" rw="RW" size="4">
          <bitfield mask="0x000007FF" name="MSID"/>
          <bitfield mask="0x1FFFF800" name="MEID"/>
          <bitfield caption="Standard Identifier Mask bit" mask="0x20000000" name="MSID11" values="CFD2MASK15__MSID11"/>
          <bitfield caption="Identifier Receive Mode bit" mask="0x40000000" name="MIDE" values="CFD2MASK15__MIDE"/>
        </register>
      </register-group>
      <value-group caption="Device Net Filter Bit Number bits" name="CFD2CON__DNCNT">
        <value caption="Compare up to data byte 0(7-0) and Byte 1(7-0) and Byte 2(6) with EID17" name="" value="0x12"/>
        <value caption="Compare up to data byte 0(7-0) and Byte 1(7-0) and Byte 2(7) with EID(0-16)" name="" value="0x11"/>
        <value caption="Compare up to data byte 0(7-0) and data byte 1(7-0) with EID(0-15)" name="" value="0x10"/>
        <value caption="Compare up to data byte 0(7-0) and data byte 1(7-1) with EID(0-14)" name="" value="0xf"/>
        <value caption="Compare up to data byte 0(7-0) and data byte 1(7-2) with EID(0-13)" name="" value="0xe"/>
        <value caption="Compare up to data byte 0(7-0) and data byte 1(7-3) with EID(0-12)" name="" value="0xd"/>
        <value caption="Compare up to data byte 0(7-0) and data byte 1(7-4) with EID(0-11)" name="" value="0xc"/>
        <value caption="Compare up to data byte 0(7-0) and data byte 1(7-5) with EID(0-10)" name="" value="0xb"/>
        <value caption="Compare up to data byte 0(7-0) and data byte 1(7-6) with EID(0-9)" name="" value="0xa"/>
        <value caption="Compare up to data byte 0(7-0) and data byte 1(7) with EID(0-8)" name="" value="0x9"/>
        <value caption="Compare up to data byte 0(7-0) with EID(0-7)" name="" value="0x8"/>
        <value caption="Compare up to data byte 0(7-1) with EID(0-6)" name="" value="0x7"/>
        <value caption="Compare up to data byte 0(7-2) with EID(0-5)" name="" value="0x6"/>
        <value caption="Compare up to data byte 0(7-3) with EID(0-4)" name="" value="0x5"/>
        <value caption="Compare up to data byte 0(7-4) with EID(0-3)" name="" value="0x4"/>
        <value caption="Compare up to data byte 0(7-5) with EID(0-2)" name="" value="0x3"/>
        <value caption="Compare up to data byte 0(7-6) with EID(0-1)" name="" value="0x2"/>
        <value caption="Compare up to data byte 0 bit 7 with EID0" name="" value="0x1"/>
        <value caption="Do not compare data bytes" name="" value="0x0"/>
      </value-group>
      <value-group caption="Enable ISO CRC in CAN FD Frames bit" name="CFD2CON__ISOCRCEN">
        <value caption="Include Stuff Bit Count in CRC Field and use Non-Zero CRC Initialization Vector" name="" value="0x1"/>
        <value caption="Do not include Stuff Bit Count in CRC Field and use CRC Initialization Vector with all zeros" name="" value="0x0"/>
      </value-group>
