Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-W_DFP/1.8.326/atdf/PIC32MZ2051W104132.atdf
      <value-group caption="Protocol Exception Event Detection Disabled bit" name="CFD2CON__PXEDIS">
        <value caption="Protocol Exception is treated as a Form Error." name="" value="0x1"/>
        <value caption="If a Protocol Exception is detected" name="" value="0x0"/>
      </value-group>
      <value-group caption="Module Clock Source Select bit" name="CFD2CON__CLKSEL0">
        <value caption="ETHPLL is active when the CAN FD module is enabled" name="" value="0x1"/>
        <value caption="PBCLK2 is active when the CAN FD module is enabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="Enable CAN Bus Line Wake-up Filter bit" name="CFD2CON__WAKFIL">
        <value caption="Use CAN bus line filter for wake-up" name="" value="0x1"/>
        <value caption="CAN bus line filter is not used for wake-up" name="" value="0x0"/>
      </value-group>
      <value-group caption="Selectable Wake-up Filter Time bits" name="CFD2CON__WFT">
        <value caption="T11FILTER (Typical 600 ns)" name="" value="0x3"/>
        <value caption="T10FILTER (Typical 375 ns)" name="" value="0x2"/>
        <value caption="T01FILTER (Typical 187 ns)" name="" value="0x1"/>
        <value caption="T00FILTER (Typical 100 ns)" name="" value="0x0"/>
      </value-group>
      <value-group caption="CAN Module is Busy bit" name="CFD2CON__CANBUSY">
        <value caption="The CAN module is active" name="" value="0x1"/>
        <value caption="The CAN module is inactive" name="" value="0x0"/>
      </value-group>
      <value-group caption="Bit Rate Switching Disable bit" name="CFD2CON__BRSDIS">
        <value caption="Bit Rate Switching is Disabled" name="" value="0x1"/>
        <value caption="Bit Rate Switching depends on BRS in the Transmit Message Object" name="" value="0x0"/>
      </value-group>
      <value-group caption="Stop-in-Idle Control bit" name="CFD2CON__SIDL">
        <value caption="Stop module operation in Idle mode" name="" value="0x1"/>
        <value caption="Dont stop module operation in Idle mode" name="" value="0x0"/>
      </value-group>
      <value-group caption="Enable bit" name="CFD2CON__ON">
        <value caption="CAN module is enabled" name="" value="0x1"/>
        <value caption="CAN module is disabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="Restrict Retransmission Attempts bit" name="CFD2CON__RTXAT">
        <value caption="Restricted retransmission attempts" name="" value="0x1"/>
        <value caption="Unlimited number of retransmission attempts" name="" value="0x0"/>
      </value-group>
      <value-group caption="Transmit ESI in Gateway Mode bit" name="CFD2CON__ESIGM">
        <value caption="ESI is transmitted as recessive when ESI of message is high or CAN controller error passive" name="" value="0x1"/>
        <value caption="ESI reflects error status of CAN controller" name="" value="0x0"/>
      </value-group>
      <value-group caption="Transition to Listen Only Mode on System Error bit" name="CFD2CON__SERR2LOM">
        <value caption="Transition to Listen Only Mode" name="" value="0x1"/>
        <value caption="Transition to Restricted Operation Mode" name="" value="0x0"/>
      </value-group>
      <value-group caption="Store in Transmit Event FIFO bit" name="CFD2CON__STEF">
        <value caption="Save transmitted messages in TEF" name="" value="0x1"/>
        <value caption="Dont save transmitted messages in TEF" name="" value="0x0"/>
      </value-group>
      <value-group caption="Enable Transmit Queue bit" name="CFD2CON__TXQEN">
        <value caption="Enables Transmit Queue and reserves space in RAM" name="" value="0x1"/>
        <value caption="Dont reserve space in RAM for Transmit Queue" name="" value="0x0"/>
      </value-group>
      <value-group caption="Operation Mode Status bits" name="CFD2CON__OPMOD">
        <value caption="Module is Restricted Operation mode" name="" value="0x7"/>
        <value caption="Module is Normal CAN 2.0 mode; error frames on CAN FD frames" name="" value="0x6"/>
        <value caption="Module is in External Loopback mode" name="" value="0x5"/>
        <value caption="Module is in Configuration mode" name="" value="0x4"/>
        <value caption="Module is in Listen Only mode" name="" value="0x3"/>
        <value caption="Module is in Internal Loopback mode" name="" value="0x2"/>
        <value caption="Module is in Disable mode" name="" value="0x1"/>
        <value caption="Module is in Normal CAN FD mode; supports mixing of Full CAN FD and Classic CAN 2.0 frames" name="" value="0x0"/>
      </value-group>
      <value-group caption="Request Operation Mode bits" name="CFD2CON__REQOP">
        <value caption="Set Restricted Operation mode" name="" value="0x7"/>
        <value caption="Set Normal CAN 2.0 mode; error frames on CAN FD frames" name="" value="0x6"/>
        <value caption="Set External Loopback mode" name="" value="0x5"/>
        <value caption="Set Configuration mode" name="" value="0x4"/>
        <value caption="Set Listen Only mode" name="" value="0x3"/>
        <value caption="Set Internal Loopback mode" name="" value="0x2"/>
        <value caption="Set Disable mode" name="" value="0x1"/>
        <value caption="Set Normal CAN FD mode; supports mixing of Full CAN FD and Classic CAN 2.0 frames" name="" value="0x0"/>
      </value-group>
      <value-group caption="Abort All Pending Transmissions bit" name="CFD2CON__ABAT">
        <value caption="Signal all transmit buffers to abort transmission" name="" value="0x1"/>
        <value caption="Module will clear this bit when all transmissions aborted" name="" value="0x0"/>
      </value-group>
      <value-group caption="Transmit Bandwidth Sharing bits" name="CFD2CON__TXBWS">
        <value caption="4096" name="" value="0xc"/>
        <value caption="2048" name="" value="0xb"/>
        <value caption="1024" name="" value="0xa"/>
        <value caption="512" name="" value="0x9"/>
        <value caption="256" name="" value="0x8"/>
        <value caption="128" name="" value="0x7"/>
        <value caption="64" name="" value="0x6"/>
        <value caption="32" name="" value="0x5"/>
        <value caption="16" name="" value="0x4"/>
        <value caption="8" name="" value="0x3"/>
        <value caption="4" name="" value="0x2"/>
        <value caption="2" name="" value="0x1"/>
        <value caption="No delay" name="" value="0x0"/>
      </value-group>
      <value-group caption="Synchronization Jump Width bits" name="CFD2NBTCFG__SJW">
        <value caption="Length is 128 x Tq" name="" value="0x7f"/>
        <value caption="Length is 1 x Tq" name="" value="0x0"/>
      </value-group>
      <value-group caption="Time Segment 2 bits" name="CFD2NBTCFG__TSEG2">
        <value caption="Length is 128 x Tq" name="" value="0x1f"/>
        <value caption="Length is 1 x Tq" name="" value="0x0"/>
      </value-group>
      <value-group caption="Time Segment 1 bits" name="CFD2NBTCFG__TSEG1">
        <value caption="Length is 256 x Tq" name="" value="0xff"/>
        <value caption="Length is 1 x Tq" name="" value="0x0"/>
      </value-group>
      <value-group caption="Baud Rate Prescaler bits" name="CFD2NBTCFG__BRP">
        <value caption="Tq = 256/Fsys" name="" value="0xff"/>
        <value caption="Tq = 1/Fsys" name="" value="0x0"/>
      </value-group>
