Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-W_DFP/1.8.326/atdf/PIC32MZ2051W104132.atdf
      <value-group caption="Synchronization Jump Width bits" name="CFD2DBTCFG__SJW">
        <value caption="Length is 16 x Tq" name="" value="0xf"/>
        <value caption="Length is 15 x Tq" name="" value="0xe"/>
        <value caption="Length is 14 x Tq" name="" value="0xd"/>
        <value caption="Length is 13 x Tq" name="" value="0xc"/>
        <value caption="Length is 12 x Tq" name="" value="0xb"/>
        <value caption="Length is 11 x Tq" name="" value="0xa"/>
        <value caption="Length is 10 x Tq" name="" value="0x9"/>
        <value caption="Length is 9 x Tq" name="" value="0x8"/>
        <value caption="Length is 8 x Tq" name="" value="0x7"/>
        <value caption="Length is 7 x Tq" name="" value="0x6"/>
        <value caption="Length is 6 x Tq" name="" value="0x5"/>
        <value caption="Length is 5 x Tq" name="" value="0x4"/>
        <value caption="Length is 4 x Tq" name="" value="0x3"/>
        <value caption="Length is 3 x Tq" name="" value="0x2"/>
        <value caption="Length is 2 x Tq" name="" value="0x1"/>
        <value caption="Length is 1 x Tq" name="" value="0x0"/>
      </value-group>
      <value-group caption="Time Segment 2 bits" name="CFD2DBTCFG__TSEG2">
        <value caption="Length is 16 x Tq" name="" value="0xf"/>
        <value caption="Length is 15 x Tq" name="" value="0xe"/>
        <value caption="Length is 14 x Tq" name="" value="0xd"/>
        <value caption="Length is 13 x Tq" name="" value="0xc"/>
        <value caption="Length is 12 x Tq" name="" value="0xb"/>
        <value caption="Length is 11 x Tq" name="" value="0xa"/>
        <value caption="Length is 10 x Tq" name="" value="0x9"/>
        <value caption="Length is 9 x Tq" name="" value="0x8"/>
        <value caption="Length is 8 x Tq" name="" value="0x7"/>
        <value caption="Length is 7 x Tq" name="" value="0x6"/>
        <value caption="Length is 6 x Tq" name="" value="0x5"/>
        <value caption="Length is 5 x Tq" name="" value="0x4"/>
        <value caption="Length is 4 x Tq" name="" value="0x3"/>
        <value caption="Length is 3 x Tq" name="" value="0x2"/>
        <value caption="Length is 2 x Tq" name="" value="0x1"/>
        <value caption="Length is 1 x Tq" name="" value="0x0"/>
      </value-group>
      <value-group caption="Time Segment 1 bits" name="CFD2DBTCFG__TSEG1">
        <value caption="Length is 32 x Tq" name="" value="0x1f"/>
        <value caption="Length is 31 x Tq" name="" value="0x1e"/>
        <value caption="Length is 30 x Tq" name="" value="0x1d"/>
        <value caption="Length is 29 x Tq" name="" value="0x1c"/>
        <value caption="Length is 28 x Tq" name="" value="0x1b"/>
        <value caption="Length is 27 x Tq" name="" value="0x1a"/>
        <value caption="Length is 26 x Tq" name="" value="0x19"/>
        <value caption="Length is 25 x Tq" name="" value="0x18"/>
        <value caption="Length is 24 x Tq" name="" value="0x17"/>
        <value caption="Length is 23 x Tq" name="" value="0x16"/>
        <value caption="Length is 22 x Tq" name="" value="0x15"/>
        <value caption="Length is 21 x Tq" name="" value="0x14"/>
        <value caption="Length is 20 x Tq" name="" value="0x13"/>
        <value caption="Length is 19 x Tq" name="" value="0x12"/>
        <value caption="Length is 18 x Tq" name="" value="0x11"/>
        <value caption="Length is 17 x Tq" name="" value="0x10"/>
        <value caption="Length is 16 x Tq" name="" value="0xf"/>
        <value caption="Length is 15 x Tq" name="" value="0xe"/>
        <value caption="Length is 14 x Tq" name="" value="0xd"/>
        <value caption="Length is 13 x Tq" name="" value="0xc"/>
        <value caption="Length is 12 x Tq" name="" value="0xb"/>
        <value caption="Length is 11 x Tq" name="" value="0xa"/>
        <value caption="Length is 10 x Tq" name="" value="0x9"/>
        <value caption="Length is 9 x Tq" name="" value="0x8"/>
        <value caption="Length is 8 x Tq" name="" value="0x7"/>
        <value caption="Length is 7 x Tq" name="" value="0x6"/>
        <value caption="Length is 6 x Tq" name="" value="0x5"/>
        <value caption="Length is 5 x Tq" name="" value="0x4"/>
        <value caption="Length is 4 x Tq" name="" value="0x3"/>
        <value caption="Length is 3 x Tq" name="" value="0x2"/>
        <value caption="Length is 2 x Tq" name="" value="0x1"/>
        <value caption="Length is 1 x Tq" name="" value="0x0"/>
      </value-group>
      <value-group caption="Baud Rate Prescaler bits" name="CFD2DBTCFG__BRP">
        <value caption="Tq is 256/Fsys" name="" value="0xff"/>
        <value caption="Tq is 1/Fsys" name="" value="0x0"/>
      </value-group>
      <value-group caption="Transmitter Delay Compensation Value bits; Secondary Sample Point" name="CFD2TDC__TDCV">
        <value caption="63 x SYSCLK" name="" value="0x3f"/>
        <value caption="62 x SYSCLK" name="" value="0x3e"/>
        <value caption="61 x SYSCLK" name="" value="0x3d"/>
        <value caption="60 x SYSCLK" name="" value="0x3c"/>
        <value caption="59 x SYSCLK" name="" value="0x3b"/>
        <value caption="58 x SYSCLK" name="" value="0x3a"/>
        <value caption="57 x SYSCLK" name="" value="0x39"/>
        <value caption="56 x SYSCLK" name="" value="0x38"/>
        <value caption="55 x SYSCLK" name="" value="0x37"/>
        <value caption="54 x SYSCLK" name="" value="0x36"/>
        <value caption="53 x SYSCLK" name="" value="0x35"/>
        <value caption="52 x SYSCLK" name="" value="0x34"/>
        <value caption="51 x SYSCLK" name="" value="0x33"/>
        <value caption="50 x SYSCLK" name="" value="0x32"/>
        <value caption="49 x SYSCLK" name="" value="0x31"/>
        <value caption="48 x SYSCLK" name="" value="0x30"/>
        <value caption="47 x SYSCLK" name="" value="0x2f"/>
        <value caption="46 x SYSCLK" name="" value="0x2e"/>
        <value caption="45 x SYSCLK" name="" value="0x2d"/>
        <value caption="44 x SYSCLK" name="" value="0x2c"/>
        <value caption="43 x SYSCLK" name="" value="0x2b"/>
        <value caption="42 x SYSCLK" name="" value="0x2a"/>
        <value caption="41 x SYSCLK" name="" value="0x29"/>
        <value caption="40 x SYSCLK" name="" value="0x28"/>
        <value caption="39 x SYSCLK" name="" value="0x27"/>
        <value caption="38 x SYSCLK" name="" value="0x26"/>
        <value caption="37 x SYSCLK" name="" value="0x25"/>
        <value caption="36 x SYSCLK" name="" value="0x24"/>
        <value caption="35 x SYSCLK" name="" value="0x23"/>
        <value caption="34 x SYSCLK" name="" value="0x22"/>
        <value caption="33 x SYSCLK" name="" value="0x21"/>
        <value caption="32 x SYSCLK" name="" value="0x20"/>
        <value caption="31 x SYSCLK" name="" value="0x1f"/>
        <value caption="30 x SYSCLK" name="" value="0x1e"/>
        <value caption="29 x SYSCLK" name="" value="0x1d"/>
        <value caption="28 x SYSCLK" name="" value="0x1c"/>
        <value caption="27 x SYSCLK" name="" value="0x1b"/>
        <value caption="26 x SYSCLK" name="" value="0x1a"/>
        <value caption="25 x SYSCLK" name="" value="0x19"/>
        <value caption="24 x SYSCLK" name="" value="0x18"/>
        <value caption="23 x SYSCLK" name="" value="0x17"/>
        <value caption="22 x SYSCLK" name="" value="0x16"/>
        <value caption="21 x SYSCLK" name="" value="0x15"/>
        <value caption="20 x SYSCLK" name="" value="0x14"/>
        <value caption="19 x SYSCLK" name="" value="0x13"/>
        <value caption="18 x SYSCLK" name="" value="0x12"/>
        <value caption="17 x SYSCLK" name="" value="0x11"/>
        <value caption="16 x SYSCLK" name="" value="0x10"/>
        <value caption="15 x SYSCLK" name="" value="0xf"/>
        <value caption="14 x SYSCLK" name="" value="0xe"/>
        <value caption="13 x SYSCLK" name="" value="0xd"/>
        <value caption="12 x SYSCLK" name="" value="0xc"/>
        <value caption="11 x SYSCLK" name="" value="0xb"/>
        <value caption="10 x SYSCLK" name="" value="0xa"/>
        <value caption="9 x SYSCLK" name="" value="0x9"/>
        <value caption="8 x SYSCLK" name="" value="0x8"/>
        <value caption="7 x SYSCLK" name="" value="0x7"/>
        <value caption="6 x SYSCLK" name="" value="0x6"/>
        <value caption="5 x SYSCLK" name="" value="0x5"/>
        <value caption="4 x SYSCLK" name="" value="0x4"/>
        <value caption="3 x SYSCLK" name="" value="0x3"/>
        <value caption="2 x SYSCLK" name="" value="0x2"/>
        <value caption="1 x SYSCLK" name="" value="0x1"/>
        <value caption="0 x SYSCLK" name="" value="0x0"/>
      </value-group>
