Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-W_DFP/1.8.326/atdf/PIC32MZ2051W104132.atdf
      <value-group caption="Transmitter in Error State Bus Off bit (TERRCNT &gt; 255)" name="CFD2TREC__TXBO">
        <value caption="Indicates that the number of transmit errors is greater than 255." name="" value="0x1"/>
        <value caption="Indicates that transmit errors are less than 255" name="" value="0x0"/>
      </value-group>
      <value-group caption="Error Free Message Counter Status bits" name="CFD2BDIAG1__EFMSGCNT">
        <value caption="65536 error free messages since the last register read" name="" value="0xffff"/>
        <value caption="0 error free messages since the last register read" name="" value="0x0"/>
      </value-group>
      <value-group caption="Nominal Bit Logical 0 Error Status bit" name="CFD2BDIAG1__NBIT0ERR">
        <value caption="During the transmission of a nominal message" name="" value="0x1"/>
        <value caption="No nominal bit logical 0 error occurred" name="" value="0x0"/>
      </value-group>
      <value-group caption="Nominal Bit Logical 1 Error Status bit" name="CFD2BDIAG1__NBIT1ERR">
        <value caption="During the transmission of a nominal message (with the exception of the arbitration field)" name="" value="0x1"/>
        <value caption="No nominal bit logical 1 error occurred" name="" value="0x0"/>
      </value-group>
      <value-group caption="Not Acknowledged Error Status bit" name="CFD2BDIAG1__NACKERR">
        <value caption="A transmitted message was not acknowledged" name="" value="0x1"/>
        <value caption="A transmitted message was acknowledged" name="" value="0x0"/>
      </value-group>
      <value-group caption="Nominal Format Error Status bit" name="CFD2BDIAG1__NFORMERR">
        <value caption="A fixed format portion of a nominal received frame has the wrong format" name="" value="0x1"/>
        <value caption="No nominal format error occurred" name="" value="0x0"/>
      </value-group>
      <value-group caption="Nominal Stuffing Error Status bit" name="CFD2BDIAG1__NSTUFERR">
        <value caption="More than five equal bits in a sequence have occurred in a part of a nominal received message where this is not allowed" name="" value="0x1"/>
        <value caption="No nominal bit stuffing errors have occurred" name="" value="0x0"/>
      </value-group>
      <value-group caption="Nominal CRC Error Status bit" name="CFD2BDIAG1__NCRCERR">
        <value caption="The CRC checksum of a nominal received message was incorrect." name="" value="0x1"/>
        <value caption="No nominal CRC received message error occurred" name="" value="0x0"/>
      </value-group>
      <value-group caption="Transmit Bus Off Error Status bit" name="CFD2BDIAG1__TXBOERR">
        <value caption="Transmit error occurred and device enter Bus Off mode and automatically recovered" name="" value="0x1"/>
        <value caption="No transmit Bus Off error occurred" name="" value="0x0"/>
      </value-group>
      <value-group caption="Data Bit Logical 0 Error Status bit" name="CFD2BDIAG1__DBIT0ERR">
        <value caption="During the data transmission of a message the monitored bus value was recessive.  During Bus Off recovery, this status is set each time a sequence of 11 recessive bits has been monitored." name="" value="0x1"/>
        <value caption="No data logical 0 bit transmission error occurred" name="" value="0x0"/>
      </value-group>
      <value-group caption="Data Bit Logical 1 Error Status bit" name="CFD2BDIAG1__DBIT1ERR">
        <value caption="During the data transmission of a message (with the exception of the arbitration field)" name="" value="0x1"/>
        <value caption="No data logical 1 bit transmission error occurred" name="" value="0x0"/>
      </value-group>
      <value-group caption="Data Format Error Status bit" name="CFD2BDIAG1__DFORMERR">
        <value caption="Data fixed format portion of a received frame has the wrong format" name="" value="0x1"/>
        <value caption="No format errors occurred" name="" value="0x0"/>
      </value-group>
      <value-group caption="Data Stuffing Error Status bit" name="CFD2BDIAG1__DSTUFERR">
        <value caption="More than five equal bits in a sequence have occurred in a portion of a received message where this is not allowed" name="" value="0x1"/>
        <value caption="No data received message errors" name="" value="0x0"/>
      </value-group>
      <value-group caption="Data CRC Error Status bit" name="CFD2BDIAG1__DCRCERR">
        <value caption="CRC checksum of a received message was incorrect. The CRC of an incoming message does not match with the CRC calculated from the received data" name="" value="0x1"/>
        <value caption="No received message data CRC error occurred" name="" value="0x0"/>
      </value-group>
      <value-group caption="Error State Indicator (ESI) Flag Status bit" name="CFD2BDIAG1__ESI">
        <value caption="ESI flag of a received CAN FD message was set" name="" value="0x1"/>
        <value caption="ESI flag of a received CAN FD message was not set" name="" value="0x0"/>
      </value-group>
      <value-group caption="Data Length Code (DLC) Mismatch Status bit" name="CFD2BDIAG1__DLCMM">
        <value caption="Payload size error. During a transmission or reception the Data Length Code exceeds the payload size of the FIFO element defined in the PLSIZE bits (CxFIFOCONn)." name="" value="0x1"/>
        <value caption="No payload size error occurred" name="" value="0x0"/>
      </value-group>
      <value-group caption="Transmit Event FIFO Not Empty Interrupt Enable bit" name="CFD2TEFCON__TEFNEIE">
        <value caption="Interrupt enabled for FIFO not empty" name="" value="0x1"/>
        <value caption="Interrupt disabled for FIFO not empty" name="" value="0x0"/>
      </value-group>
      <value-group caption="Transmit Event FIFO Half Full Interrupt Enable bit" name="CFD2TEFCON__TEFHIE">
        <value caption="Interrupt enabled for FIFO half full" name="" value="0x1"/>
        <value caption="Interrupt disabled for FIFO half full" name="" value="0x0"/>
      </value-group>
      <value-group caption="Transmit Event FIFO Full Interrupt Enable bit" name="CFD2TEFCON__TEFFIE">
        <value caption="Interrupt enabled for FIFO full" name="" value="0x1"/>
        <value caption="Interrupt disabled for FIFO full" name="" value="0x0"/>
      </value-group>
      <value-group caption="Transmit Event FIFO Overflow Interrupt Enable bit" name="CFD2TEFCON__TEFOVIE">
        <value caption="Interrupt enabled for overflow event" name="" value="0x1"/>
        <value caption="Interrupt disabled for overflow event" name="" value="0x0"/>
      </value-group>
      <value-group caption="Transmit Event FIFO Time Stamp Enable bit" name="CFD2TEFCON__TEFTSEN">
        <value caption="Time stamp elements in TEF" name="" value="0x1"/>
        <value caption="Do not time stamp elements in TEF" name="" value="0x0"/>
      </value-group>
