Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-W_DFP/1.8.326/atdf/PIC32MZ2051W104132.atdf
      <value-group caption="Pointer to Object when Filter n hits bits" name="CFD2FLTCON0__F3BP">
        <value caption="Message matching filter is stored in Object 31" name="" value="0x1f"/>
        <value caption="Message matching filter is stored in Object 30" name="" value="0x1e"/>
        <value caption="Message matching filter is stored in Object 29" name="" value="0x1d"/>
        <value caption="Message matching filter is stored in Object 28" name="" value="0x1c"/>
        <value caption="Message matching filter is stored in Object 27" name="" value="0x1b"/>
        <value caption="Message matching filter is stored in Object 26" name="" value="0x1a"/>
        <value caption="Message matching filter is stored in Object 25" name="" value="0x19"/>
        <value caption="Message matching filter is stored in Object 24" name="" value="0x18"/>
        <value caption="Message matching filter is stored in Object 23" name="" value="0x17"/>
        <value caption="Message matching filter is stored in Object 22" name="" value="0x16"/>
        <value caption="Message matching filter is stored in Object 21" name="" value="0x15"/>
        <value caption="Message matching filter is stored in Object 20" name="" value="0x14"/>
        <value caption="Message matching filter is stored in Object 19" name="" value="0x13"/>
        <value caption="Message matching filter is stored in Object 18" name="" value="0x12"/>
        <value caption="Message matching filter is stored in Object 17" name="" value="0x11"/>
        <value caption="Message matching filter is stored in Object 16" name="" value="0x10"/>
        <value caption="Message matching filter is stored in Object 15" name="" value="0xf"/>
        <value caption="Message matching filter is stored in Object 14" name="" value="0xe"/>
        <value caption="Message matching filter is stored in Object 13" name="" value="0xd"/>
        <value caption="Message matching filter is stored in Object 12" name="" value="0xc"/>
        <value caption="Message matching filter is stored in Object 11" name="" value="0xb"/>
        <value caption="Message matching filter is stored in Object 10" name="" value="0xa"/>
        <value caption="Message matching filter is stored in Object 9" name="" value="0x9"/>
        <value caption="Message matching filter is stored in Object 8" name="" value="0x8"/>
        <value caption="Message matching filter is stored in Object 7" name="" value="0x7"/>
        <value caption="Message matching filter is stored in Object 6" name="" value="0x6"/>
        <value caption="Message matching filter is stored in Object 5" name="" value="0x5"/>
        <value caption="Message matching filter is stored in Object 4" name="" value="0x4"/>
        <value caption="Message matching filter is stored in Object 3" name="" value="0x3"/>
        <value caption="Message matching filter is stored in Object 2" name="" value="0x2"/>
        <value caption="Message matching filter is stored in Object 1" name="" value="0x1"/>
        <value caption="Reserved. Object 0 is the TX Queue and cannot receive messages." name="" value="0x0"/>
      </value-group>
      <value-group caption="Enable Filter n to Accept Messages bits" name="CFD2FLTCON0__FLTEN3">
        <value caption="Filter is enabled" name="" value="0x1"/>
        <value caption="Filter is disabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="Pointer to Object when Filter n hits bits" name="CFD2FLTCON1__F4BP">
        <value caption="Message matching filter is stored in Object 31" name="" value="0x1f"/>
        <value caption="Message matching filter is stored in Object 30" name="" value="0x1e"/>
        <value caption="Message matching filter is stored in Object 29" name="" value="0x1d"/>
        <value caption="Message matching filter is stored in Object 28" name="" value="0x1c"/>
        <value caption="Message matching filter is stored in Object 27" name="" value="0x1b"/>
        <value caption="Message matching filter is stored in Object 26" name="" value="0x1a"/>
        <value caption="Message matching filter is stored in Object 25" name="" value="0x19"/>
        <value caption="Message matching filter is stored in Object 24" name="" value="0x18"/>
        <value caption="Message matching filter is stored in Object 23" name="" value="0x17"/>
        <value caption="Message matching filter is stored in Object 22" name="" value="0x16"/>
        <value caption="Message matching filter is stored in Object 21" name="" value="0x15"/>
        <value caption="Message matching filter is stored in Object 20" name="" value="0x14"/>
        <value caption="Message matching filter is stored in Object 19" name="" value="0x13"/>
        <value caption="Message matching filter is stored in Object 18" name="" value="0x12"/>
        <value caption="Message matching filter is stored in Object 17" name="" value="0x11"/>
        <value caption="Message matching filter is stored in Object 16" name="" value="0x10"/>
        <value caption="Message matching filter is stored in Object 15" name="" value="0xf"/>
        <value caption="Message matching filter is stored in Object 14" name="" value="0xe"/>
        <value caption="Message matching filter is stored in Object 13" name="" value="0xd"/>
        <value caption="Message matching filter is stored in Object 12" name="" value="0xc"/>
        <value caption="Message matching filter is stored in Object 11" name="" value="0xb"/>
        <value caption="Message matching filter is stored in Object 10" name="" value="0xa"/>
        <value caption="Message matching filter is stored in Object 9" name="" value="0x9"/>
        <value caption="Message matching filter is stored in Object 8" name="" value="0x8"/>
        <value caption="Message matching filter is stored in Object 7" name="" value="0x7"/>
        <value caption="Message matching filter is stored in Object 6" name="" value="0x6"/>
        <value caption="Message matching filter is stored in Object 5" name="" value="0x5"/>
        <value caption="Message matching filter is stored in Object 4" name="" value="0x4"/>
        <value caption="Message matching filter is stored in Object 3" name="" value="0x3"/>
        <value caption="Message matching filter is stored in Object 2" name="" value="0x2"/>
        <value caption="Message matching filter is stored in Object 1" name="" value="0x1"/>
        <value caption="Reserved. Object 0 is the TX Queue and cannot receive messages." name="" value="0x0"/>
      </value-group>
      <value-group caption="Enable Filter n to Accept Messages bits" name="CFD2FLTCON1__FLTEN4">
        <value caption="Filter is enabled" name="" value="0x1"/>
        <value caption="Filter is disabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="Pointer to Object when Filter n hits bits" name="CFD2FLTCON1__F5BP">
        <value caption="Message matching filter is stored in Object 31" name="" value="0x1f"/>
        <value caption="Message matching filter is stored in Object 30" name="" value="0x1e"/>
        <value caption="Message matching filter is stored in Object 29" name="" value="0x1d"/>
        <value caption="Message matching filter is stored in Object 28" name="" value="0x1c"/>
        <value caption="Message matching filter is stored in Object 27" name="" value="0x1b"/>
        <value caption="Message matching filter is stored in Object 26" name="" value="0x1a"/>
        <value caption="Message matching filter is stored in Object 25" name="" value="0x19"/>
        <value caption="Message matching filter is stored in Object 24" name="" value="0x18"/>
        <value caption="Message matching filter is stored in Object 23" name="" value="0x17"/>
        <value caption="Message matching filter is stored in Object 22" name="" value="0x16"/>
        <value caption="Message matching filter is stored in Object 21" name="" value="0x15"/>
        <value caption="Message matching filter is stored in Object 20" name="" value="0x14"/>
        <value caption="Message matching filter is stored in Object 19" name="" value="0x13"/>
        <value caption="Message matching filter is stored in Object 18" name="" value="0x12"/>
        <value caption="Message matching filter is stored in Object 17" name="" value="0x11"/>
        <value caption="Message matching filter is stored in Object 16" name="" value="0x10"/>
        <value caption="Message matching filter is stored in Object 15" name="" value="0xf"/>
        <value caption="Message matching filter is stored in Object 14" name="" value="0xe"/>
        <value caption="Message matching filter is stored in Object 13" name="" value="0xd"/>
        <value caption="Message matching filter is stored in Object 12" name="" value="0xc"/>
        <value caption="Message matching filter is stored in Object 11" name="" value="0xb"/>
        <value caption="Message matching filter is stored in Object 10" name="" value="0xa"/>
        <value caption="Message matching filter is stored in Object 9" name="" value="0x9"/>
        <value caption="Message matching filter is stored in Object 8" name="" value="0x8"/>
        <value caption="Message matching filter is stored in Object 7" name="" value="0x7"/>
        <value caption="Message matching filter is stored in Object 6" name="" value="0x6"/>
        <value caption="Message matching filter is stored in Object 5" name="" value="0x5"/>
        <value caption="Message matching filter is stored in Object 4" name="" value="0x4"/>
        <value caption="Message matching filter is stored in Object 3" name="" value="0x3"/>
        <value caption="Message matching filter is stored in Object 2" name="" value="0x2"/>
        <value caption="Message matching filter is stored in Object 1" name="" value="0x1"/>
        <value caption="Reserved. Object 0 is the TX Queue and cannot receive messages." name="" value="0x0"/>
      </value-group>
      <value-group caption="Enable Filter n to Accept Messages bits" name="CFD2FLTCON1__FLTEN5">
        <value caption="Filter is enabled" name="" value="0x1"/>
        <value caption="Filter is disabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="Pointer to Object when Filter n hits bits" name="CFD2FLTCON1__F6BP">
        <value caption="Message matching filter is stored in Object 31" name="" value="0x1f"/>
        <value caption="Message matching filter is stored in Object 30" name="" value="0x1e"/>
        <value caption="Message matching filter is stored in Object 29" name="" value="0x1d"/>
        <value caption="Message matching filter is stored in Object 28" name="" value="0x1c"/>
        <value caption="Message matching filter is stored in Object 27" name="" value="0x1b"/>
        <value caption="Message matching filter is stored in Object 26" name="" value="0x1a"/>
        <value caption="Message matching filter is stored in Object 25" name="" value="0x19"/>
        <value caption="Message matching filter is stored in Object 24" name="" value="0x18"/>
        <value caption="Message matching filter is stored in Object 23" name="" value="0x17"/>
        <value caption="Message matching filter is stored in Object 22" name="" value="0x16"/>
        <value caption="Message matching filter is stored in Object 21" name="" value="0x15"/>
        <value caption="Message matching filter is stored in Object 20" name="" value="0x14"/>
        <value caption="Message matching filter is stored in Object 19" name="" value="0x13"/>
        <value caption="Message matching filter is stored in Object 18" name="" value="0x12"/>
        <value caption="Message matching filter is stored in Object 17" name="" value="0x11"/>
        <value caption="Message matching filter is stored in Object 16" name="" value="0x10"/>
        <value caption="Message matching filter is stored in Object 15" name="" value="0xf"/>
        <value caption="Message matching filter is stored in Object 14" name="" value="0xe"/>
        <value caption="Message matching filter is stored in Object 13" name="" value="0xd"/>
        <value caption="Message matching filter is stored in Object 12" name="" value="0xc"/>
        <value caption="Message matching filter is stored in Object 11" name="" value="0xb"/>
        <value caption="Message matching filter is stored in Object 10" name="" value="0xa"/>
        <value caption="Message matching filter is stored in Object 9" name="" value="0x9"/>
        <value caption="Message matching filter is stored in Object 8" name="" value="0x8"/>
        <value caption="Message matching filter is stored in Object 7" name="" value="0x7"/>
        <value caption="Message matching filter is stored in Object 6" name="" value="0x6"/>
        <value caption="Message matching filter is stored in Object 5" name="" value="0x5"/>
        <value caption="Message matching filter is stored in Object 4" name="" value="0x4"/>
        <value caption="Message matching filter is stored in Object 3" name="" value="0x3"/>
        <value caption="Message matching filter is stored in Object 2" name="" value="0x2"/>
        <value caption="Message matching filter is stored in Object 1" name="" value="0x1"/>
        <value caption="Reserved. Object 0 is the TX Queue and cannot receive messages." name="" value="0x0"/>
      </value-group>
      <value-group caption="Enable Filter n to Accept Messages bits" name="CFD2FLTCON1__FLTEN6">
        <value caption="Filter is enabled" name="" value="0x1"/>
        <value caption="Filter is disabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="Pointer to Object when Filter n hits bits" name="CFD2FLTCON1__F7BP">
        <value caption="Message matching filter is stored in Object 31" name="" value="0x1f"/>
        <value caption="Message matching filter is stored in Object 30" name="" value="0x1e"/>
        <value caption="Message matching filter is stored in Object 29" name="" value="0x1d"/>
        <value caption="Message matching filter is stored in Object 28" name="" value="0x1c"/>
        <value caption="Message matching filter is stored in Object 27" name="" value="0x1b"/>
        <value caption="Message matching filter is stored in Object 26" name="" value="0x1a"/>
        <value caption="Message matching filter is stored in Object 25" name="" value="0x19"/>
        <value caption="Message matching filter is stored in Object 24" name="" value="0x18"/>
        <value caption="Message matching filter is stored in Object 23" name="" value="0x17"/>
        <value caption="Message matching filter is stored in Object 22" name="" value="0x16"/>
        <value caption="Message matching filter is stored in Object 21" name="" value="0x15"/>
        <value caption="Message matching filter is stored in Object 20" name="" value="0x14"/>
        <value caption="Message matching filter is stored in Object 19" name="" value="0x13"/>
        <value caption="Message matching filter is stored in Object 18" name="" value="0x12"/>
        <value caption="Message matching filter is stored in Object 17" name="" value="0x11"/>
        <value caption="Message matching filter is stored in Object 16" name="" value="0x10"/>
        <value caption="Message matching filter is stored in Object 15" name="" value="0xf"/>
        <value caption="Message matching filter is stored in Object 14" name="" value="0xe"/>
        <value caption="Message matching filter is stored in Object 13" name="" value="0xd"/>
        <value caption="Message matching filter is stored in Object 12" name="" value="0xc"/>
        <value caption="Message matching filter is stored in Object 11" name="" value="0xb"/>
        <value caption="Message matching filter is stored in Object 10" name="" value="0xa"/>
        <value caption="Message matching filter is stored in Object 9" name="" value="0x9"/>
        <value caption="Message matching filter is stored in Object 8" name="" value="0x8"/>
        <value caption="Message matching filter is stored in Object 7" name="" value="0x7"/>
        <value caption="Message matching filter is stored in Object 6" name="" value="0x6"/>
        <value caption="Message matching filter is stored in Object 5" name="" value="0x5"/>
        <value caption="Message matching filter is stored in Object 4" name="" value="0x4"/>
        <value caption="Message matching filter is stored in Object 3" name="" value="0x3"/>
        <value caption="Message matching filter is stored in Object 2" name="" value="0x2"/>
        <value caption="Message matching filter is stored in Object 1" name="" value="0x1"/>
        <value caption="Reserved. Object 0 is the TX Queue and cannot receive messages." name="" value="0x0"/>
      </value-group>
