Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-W_DFP/1.8.326/atdf/PIC32MZ2051W104132.atdf
      <value-group caption="Pointer to Object when Filter n hits bits" name="CFD2FLTCON3__F14BP">
        <value caption="Message matching filter is stored in Object 31" name="" value="0x1f"/>
        <value caption="Message matching filter is stored in Object 30" name="" value="0x1e"/>
        <value caption="Message matching filter is stored in Object 29" name="" value="0x1d"/>
        <value caption="Message matching filter is stored in Object 28" name="" value="0x1c"/>
        <value caption="Message matching filter is stored in Object 27" name="" value="0x1b"/>
        <value caption="Message matching filter is stored in Object 26" name="" value="0x1a"/>
        <value caption="Message matching filter is stored in Object 25" name="" value="0x19"/>
        <value caption="Message matching filter is stored in Object 24" name="" value="0x18"/>
        <value caption="Message matching filter is stored in Object 23" name="" value="0x17"/>
        <value caption="Message matching filter is stored in Object 22" name="" value="0x16"/>
        <value caption="Message matching filter is stored in Object 21" name="" value="0x15"/>
        <value caption="Message matching filter is stored in Object 20" name="" value="0x14"/>
        <value caption="Message matching filter is stored in Object 19" name="" value="0x13"/>
        <value caption="Message matching filter is stored in Object 18" name="" value="0x12"/>
        <value caption="Message matching filter is stored in Object 17" name="" value="0x11"/>
        <value caption="Message matching filter is stored in Object 16" name="" value="0x10"/>
        <value caption="Message matching filter is stored in Object 15" name="" value="0xf"/>
        <value caption="Message matching filter is stored in Object 14" name="" value="0xe"/>
        <value caption="Message matching filter is stored in Object 13" name="" value="0xd"/>
        <value caption="Message matching filter is stored in Object 12" name="" value="0xc"/>
        <value caption="Message matching filter is stored in Object 11" name="" value="0xb"/>
        <value caption="Message matching filter is stored in Object 10" name="" value="0xa"/>
        <value caption="Message matching filter is stored in Object 9" name="" value="0x9"/>
        <value caption="Message matching filter is stored in Object 8" name="" value="0x8"/>
        <value caption="Message matching filter is stored in Object 7" name="" value="0x7"/>
        <value caption="Message matching filter is stored in Object 6" name="" value="0x6"/>
        <value caption="Message matching filter is stored in Object 5" name="" value="0x5"/>
        <value caption="Message matching filter is stored in Object 4" name="" value="0x4"/>
        <value caption="Message matching filter is stored in Object 3" name="" value="0x3"/>
        <value caption="Message matching filter is stored in Object 2" name="" value="0x2"/>
        <value caption="Message matching filter is stored in Object 1" name="" value="0x1"/>
        <value caption="Reserved. Object 0 is the TX Queue and cannot receive messages." name="" value="0x0"/>
      </value-group>
      <value-group caption="Enable Filter n to Accept Messages bits" name="CFD2FLTCON3__FLTEN14">
        <value caption="Filter is enabled" name="" value="0x1"/>
        <value caption="Filter is disabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="Pointer to Object when Filter n hits bits" name="CFD2FLTCON3__F15BP">
        <value caption="Message matching filter is stored in Object 31" name="" value="0x1f"/>
        <value caption="Message matching filter is stored in Object 30" name="" value="0x1e"/>
        <value caption="Message matching filter is stored in Object 29" name="" value="0x1d"/>
        <value caption="Message matching filter is stored in Object 28" name="" value="0x1c"/>
        <value caption="Message matching filter is stored in Object 27" name="" value="0x1b"/>
        <value caption="Message matching filter is stored in Object 26" name="" value="0x1a"/>
        <value caption="Message matching filter is stored in Object 25" name="" value="0x19"/>
        <value caption="Message matching filter is stored in Object 24" name="" value="0x18"/>
        <value caption="Message matching filter is stored in Object 23" name="" value="0x17"/>
        <value caption="Message matching filter is stored in Object 22" name="" value="0x16"/>
        <value caption="Message matching filter is stored in Object 21" name="" value="0x15"/>
        <value caption="Message matching filter is stored in Object 20" name="" value="0x14"/>
        <value caption="Message matching filter is stored in Object 19" name="" value="0x13"/>
        <value caption="Message matching filter is stored in Object 18" name="" value="0x12"/>
        <value caption="Message matching filter is stored in Object 17" name="" value="0x11"/>
        <value caption="Message matching filter is stored in Object 16" name="" value="0x10"/>
        <value caption="Message matching filter is stored in Object 15" name="" value="0xf"/>
        <value caption="Message matching filter is stored in Object 14" name="" value="0xe"/>
        <value caption="Message matching filter is stored in Object 13" name="" value="0xd"/>
        <value caption="Message matching filter is stored in Object 12" name="" value="0xc"/>
        <value caption="Message matching filter is stored in Object 11" name="" value="0xb"/>
        <value caption="Message matching filter is stored in Object 10" name="" value="0xa"/>
        <value caption="Message matching filter is stored in Object 9" name="" value="0x9"/>
        <value caption="Message matching filter is stored in Object 8" name="" value="0x8"/>
        <value caption="Message matching filter is stored in Object 7" name="" value="0x7"/>
        <value caption="Message matching filter is stored in Object 6" name="" value="0x6"/>
        <value caption="Message matching filter is stored in Object 5" name="" value="0x5"/>
        <value caption="Message matching filter is stored in Object 4" name="" value="0x4"/>
        <value caption="Message matching filter is stored in Object 3" name="" value="0x3"/>
        <value caption="Message matching filter is stored in Object 2" name="" value="0x2"/>
        <value caption="Message matching filter is stored in Object 1" name="" value="0x1"/>
        <value caption="Reserved. Object 0 is the TX Queue and cannot receive messages." name="" value="0x0"/>
      </value-group>
      <value-group caption="Enable Filter n to Accept Messages bits" name="CFD2FLTCON3__FLTEN15">
        <value caption="Filter is enabled" name="" value="0x1"/>
        <value caption="Filter is disabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="Standard Identifier Filter bit" name="CFD2FLTOBJ0__SID11">
        <value caption="Extended standard identifier to 12-bit" name="" value="0x1"/>
        <value caption="Do not use extended standard Identifier bits" name="" value="0x0"/>
      </value-group>
      <value-group caption="Extended Identifier Enable bit" name="CFD2FLTOBJ0__EXIDE">
        <value caption="(If MIDE is 1) Match only messages with extended identifier addresses" name="" value="0x1"/>
        <value caption="(If MIDE is 1) Match only messages with standard identifier addresses" name="" value="0x0"/>
      </value-group>
      <value-group caption="" name="CFD2MASK0__MSID11">
        <value caption="Enable extended standard identifier mask to 12 bits (MSID" name="" value="0x1"/>
        <value caption="Do not enable extended standard identifier mask (MSID)" name="" value="0x0"/>
      </value-group>
      <value-group caption="" name="CFD2MASK0__MIDE">
        <value caption="Match only message types (standard or extended address) that correspond to EXIDE bit in filter" name="" value="0x1"/>
        <value caption="Match either standard or extended address message if filters match (i.e." name="" value="0x0"/>
      </value-group>
