Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-W_DFP/1.8.326/atdf/PIC32MZ2051W104132.atdf
      <value-group caption="Identifier Receive Mode bit" name="CFD2MASK10__MIDE">
        <value caption="Match only message types (standard or extended address) that correspond to EXIDE bit in filter" name="" value="0x1"/>
        <value caption="Match either standard or extended address message if filters match (i.e." name="" value="0x0"/>
      </value-group>
      <value-group caption="Standard Identifier Filter bit" name="CFD2FLTOBJ11__SID11">
        <value caption="Extended standard identifier to 12-bit (i.e." name="" value="0x1"/>
        <value caption="Do not use extended standard Identifier bits" name="" value="0x0"/>
      </value-group>
      <value-group caption="Extended Identifier Enable bit" name="CFD2FLTOBJ11__EXIDE">
        <value caption="(If MIDE is 1) Match only messages with extended identifier addresses" name="" value="0x1"/>
        <value caption="(If MIDE is 1) Match only messages with standard identifier addresses" name="" value="0x0"/>
      </value-group>
      <value-group caption="Standard Identifier Mask bit" name="CFD2MASK11__MSID11">
        <value caption="Enable extended standard identifier mask to 12 bits (MSID" name="" value="0x1"/>
        <value caption="Do not enable extended standard identifier mask (MSID)" name="" value="0x0"/>
      </value-group>
      <value-group caption="Identifier Receive Mode bit" name="CFD2MASK11__MIDE">
        <value caption="Match only message types (standard or extended address) that correspond to EXIDE bit in filter" name="" value="0x1"/>
        <value caption="Match either standard or extended address message if filters match (i.e." name="" value="0x0"/>
      </value-group>
      <value-group caption="Standard Identifier Filter bit" name="CFD2FLTOBJ12__SID11">
        <value caption="Extended standard identifier to 12-bit (i.e." name="" value="0x1"/>
        <value caption="Do not use extended standard Identifier bits" name="" value="0x0"/>
      </value-group>
      <value-group caption="Extended Identifier Enable bit" name="CFD2FLTOBJ12__EXIDE">
        <value caption="(If MIDE is 1) Match only messages with extended identifier addresses" name="" value="0x1"/>
        <value caption="(If MIDE is 1) Match only messages with standard identifier addresses" name="" value="0x0"/>
      </value-group>
      <value-group caption="Standard Identifier Mask bit" name="CFD2MASK12__MSID11">
        <value caption="Enable extended standard identifier mask to 12 bits (MSID" name="" value="0x1"/>
        <value caption="Do not enable extended standard identifier mask (MSID)" name="" value="0x0"/>
      </value-group>
      <value-group caption="Identifier Receive Mode bit" name="CFD2MASK12__MIDE">
        <value caption="Match only message types (standard or extended address) that correspond to EXIDE bit in filter" name="" value="0x1"/>
        <value caption="Match either standard or extended address message if filters match (i.e." name="" value="0x0"/>
      </value-group>
      <value-group caption="Standard Identifier Filter bit" name="CFD2FLTOBJ13__SID11">
        <value caption="Extended standard identifier to 12-bit (i.e." name="" value="0x1"/>
        <value caption="Do not use extended standard Identifier bits" name="" value="0x0"/>
      </value-group>
      <value-group caption="Extended Identifier Enable bit" name="CFD2FLTOBJ13__EXIDE">
        <value caption="(If MIDE is 1) Match only messages with extended identifier addresses" name="" value="0x1"/>
        <value caption="(If MIDE is 1) Match only messages with standard identifier addresses" name="" value="0x0"/>
      </value-group>
      <value-group caption="Standard Identifier Mask bit" name="CFD2MASK13__MSID11">
        <value caption="Enable extended standard identifier mask to 12 bits (MSID" name="" value="0x1"/>
        <value caption="Do not enable extended standard identifier mask (MSID)" name="" value="0x0"/>
      </value-group>
      <value-group caption="Identifier Receive Mode bit" name="CFD2MASK13__MIDE">
        <value caption="Match only message types (standard or extended address) that correspond to EXIDE bit in filter" name="" value="0x1"/>
        <value caption="Match either standard or extended address message if filters match (i.e." name="" value="0x0"/>
      </value-group>
      <value-group caption="Standard Identifier Filter bit" name="CFD2FLTOBJ14__SID11">
        <value caption="Extended standard identifier to 12-bit (i.e." name="" value="0x1"/>
        <value caption="Do not use extended standard Identifier bits" name="" value="0x0"/>
      </value-group>
      <value-group caption="Extended Identifier Enable bit" name="CFD2FLTOBJ14__EXIDE">
        <value caption="(If MIDE is 1) Match only messages with extended identifier addresses" name="" value="0x1"/>
        <value caption="(If MIDE is 1) Match only messages with standard identifier addresses" name="" value="0x0"/>
      </value-group>
      <value-group caption="Standard Identifier Mask bit" name="CFD2MASK14__MSID11">
        <value caption="Enable extended standard identifier mask to 12 bits (MSID" name="" value="0x1"/>
        <value caption="Do not enable extended standard identifier mask (MSID)" name="" value="0x0"/>
      </value-group>
      <value-group caption="Identifier Receive Mode bit" name="CFD2MASK14__MIDE">
        <value caption="Match only message types (standard or extended address) that correspond to EXIDE bit in filter" name="" value="0x1"/>
        <value caption="Match either standard or extended address message if filters match (i.e." name="" value="0x0"/>
      </value-group>
      <value-group caption="Standard Identifier Filter bit" name="CFD2FLTOBJ15__SID11">
        <value caption="Extended standard identifier to 12-bit (i.e." name="" value="0x1"/>
        <value caption="Do not use extended standard Identifier bits" name="" value="0x0"/>
      </value-group>
      <value-group caption="Extended Identifier Enable bit" name="CFD2FLTOBJ15__EXIDE">
        <value caption="(If MIDE is 1) Match only messages with extended identifier addresses" name="" value="0x1"/>
        <value caption="(If MIDE is 1) Match only messages with standard identifier addresses" name="" value="0x0"/>
      </value-group>
      <value-group caption="Standard Identifier Mask bit" name="CFD2MASK15__MSID11">
        <value caption="Enable extended standard identifier mask to 12 bits (MSID" name="" value="0x1"/>
        <value caption="Do not enable extended standard identifier mask (MSID)" name="" value="0x0"/>
      </value-group>
      <value-group caption="Identifier Receive Mode bit" name="CFD2MASK15__MIDE">
        <value caption="Match only message types (standard or extended address) that correspond to EXIDE bit in filter" name="" value="0x1"/>
        <value caption="Match either standard or extended address message if filters match (i.e." name="" value="0x0"/>
      </value-group>
    </module>
