Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-W_DFP/1.8.326/atdf/PIC32MZ2051W104132.atdf
      <value-group caption="TDO control for 2 wire JTAG protocol" name="CFGCON0__TDOEN">
        <value caption="2-wire JTAG protocol uses TDO (Four phase (Full Duplex) Protocol)" name="TDO" value="0x1"/>
        <value caption="2-wire JTAG protocol does not use TDO (Two phase (Half Duplex) Protocol)" name="NO_TDO" value="0x0"/>
      </value-group>
      <value-group caption="Trace clock control bit" name="CFGCON0__TROEN">
        <value caption="Start Trace Clock and enable Trace Outputs (Trace Probe must be present)" name="ENABLE" value="0x1"/>
        <value caption="Stop Trace Clock and disable Trace Outputs" name="DISABLE" value="0x0"/>
      </value-group>
      <value-group caption="JTAG control bit" name="CFGCON0__JTAGEN">
        <value caption="JTAG Port Enabled" name="ENABLE" value="0x1"/>
        <value caption="JTAG Port Disabled" name="DISABLE" value="0x0"/>
      </value-group>
      <value-group caption="FC arbitration Priority to SRAM" name="CFGCON0__FCPRI">
        <value caption="FC gets High Priority access to SRAM1, SRAM2" name="SRAM" value="0x1"/>
        <value caption="FC uses Least Recently Serviced Arbitration (same as other initiators)" name="OTHER" value="0x0"/>
      </value-group>
      <value-group caption="DMAR and DMAW arbitration Priority to SRAM" name="CFGCON0__DMAPRI">
        <value caption="DMA gets High Priority access to SRAM1, SRAM2" name="SRAM" value="0x1"/>
        <value caption="DMA uses Least Recently Serviced Arbitration (same as other initiators)" name="OTHER" value="0x0"/>
      </value-group>
      <value-group caption="CPU arbitration Priority to SRAM when servicing an Interrupt" name="CFGCON0__EXLPRI">
        <value caption="CPU gets High Priority access to SRAM1, SRAM2" name="SRAM" value="0x1"/>
        <value caption="CPU uses Least Recently Serviced Arbitration (same as other initiators)" name="OTHER" value="0x0"/>
      </value-group>
      <value-group caption="USB Suspend Sleep Enable" name="CFGCON0__USBSSEN">
        <value caption="USB FREF clock is shut down when suspend mode is active." name="OFF" value="0x1"/>
        <value caption="USB FREF clock continues to run when suspend mode is active." name="ON" value="0x0"/>
      </value-group>
      <value-group caption="PMU Controller Register LOCK" name="CFGCON0__PMULOCK">
        <value caption="PMU SFR bits are locked and cannot be modified" name="LOCKED" value="0x1"/>
        <value caption="PMU SFR bits are not locked and can be modified" name="UNLOCKED" value="0x0"/>
      </value-group>
      <value-group caption="Permission Group LOCK" name="CFGCON0__PGLOCK">
        <value caption="CFGPG SFR bits are locked and cannot be modified" name="LOCKED" value="0x1"/>
        <value caption="CFGPG SFR bits are not locked and can be modified" name="UNLOCKED" value="0x0"/>
      </value-group>
      <value-group caption="Peripheral Module Disable (PMD) LOCK" name="CFGCON0__PMDLOCK">
        <value caption="PMDx SFR bits are locked and cannot be modified" name="LOCKED" value="0x1"/>
        <value caption="PMDx SFR bits are not locked and can be modified" name="UNLOCKED" value="0x0"/>
      </value-group>
      <value-group caption="IO LOCK" name="CFGCON0__IOLOCK">
        <value caption="IO Remap SFR bits are locked and cannot be modified" name="LOCKED" value="0x1"/>
        <value caption="IO Remap SFR are not locked and can be modified" name="UNLOCKED" value="0x0"/>
      </value-group>
      <value-group caption="Configuration Register Lock" name="CFGCON0__CFGLOCK">
        <value caption="All NVR memory self-writes, Boot Configuration (BCFG0) and System Configuration registers (CFG* and USER_ID) are locked and can not be written - CFGLOCK value can not be changed" name="ALL_LOCKED" value="0x3"/>
        <value caption="All NVR memory self-writes, Boot Configuration (BCFG0) and System Configuration registers (CFG* and USER_ID) are locked and can not be written - CFGLOCK value can be changed." name="LOCKED" value="0x2"/>
        <value caption="All NVR memory self-writes, Boot Configuration (BCFG0) and System Configuration registers (CFG* and USER_ID) are not locked and can be written - CFGLOCK value can be changed" name="UNLOCKED" value="0x0"/>
      </value-group>
      <value-group caption="OCMP Alternate Clock Selection" name="CFGCON0__OC_ACLK">
        <value caption="OCMP Modules use an alternative TMR pair as their timebase clock" name="OTHER" value="0x1"/>
        <value caption="All OCMP Modules use TMR2/TMR3 as their timebase clock" name="TMR" value="0x0"/>
      </value-group>
      <value-group caption="ICAP Alternate Clock Selection" name="CFGCON0__IC_ACLK">
        <value caption="ICAP Modules use an alternative TMR pair as their timebase clock" name="OTHER" value="0x1"/>
        <value caption="All ICAP Modules use TMR2/TMR3 as their timebase clock" name="TMR" value="0x0"/>
      </value-group>
      <value-group caption="CAN-FD Back-up Clock Divider" name="CFGCON0__CANFDDIV">
        <value caption="Divide-by 2" name="DIV2" value="0x0"/>
        <value caption="Divide-by 4" name="DIV4" value="0x2"/>
        <value caption="Divide-by 8" name="DIV8" value="0x3"/>
      </value-group>
      <value-group caption="PCHE I/D Cacheable Mode" name="CFGCON0__PCM">
        <value caption="Always enabled from outside. Can be further enabled/disabled by PCHE SFR registers." name="OUTSIDE" value="0x1"/>
        <value caption="The cache-ability is controlled by the MIPS CPU via HPROT[3]. This feature is not available on all the MIPS cores." name="HPROT" value="0x0"/>
      </value-group>
      <value-group caption="UPLL HW Control Mode for PWDN and RESET" name="CFGCON0__UPLLHWMD">
        <value caption="PWDN and RESET are generated by HW" name="HW" value="0x1"/>
        <value caption="PWDN and RESET are generated by SW using corresponding PLLCON register bits" name="SW" value="0x0"/>
      </value-group>
      <value-group caption="SPLL HW Control Mode for PWDN and RESET" name="CFGCON0__SPLLHWMD">
        <value caption="PWDN and RESET are generated by HW" name="HW" value="0x1"/>
        <value caption="PWDN and RESET are generated by SW using corresponding PLLCON register bits" name="SW" value="0x0"/>
      </value-group>
      <value-group caption="BTPLL HW Control Mode for PWDN and RESET" name="CFGCON0__BTPLLHWMD">
        <value caption="PWDN and RESET are generated by HW" name="HW" value="0x1"/>
        <value caption="PWDN and RESET are generated by SW using corresponding PLLCON register bits" name="SW" value="0x0"/>
      </value-group>
      <value-group caption="EWPLL HW Control Mode for PWDN and RESET" name="CFGCON0__ETHPLLHWMD">
        <value caption="PWDN and RESET are generated by HW" name="HW" value="0x1"/>
        <value caption="PWDN and RESET are generated by SW using corresponding PLLCON register bits" name="SW" value="0x0"/>
      </value-group>
      <value-group caption="Flash ECC Control" name="CFGCON0__FECCCON">
        <value caption="ECC and Dynamically ECC Disabled" name="DISABLED" value="0x2"/>
        <value caption="Dynamically ECC Enabled" name="DYNAMIC" value="0x1"/>
        <value caption="ECC Enabled (NVMOP = Word Programming disabled)" name="ECC" value="0x0"/>
      </value-group>
      <value-group caption="Ethernet Tx SOF enabled for CTR measurements" name="CFGCON0__ETHTPSF">
        <value caption="TPSF is enabled in CTR measurement" name="TPSF" value="0x1"/>
        <value caption="RPSF is enabled in CTR measurement" name="RPSF" value="0x0"/>
      </value-group>
      <value-group caption="External Programming Clock enable" name="CFGCON0__EPGMCLK">
        <value caption="In ICSP (TMOD0) mode, enable the FRC clock to be driven by the TSTFRC Pin Function" name="TSTFRC" value="0x1"/>
        <value caption="In ICSP (TMOD0) mode, the FRC clock is always driven by the FRC oscillator" name="FRC" value="0x0"/>
      </value-group>
      <value-group caption="Background Debugger Access Selection" name="CFGCON1__DEBUG">
        <value caption="4-wire JTAG I/F Enabled - EMUC/EMUD Disabled - ICD Module Disabled" name="JTAGEN_EMUDIS_ICDDIS" value="0x3"/>
        <value caption="4-wire JTAG I/F Enabled - EMUC/EMUD Disabled - ICD Module Enabled" name="JTAGEN_EMUDIS_ICDEN" value="0x2"/>
        <value caption="EMUC/EMUD Enabled - 4-wire JTAG I/F Disabled - ICD Module Disabled" name="JTAGDIS_EMUEN_ICDDIS" value="0x1"/>
        <value caption="EMUC/EMUD Enabled - 4-wire JTAG I/F Disabled - ICD Module Enabled" name="JTAGDIS_EMUEN_ICDEN" value="0x0"/>
      </value-group>
      <value-group caption="EMUC/EMUD Communication Channel Select" name="CFGCON1__ICESEL">
        <value caption="ICE EMUC1/EMUD1 pins are shared with PGC1/PGD1" name="EMUx1_PGx1" value="0x3"/>
        <value caption="ICE EMUC2/EMUD2 pins are shared with PGC2/PGD2" name="EMUx2_PGx2" value="0x2"/>
        <value caption="ICE EMUC3/EMUD3 pins are shared with PGC3/PGD3 (Not used on this device)" name="EMUx3_PGx3" value="0x1"/>
        <value caption="ICE EMUC4/EMUD4 pins are shared with PGC4/PGD4" name="EMUx4_PGx4" value="0x0"/>
      </value-group>
      <value-group caption="Trace Enable" name="CFGCON1__TRCEN">
        <value caption="Trace features in the CPU are enabled" name="ENABLED" value="0x1"/>
        <value caption="Trace features in the CPU are disabled" name="DISABLED" value="0x0"/>
      </value-group>
      <value-group caption="Ethernet1 MII Enable" name="CFGCON1__FMIIEN">
        <value caption="18-pin 25MHz Media Independent Interface is enabled" name="18PIN" value="0x1"/>
        <value caption="10-pin 50MHz Reduced Media Independent Interface is enabled" name="10PIN" value="0x0"/>
      </value-group>
