Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-W_DFP/1.8.326/atdf/PIC32MZ2051W104132.atdf
      <value-group caption="ADC Permission Group" name="CFGPG__ADCPG">
        <value caption="Read Access if RDPER[3] is 1- Write Access if WRPER[3] is 1 (Perm. Grp. 3)" name="GROUP3" value="0x3"/>
        <value caption="Read Access if RDPER[2] is 1- Write Access if WRPER[2] is 1 (Perm. Grp. 2)" name="GROUP2" value="0x2"/>
        <value caption="Read Access if RDPER[1] is 1- Write Access if WRPER[1] is 1 (Perm. Grp. 1)" name="GROUP1" value="0x1"/>
        <value caption="Read Access if RDPER[0] is 1- Write Access if WRPER[0] is 1 (Perm. Grp. 0)" name="GROUP0" value="0x0"/>
      </value-group>
      <value-group caption="CAN1 Permission Group" name="CFGPG__CAN1PG">
        <value caption="Read Access if RDPER[3] is 1- Write Access if WRPER[3] is 1 (Perm. Grp. 3)" name="GROUP3" value="0x3"/>
        <value caption="Read Access if RDPER[2] is 1- Write Access if WRPER[2] is 1 (Perm. Grp. 2)" name="GROUP2" value="0x2"/>
        <value caption="Read Access if RDPER[1] is 1- Write Access if WRPER[1] is 1 (Perm. Grp. 1)" name="GROUP1" value="0x1"/>
        <value caption="Read Access if RDPER[0] is 1- Write Access if WRPER[0] is 1 (Perm. Grp. 0)" name="GROUP0" value="0x0"/>
      </value-group>
      <value-group caption="CAN2 Permission Group" name="CFGPG__CAN2PG">
        <value caption="Read Access if RDPER[3] is 1- Write Access if WRPER[3] is 1 (Perm. Grp. 3)" name="GROUP3" value="0x3"/>
        <value caption="Read Access if RDPER[2] is 1- Write Access if WRPER[2] is 1 (Perm. Grp. 2)" name="GROUP2" value="0x2"/>
        <value caption="Read Access if RDPER[1] is 1- Write Access if WRPER[1] is 1 (Perm. Grp. 1)" name="GROUP1" value="0x1"/>
        <value caption="Read Access if RDPER[0] is 1- Write Access if WRPER[0] is 1 (Perm. Grp. 0)" name="GROUP0" value="0x0"/>
      </value-group>
      <value-group caption="CRY1 Permission Group" name="CFGPG__CRY1PG">
        <value caption="Read Access if RDPER[3] is 1- Write Access if WRPER[3] is 1 (Perm. Grp. 3)" name="GROUP3" value="0x3"/>
        <value caption="Read Access if RDPER[2] is 1- Write Access if WRPER[2] is 1 (Perm. Grp. 2)" name="GROUP2" value="0x2"/>
        <value caption="Read Access if RDPER[1] is 1- Write Access if WRPER[1] is 1 (Perm. Grp. 1)" name="GROUP1" value="0x1"/>
        <value caption="Read Access if RDPER[0] is 1- Write Access if WRPER[0] is 1 (Perm. Grp. 0)" name="GROUP0" value="0x0"/>
      </value-group>
      <value-group caption="ETH Permission Group" name="CFGPG__ETHPG">
        <value caption="Read Access if RDPER[3] is 1- Write Access if WRPER[3] is 1 (Perm. Grp. 3)" name="GROUP3" value="0x3"/>
        <value caption="Read Access if RDPER[2] is 1- Write Access if WRPER[2] is 1 (Perm. Grp. 2)" name="GROUP2" value="0x2"/>
        <value caption="Read Access if RDPER[1] is 1- Write Access if WRPER[1] is 1 (Perm. Grp. 1)" name="GROUP1" value="0x1"/>
        <value caption="Read Access if RDPER[0] is 1- Write Access if WRPER[0] is 1 (Perm. Grp. 0)" name="GROUP0" value="0x0"/>
      </value-group>
      <value-group caption="SQI Permission Group- drive directly the inputs cfg_sqi_pg[1-0] to the SSX" name="CFGPG__SQIPG">
        <value caption="Read Access if RDPER[3] is 1- Write Access if WRPER[3] is 1 (Perm. Grp. 3)" name="GROUP3" value="0x3"/>
        <value caption="Read Access if RDPER[2] is 1- Write Access if WRPER[2] is 1 (Perm. Grp. 2)" name="GROUP2" value="0x2"/>
        <value caption="Read Access if RDPER[1] is 1- Write Access if WRPER[1] is 1 (Perm. Grp. 1)" name="GROUP1" value="0x1"/>
        <value caption="Read Access if RDPER[0] is 1- Write Access if WRPER[0] is 1 (Perm. Grp. 0)" name="GROUP0" value="0x0"/>
      </value-group>
      <value-group caption="USB Permission Group- drive directly the inputs cfg_usb_pg[1-0] to the SSX" name="CFGPG__USBPG">
        <value caption="Read Access if RDPER[3] is 1- Write Access if WRPER[3] is 1 (Perm. Grp. 3)" name="GROUP3" value="0x3"/>
        <value caption="Read Access if RDPER[2] is 1- Write Access if WRPER[2] is 1 (Perm. Grp. 2)" name="GROUP2" value="0x2"/>
        <value caption="Read Access if RDPER[1] is 1- Write Access if WRPER[1] is 1 (Perm. Grp. 1)" name="GROUP1" value="0x1"/>
        <value caption="Read Access if RDPER[0] is 1- Write Access if WRPER[0] is 1 (Perm. Grp. 0)" name="GROUP0" value="0x0"/>
      </value-group>
      <value-group caption="ADC SAR Core 0 Module Disable bit" name="PMD1__ADCSAR0MD">
        <value caption="Disabled - When disabled the corresponding ADC SAR will be disabled." name="" value="0x1"/>
        <value caption="Enabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="Shared ADC SAR Core Module Disable bit" name="PMD1__ADCSARSHRMD">
        <value caption="Disabled - When disabled the corresponding ADC SAR SHARED will be disabled." name="" value="0x1"/>
        <value caption="Enabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="ADC Controller Module Disable" name="PMD1__ADC1MD">
        <value caption="Disabled" name="" value="0x1"/>
        <value caption="Enabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="PTG Module Disable" name="PMD1__PTGMD">
        <value caption="Disabled" name="" value="0x1"/>
        <value caption="Enabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="CVD Module Disable" name="PMD1__CVD1MD">
        <value caption="Disabled" name="" value="0x1"/>
        <value caption="Enabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="RTCC Module Disable (Unused at top level- part of XDS controller SFR)" name="PMD1__RTCC1MD">
        <value caption="Disabled" name="" value="0x1"/>
        <value caption="Enabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="DMA Controller Module Disable" name="PMD1__DMA1MD">
        <value caption="Disabled" name="" value="0x1"/>
        <value caption="Enabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="BA414E Module Disable" name="PMD1__BA414MD">
        <value caption="Disabled" name="" value="0x1"/>
        <value caption="Enabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="CRYPTO1 Module Disable" name="PMD1__CRYPT1MD">
        <value caption="Disabled" name="" value="0x1"/>
        <value caption="Enabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="RNG1 Module Disable" name="PMD1__RNG1MD">
        <value caption="Disabled" name="" value="0x1"/>
        <value caption="Enabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="SQI Module Disable" name="PMD1__SQI1MD">
        <value caption="Disabled" name="" value="0x1"/>
        <value caption="Enabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="Input Capture 1 Module Disable" name="PMD2__IC1MD">
        <value caption="Disabled" name="" value="0x1"/>
        <value caption="Enabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="Input Capture 2 Module Disable" name="PMD2__IC2MD">
        <value caption="Disabled" name="" value="0x1"/>
        <value caption="Enabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="Input Capture 3 Module Disable" name="PMD2__IC3MD">
        <value caption="Disabled" name="" value="0x1"/>
        <value caption="Enabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="Input Capture 4 Module Disable" name="PMD2__IC4MD">
        <value caption="Disabled" name="" value="0x1"/>
        <value caption="Enabled" name="" value="0x0"/>
      </value-group>
