Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-W_DFP/1.8.326/atdf/PIC32MZ2051W104132.atdf
      <value-group caption="Output Compare 1 Module Disable bit" name="PMD2__OC1MD">
        <value caption="Disabled" name="" value="0x1"/>
        <value caption="Enabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="Output Compare 2 Module Disable bit" name="PMD2__OC2MD">
        <value caption="Disabled" name="" value="0x1"/>
        <value caption="Enabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="Output Compare 3 Module Disable bit" name="PMD2__OC3MD">
        <value caption="Disabled" name="" value="0x1"/>
        <value caption="Enabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="Output Compare 4 Module Disable bit" name="PMD2__OC4MD">
        <value caption="Disabled" name="" value="0x1"/>
        <value caption="Enabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="Timer 1 Module Disable" name="PMD2__T1MD">
        <value caption="Disabled" name="" value="0x1"/>
        <value caption="Enabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="Timer 2 Module Disable" name="PMD2__T2MD">
        <value caption="Disabled" name="" value="0x1"/>
        <value caption="Enabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="Timer 3 Module Disable" name="PMD2__T3MD">
        <value caption="Disabled" name="" value="0x1"/>
        <value caption="Enabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="Timer 4 Module Disable" name="PMD2__T4MD">
        <value caption="Disabled" name="" value="0x1"/>
        <value caption="Enabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="Timer 5 Module Disable" name="PMD2__T5MD">
        <value caption="Disabled" name="" value="0x1"/>
        <value caption="Enabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="Timer 6 Module Disable" name="PMD2__T6MD">
        <value caption="Disabled" name="" value="0x1"/>
        <value caption="Enabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="Timer 7 Module Disable" name="PMD2__T7MD">
        <value caption="Disabled" name="" value="0x1"/>
        <value caption="Enabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="Reference (Clock) Out 1 Module Disable" name="PMD2__REFO1MD">
        <value caption="Disabled" name="" value="0x1"/>
        <value caption="Enabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="Reference (Clock) Out 2 Module Disable" name="PMD2__REFO2MD">
        <value caption="Disabled" name="" value="0x1"/>
        <value caption="Enabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="Reference (Clock) Out 3 Module Disable" name="PMD2__REFO3MD">
        <value caption="Disabled" name="" value="0x1"/>
        <value caption="Enabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="Reference (Clock) Out 4 Module Disable" name="PMD2__REFO4MD">
        <value caption="Disabled" name="" value="0x1"/>
        <value caption="Enabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="UART Module Disable" name="PMD3__U1MD">
        <value caption="Disabled" name="" value="0x1"/>
        <value caption="Enabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="UART Module Disable" name="PMD3__U2MD">
        <value caption="Disabled" name="" value="0x1"/>
        <value caption="Enabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="UART Module Disable" name="PMD3__U3MD">
        <value caption="Disabled" name="" value="0x1"/>
        <value caption="Enabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="Ethernet Module Disable" name="PMD3__ETH1MD">
        <value caption="Disabled" name="" value="0x1"/>
        <value caption="Enabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="SPI 1 Module Disable" name="PMD3__SPI1MD">
        <value caption="Disabled" name="" value="0x1"/>
        <value caption="Enabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="SPI 2 Module Disable" name="PMD3__SPI2MD">
        <value caption="Disabled" name="" value="0x1"/>
        <value caption="Enabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="WiFi Module Disable" name="PMD3__W24GMD">
        <value caption="Disabled" name="" value="0x1"/>
        <value caption="Enabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="I2C 1 Module Disable" name="PMD3__I2C1MD">
        <value caption="Disabled" name="" value="0x1"/>
        <value caption="Enabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="I2C 2 Module Disable" name="PMD3__I2C2MD">
        <value caption="Disabled" name="" value="0x1"/>
        <value caption="Enabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="USB Module Disable bit" name="PMD3__USB1MD">
        <value caption="Disabled" name="" value="0x1"/>
        <value caption="Enabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="CAN Module Disable bit" name="PMD3__CAN1MD">
        <value caption="Disabled" name="" value="0x1"/>
        <value caption="Enabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="CAN Module Disable bit" name="PMD3__CAN2MD">
        <value caption="Disabled" name="" value="0x1"/>
        <value caption="Enabled" name="" value="0x0"/>
      </value-group>
    </module>
    <module caption="" id="03100" name="CRU" version="3">
      <register-group name="CRU">
        <register caption="CRU OSCILLATOR CONTROL REGISTER" initval="0x000100" name="OSCCON" offset="0x0" rw="RW" size="4">
          <bitfield caption="Oscillator Switch Enable bit" mask="0x00000001" name="OSWEN" values="OSCCON__OSWEN"/>
          <bitfield caption="32 kHz Secondary (LP) Oscillator Enable bit" mask="0x00000002" name="SOSCEN" values="OSCCON__SOSCEN"/>
          <bitfield caption="USB FRC Clock Enable bit" mask="0x00000004" name="UFRCEN" values="OSCCON__UFRCEN"/>
          <bitfield caption="Clock Fail Detect bit (Read / writable / Clearable by application)" mask="0x00000008" name="CF" values="OSCCON__CF"/>
          <bitfield caption="Enable SLEEP Mode bit" mask="0x00000010" name="SLPEN" values="OSCCON__SLPEN"/>
          <bitfield caption="Clock Lock Enabled bit" mask="0x00000080" name="CLKLOCK" values="OSCCON__CLKLOCK"/>
          <bitfield caption="New Oscillator Selection bits" mask="0x00000F00" name="NOSC" values="OSCCON__NOSC"/>
          <bitfield caption="Current Oscillator Selection bits (Read-only)" mask="0x0000F000" name="COSC" values="OSCCON__COSC"/>
          <bitfield caption="2-Speed startup enabled in Sleep mode bit" mask="0x00200000" name="WAKE2SPD" values="OSCCON__WAKE2SPD"/>
          <bitfield caption="Enable Dream Mode bit" mask="0x00800000" name="DRMEN" values="OSCCON__DRMEN"/>
          <bitfield caption="Fast RC Clock Divider bits" mask="0x07000000" name="FRCDIV" values="OSCCON__FRCDIV"/>
        </register>
        <register caption="CRU OSCILLATOR TRIMMING REGISTER" initval="0x0" name="OSCTUN" offset="0x10" rw="RW" size="4">
          <bitfield caption="Internal Fast RC (FRC) Oscillator Tuning bits" mask="0x0000003F" name="TUN" values="OSCTUN__TUN"/>
        </register>
        <register caption="SPLL CONTROL REGISTER" initval="0x1496061" name="SPLLCON" offset="0x20" rw="RW" size="4">
          <bitfield caption="PLL Bandwidth Select" mask="0x00000007" name="SPLLBSWSEL"/>
          <bitfield caption="PLL Power Down Register bit" mask="0x00000008" name="SPLLPWDN" values="SPLLCON__SPLLPWDN"/>
          <bitfield caption="First Post Divide Value, 1 to 63" mask="0x000003F0" name="SPLLPOSTDIV1"/>
          <bitfield caption="System PLL Force Lock" mask="0x00000400" name="SPLLFLOCK" values="SPLLCON__SPLLFLOCK"/>
          <bitfield caption="System PLL Reset" mask="0x00000800" name="SPLLRST" values="SPLLCON__SPLLRST"/>
          <bitfield caption="PLL feedback divider, 16 to 1023" mask="0x003FF000" name="SPLLFBDIV"/>
          <bitfield caption="Reference Frequency Divide, 1 to 63" mask="0x0FC00000" name="SPLLREFDIV"/>
          <bitfield caption="System PLL Lock Status bit (Read-only)" mask="0x20000000" name="SLOCK" values="SPLLCON__SLOCK"/>
          <bitfield caption="Source Input Clock Selection bit" mask="0x40000000" name="SPLLICLK" values="SPLLCON__SPLLICLK"/>
          <bitfield caption="SPLL Bypass" mask="0x80000000" name="SPLL_BYP" values="SPLLCON__SPLL_BYP"/>
        </register>
        <register caption="UPLL CONTROL REGISTER" initval="0x404180A5" name="UPLLCON" offset="0x30" rw="RW" size="4">
          <bitfield caption="USB PLL Bandwidth Select" mask="0x00000007" name="UPLLBSWSEL"/>
          <bitfield caption="PLL Power Down Register bit" mask="0x00000008" name="UPLLPWDN" values="UPLLCON__UPLLPWDN"/>
          <bitfield caption="First Post Divide Value, 1 to 63" mask="0x000003F0" name="UPLLPOSTDIV1"/>
          <bitfield caption="USB PLL Force Lock" mask="0x00000400" name="UPLLFLOCK" values="UPLLCON__UPLLFLOCK"/>
          <bitfield caption="USB PLL Reset" mask="0x00000800" name="UPLLRST" values="UPLLCON__UPLLRST"/>
          <bitfield caption="PLL feedback divider, 16 to 1023" mask="0x003FF000" name="UPLLFBDIV"/>
          <bitfield caption="Reference Frequency Divide. 1 to 63" mask="0x0FC00000" name="UPLLREFDIV"/>
          <bitfield caption="USB PLL Lock Status bit (Read-only)" mask="0x20000000" name="ULOCK" values="UPLLCON__ULOCK"/>
          <bitfield caption="UPLL Bypass" mask="0x80000000" name="UPLL_BYP" values="UPLLCON__UPLL_BYP"/>
        </register>
        <register caption="BTPLL CONTROL REGISTER" initval="0x152562E0" name="BTPLLCON" offset="0x40" rw="RW" size="4">
          <bitfield caption="PLL Bandwidth Select" mask="0x00000007" name="BTPLLBSWSEL"/>
          <bitfield caption="PLL Power Down Register bit" mask="0x00000008" name="BTPLLPWDN" values="BTPLLCON__BTPLLPWDN"/>
          <bitfield caption="First Post Divide Value. 1 to 63" mask="0x000003F0" name="BTPLLPOSTDIV1"/>
          <bitfield caption="BT PLL Force Lock" mask="0x00000400" name="BTPLLFLOCK" values="BTPLLCON__BTPLLFLOCK"/>
          <bitfield caption="BT PLL Reset" mask="0x00000800" name="BTPLLRST" values="BTPLLCON__BTPLLRST"/>
          <bitfield caption="PLL feedback divider" mask="0x003FF000" name="BTPLLFBDIV"/>
          <bitfield caption="Reference Frequency Divide" mask="0x0FC00000" name="BTPLLREFDIV"/>
          <bitfield caption="BT Clock Out pin Enable Bit" mask="0x10000000" name="BTCLKOUTEN" values="BTPLLCON__BTCLKOUTEN"/>
          <bitfield caption="BT PLL Lock Status bit (Read-only)" mask="0x20000000" name="BTLOCK" values="BTPLLCON__BTLOCK"/>
          <bitfield caption="Source Input Clock Selection bit" mask="0x40000000" name="BTPLLCLK" values="BTPLLCON__BTPLLCLK"/>
          <bitfield caption="BTPLL Bypass" mask="0x80000000" name="BTPLL_BYP" values="BTPLLCON__BTPLL_BYP"/>
        </register>
