Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-W_DFP/1.8.326/atdf/PIC32MZ2051W104132.atdf
        <register caption="EWPLL CONTROL REGISTER" initval="0x15320206" name="EWPLLCON" offset="0x50" rw="RW" size="4">
          <bitfield caption="PLL Bandwidth Select" mask="0x00000007" name="EWPLLBSWSEL"/>
          <bitfield caption="PLL Power Down Register bit" mask="0x00000008" name="EWPLLPWDN" values="EWPLLCON__EWPLLPWDN"/>
          <bitfield caption="First Post Divide Value" mask="0x000003F0" name="EWPLLPOSTDIV1"/>
          <bitfield caption="EW PLL Force Lock" mask="0x00000400" name="EWPLLFLOCK" values="EWPLLCON__EWPLLFLOCK"/>
          <bitfield caption="EW PLL Reset" mask="0x00000800" name="EWPLLRST" values="EWPLLCON__EWPLLRST"/>
          <bitfield caption="PLL feedback divider" mask="0x003FF000" name="EWPLLFBDIV"/>
          <bitfield caption="Reference Frequency Divide" mask="0x0FC00000" name="EWPLLREFDIV"/>
          <bitfield caption="Ethernet Clock Out pin Enable Bit" mask="0x10000000" name="ETHCLKOUTEN" values="EWPLLCON__ETHCLKOUTEN"/>
          <bitfield caption="EW PLL Lock Status bit (Read-only)" mask="0x20000000" name="EWLOCK" values="EWPLLCON__EWLOCK"/>
          <bitfield caption="Source Input Clock Selection bit" mask="0x40000000" name="EWPLLICLK" values="EWPLLCON__EWPLLICLK"/>
          <bitfield caption="EWPLL Bypass" mask="0x80000000" name="EWPLL_BYP" values="EWPLLCON__EWPLL_BYP"/>
        </register>
        <register caption="REFERENCE OSCILLATOR 1 CONTROL REGISTER" initval="0x0" name="REFO1CON" offset="0xa0" rw="RW" size="4">
          <bitfield caption="Reference Clock Source Select bits" mask="0x0000000F" name="ROSEL" values="REFO1CON__ROSEL"/>
          <bitfield caption="Reference Clock Request Status bit" mask="0x00000100" name="ACTIVE" values="REFO1CON__ACTIVE"/>
          <bitfield caption="Clock RODIV/ROTRIM switch enabled." mask="0x00000200" name="DIVSWEN" values="REFO1CON__DIVSWEN"/>
          <bitfield caption="Reference Oscillator Run in Sleep bit" mask="0x00000800" name="RSLP" values="REFO1CON__RSLP"/>
          <bitfield caption="Reference Clock Output Enable bit" mask="0x00001000" name="OE" values="REFO1CON__OE"/>
          <bitfield caption="Peripheral Stop in Idle Mode bit" mask="0x00002000" name="SIDL" values="REFO1CON__SIDL"/>
          <bitfield caption="Output Enable bit" mask="0x00008000" name="ON" values="REFO1CON__ON"/>
          <bitfield caption="Reference Clock Divider bits" mask="0x7FFF0000" name="RODIV" values="REFO1CON__RODIV"/>
        </register>
        <register caption="REFERENCE OSCILLATOR 1 TRIM REGISTER" initval="0x0" name="REFO1TRIM" offset="0xb0" rw="RW" size="4">
          <bitfield caption="Trim bits - Provides fractional additive to RODIV value for 1/2 period of REFO1 clock" mask="0xFF800000" name="ROTRIM" values="REFO1TRIM__ROTRIM"/>
        </register>
        <register caption="REFERENCE OSCILLATOR 2 CONTROL REGISTER" initval="0x0" name="REFO2CON" offset="0xc0" rw="RW" size="4">
          <bitfield caption="Reference Clock Source Select bits" mask="0x0000000F" name="ROSEL" values="REFO2CON__ROSEL"/>
          <bitfield caption="Reference Clock Request Status bit" mask="0x00000100" name="ACTIVE" values="REFO2CON__ACTIVE"/>
          <bitfield caption="Clock RODIV/ROTRIM switch enabled." mask="0x00000200" name="DIVSWEN" values="REFO2CON__DIVSWEN"/>
          <bitfield caption="Reference Oscillator Run in Sleep bit" mask="0x00000800" name="RSLP" values="REFO2CON__RSLP"/>
          <bitfield caption="Reference Clock Output Enable bit" mask="0x00001000" name="OE" values="REFO2CON__OE"/>
          <bitfield caption="Peripheral Stop in Idle Mode bit" mask="0x00002000" name="SIDL" values="REFO2CON__SIDL"/>
          <bitfield caption="Output Enable bit" mask="0x00008000" name="ON" values="REFO2CON__ON"/>
          <bitfield caption="Reference Clock Divider bits" mask="0x7FFF0000" name="RODIV" values="REFO2CON__RODIV"/>
        </register>
        <register caption="REFERENCE OSCILLATOR 2 TRIM REGISTER" initval="0x0" name="REFO2TRIM" offset="0xd0" rw="RW" size="4">
          <bitfield caption="Trim bits - Provides fractional additive to RODIV value for 1/2 period of REFO1 clock" mask="0xFF800000" name="ROTRIM" values="REFO2TRIM__ROTRIM"/>
        </register>
        <register caption="REFERENCE OSCILLATOR 3 CONTROL REGISTER" initval="0x0" name="REFO3CON" offset="0xe0" rw="RW" size="4">
          <bitfield caption="Reference Clock Source Select bits" mask="0x0000000F" name="ROSEL" values="REFO3CON__ROSEL"/>
          <bitfield caption="Reference Clock Request Status bit" mask="0x00000100" name="ACTIVE" values="REFO3CON__ACTIVE"/>
          <bitfield caption="Clock RODIV/ROTRIM switch enabled." mask="0x00000200" name="DIVSWEN" values="REFO3CON__DIVSWEN"/>
          <bitfield caption="Reference Oscillator Run in Sleep bit" mask="0x00000800" name="RSLP" values="REFO3CON__RSLP"/>
          <bitfield caption="Reference Clock Output Enable bit" mask="0x00001000" name="OE" values="REFO3CON__OE"/>
          <bitfield caption="Peripheral Stop in Idle Mode bit" mask="0x00002000" name="SIDL" values="REFO3CON__SIDL"/>
          <bitfield caption="Output Enable bit" mask="0x00008000" name="ON" values="REFO3CON__ON"/>
          <bitfield caption="Reference Clock Divider bits" mask="0x7FFF0000" name="RODIV" values="REFO3CON__RODIV"/>
        </register>
        <register caption="REFERENCE OSCILLATOR 3 TRIM REGISTER" initval="0x0" name="REFO3TRIM" offset="0xf0" rw="RW" size="4">
          <bitfield caption="Trim bits - Provides fractional additive to RODIV value for 1/2 period of REFO1 clock" mask="0xFF800000" name="ROTRIM" values="REFO3TRIM__ROTRIM"/>
        </register>
        <register caption="REFERENCE OSCILLATOR 4 CONTROL REGISTER" initval="0x0" name="REFO4CON" offset="0x100" rw="RW" size="4">
          <bitfield caption="Reference Clock Source Select bits" mask="0x0000000F" name="ROSEL" values="REFO4CON__ROSEL"/>
          <bitfield caption="Reference Clock Request Status bit" mask="0x00000100" name="ACTIVE" values="REFO4CON__ACTIVE"/>
          <bitfield caption="Clock RODIV/ROTRIM switch enabled." mask="0x00000200" name="DIVSWEN" values="REFO4CON__DIVSWEN"/>
          <bitfield caption="Reference Oscillator Run in Sleep bit" mask="0x00000800" name="RSLP" values="REFO4CON__RSLP"/>
          <bitfield caption="Reference Clock Output Enable bit" mask="0x00001000" name="OE" values="REFO4CON__OE"/>
          <bitfield caption="Peripheral Stop in Idle Mode bit" mask="0x00002000" name="SIDL" values="REFO4CON__SIDL"/>
          <bitfield caption="Output Enable bit" mask="0x00008000" name="ON" values="REFO4CON__ON"/>
          <bitfield caption="Reference Clock Divider bits" mask="0x7FFF0000" name="RODIV" values="REFO4CON__RODIV"/>
        </register>
        <register caption="REFERENCE OSCILLATOR 4 TRIM REGISTER" initval="0x0" name="REFO4TRIM" offset="0x110" rw="RW" size="4">
          <bitfield caption="Trim bits - Provides fractional additive to RODIV value for 1/2 period of REFO1 clock" mask="0xFF800000" name="ROTRIM" values="REFO4TRIM__ROTRIM"/>
        </register>
