Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-W_DFP/1.8.326/atdf/PIC32MZ2051W104132.atdf
        <register caption="PB1 CLOCK DIVISOR CONTROL REGISTER" initval="0x8802" name="PB1DIV" offset="0x120" rw="RW" size="4">
          <bitfield caption="PB1 Peripheral Clock Divisor Control value" mask="0x0000007F" name="PBDIV" values="PB1DIV__PBDIV"/>
          <bitfield caption="PB1 Peripheral Clock Divisor Ready" mask="0x00000800" name="PBDIVRDY" values="PB1DIV__PBDIVRDY"/>
          <bitfield caption="Output Enable bit" mask="0x00008000" name="PBDIVON" values="PB1DIV__PBDIVON"/>
        </register>
        <register caption="PB2 CLOCK DIVISOR CONTROL REGISTER" initval="0x8802" name="PB2DIV" offset="0x130" rw="RW" size="4">
          <bitfield caption="PB2 Peripheral Clock Divisor Control value" mask="0x0000007F" name="PBDIV" values="PB2DIV__PBDIV"/>
          <bitfield caption="PB2 Peripheral Clock Divisor Ready" mask="0x00000800" name="PBDIVRDY" values="PB2DIV__PBDIVRDY"/>
          <bitfield caption="Output Enable bit" mask="0x00008000" name="PBDIVON" values="PB2DIV__PBDIVON"/>
        </register>
        <register caption="PB3 CLOCK DIVISOR CONTROL REGISTER" initval="0x8802" name="PB3DIV" offset="0x140" rw="RW" size="4">
          <bitfield caption="PB3 Peripheral Clock Divisor Control value" mask="0x0000007F" name="PBDIV" values="PB3DIV__PBDIV"/>
          <bitfield caption="PB3 Peripheral Clock Divisor Ready" mask="0x00000800" name="PBDIVRDY" values="PB3DIV__PBDIVRDY"/>
          <bitfield caption="Output Enable bit" mask="0x00008000" name="PBDIVON" values="PB3DIV__PBDIVON"/>
        </register>
        <register caption="PB4 CLOCK DIVISOR CONTROL REGISTER" initval="0x880A" name="PB4DIV" offset="0x150" rw="RW" size="4">
          <bitfield caption="PB4 Peripheral Clock Divisor Control value" mask="0x0000007F" name="PBDIV" values="PB4DIV__PBDIV"/>
          <bitfield caption="PB4 Peripheral Clock Divisor Ready" mask="0x00000800" name="PBDIVRDY" values="PB4DIV__PBDIVRDY"/>
          <bitfield caption="Output Enable bit" mask="0x00008000" name="PBDIVON" values="PB4DIV__PBDIVON"/>
        </register>
        <register caption="PB5 CLOCK DIVISOR CONTROL REGISTER" initval="0x8802" name="PB5DIV" offset="0x160" rw="RW" size="4">
          <bitfield caption="PB5 Peripheral Clock Divisor Control value" mask="0x0000007F" name="PBDIV" values="PB5DIV__PBDIV"/>
          <bitfield caption="PB5 Peripheral Clock Divisor Ready" mask="0x00000800" name="PBDIVRDY" values="PB5DIV__PBDIVRDY"/>
          <bitfield caption="Output Enable bit" mask="0x00008000" name="PBDIVON" values="PB5DIV__PBDIVON"/>
        </register>
        <register caption="PB6 CLOCK DIVISOR CONTROL REGISTER" initval="0x8801" name="PB6DIV" offset="0x170" rw="RW" size="4">
          <bitfield caption="PB6 Peripheral Clock Divisor Control value" mask="0x0000007F" name="PBDIV" values="PB6DIV__PBDIV"/>
          <bitfield caption="PB6 Peripheral Clock Divisor Ready" mask="0x00000800" name="PBDIVRDY" values="PB6DIV__PBDIVRDY"/>
          <bitfield caption="Output Enable bit" mask="0x00008000" name="PBDIVON" values="PB6DIV__PBDIVON"/>
        </register>
        <register caption="SLEW RATE CONTROL FOR CLOCK SWITCHING REGISTER" initval="0x0" name="SLEWCON" offset="0x180" rw="RW" size="4">
          <bitfield caption="Clock Switch Slewing Active Status Bit - Read-Only" mask="0x00000001" name="BUSY" values="SLEWCON__BUSY"/>
          <bitfield caption="Clock slew enable for switching down to slower clocks" mask="0x00000002" name="DNEN" values="SLEWCON__DNEN"/>
          <bitfield caption="Clock slew enable for switching up to faster clocks" mask="0x00000004" name="UPEN" values="SLEWCON__UPEN"/>
          <bitfield caption="Divisor steps used when doing slewed clock switches" mask="0x00000700" name="SLWDIV" values="SLEWCON__SLWDIV"/>
          <bitfield caption="PBx Peripheral Clock Divisor Control value" mask="0x000F0000" name="SYSDIV" values="SLEWCON__SYSDIV"/>
          <bitfield caption="Number of clocks generated at each slew step for a clock switch" mask="0x0F000000" name="SLWDLY" values="SLEWCON__SLWDLY"/>
        </register>
        <register caption="CLOCK STATUS REGISTER" initval="0x0" name="CLKSTAT" offset="0x190" rw="RW" size="4">
          <bitfield caption="FRC Ready Status value" mask="0x00000001" name="FRCRDY" values="CLKSTAT__FRCRDY"/>
          <bitfield caption="System PLL Ready Status value" mask="0x00000002" name="SPLLRDY" values="CLKSTAT__SPLLRDY"/>
          <bitfield caption="Primary Oscillator Ready Status value" mask="0x00000004" name="POSCRDY" values="CLKSTAT__POSCRDY"/>
          <bitfield caption="USB PLL Ready Status value" mask="0x00000008" name="UPLLRDY" values="CLKSTAT__UPLLRDY"/>
          <bitfield caption="SOSC Ready Status value" mask="0x00000010" name="SOSCRDY" values="CLKSTAT__SOSCRDY"/>
          <bitfield caption="LPRC Ready Status value" mask="0x00000020" name="LPRCRDY" values="CLKSTAT__LPRCRDY"/>
          <bitfield caption="Bluetooth PLL Ready Status value" mask="0x00000040" name="BTPLLRDY" values="CLKSTAT__BTPLLRDY"/>
          <bitfield caption="EWPLL Ready Status value" mask="0x00000080" name="ETHPLLRDY" values="CLKSTAT__ETHPLLRDY"/>
          <bitfield caption="WiFi Clock Ready Status value" mask="0x00000100" name="WIFICLKRDY" values="CLKSTAT__WIFICLKRDY"/>
          <bitfield caption="System PLL Ready Status value" mask="0x00000200" name="SPLLALTRDY" values="CLKSTAT__SPLLALTRDY"/>
          <bitfield caption="PB1 Clock Ready Status value" mask="0x00000400" name="PB1CLKRDY" values="CLKSTAT__PB1CLKRDY"/>
          <bitfield caption="System Clock Ready Status value" mask="0x00000800" name="SYSCLKRDY" values="CLKSTAT__SYSCLKRDY"/>
        </register>
        <register caption="" name="OSCCONBAR" offset="0x1a0" rw="R" size="4"/>
        <register caption="USER CLK DIAGNOSTICS CONTROL REGISTER" initval="0x0" name="CLKDIAG" offset="0x1b0" rw="RW" size="4">
          <bitfield caption="POSC Clock Stop Control value" mask="0x00000001" name="POSCSTOP" values="CLKDIAG__POSCSTOP"/>
          <bitfield caption="SOSC Clock Stop Control value" mask="0x00000002" name="SOSCSTOP" values="CLKDIAG__SOSCSTOP"/>
          <bitfield caption="FRC Clock Stop Control value" mask="0x00000004" name="FRCSTOP" values="CLKDIAG__FRCSTOP"/>
          <bitfield caption="LPRC Clock Stop Control value" mask="0x00000008" name="LPRCSTOP" values="CLKDIAG__LPRCSTOP"/>
          <bitfield caption="SPLL Clock Stop Control value" mask="0x00000010" name="SPLLSTOP" values="CLKDIAG__SPLLSTOP"/>
          <bitfield caption="UPLL Clock Stop Control value" mask="0x00000020" name="UPLLSTOP" values="CLKDIAG__UPLLSTOP"/>
          <bitfield caption="UPLL Clock Stop Control value" mask="0x00000040" name="ETHPLLSTOP" values="CLKDIAG__ETHPLLSTOP"/>
        </register>
      </register-group>
