Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-W_DFP/1.8.326/atdf/PIC32MZ2051W104132.atdf
      <value-group caption="USB PLL Lock Status bit (Read-only)" name="UPLLCON__ULOCK">
        <value caption="Indicates that UPLL is in lock." name="" value="0x1"/>
        <value caption="Indicates that UPLL is out of lock, start-up timer is in progress, or is turned-off." name="" value="0x0"/>
      </value-group>
      <value-group caption="" name="UPLLCON__UPLL_BYP">
        <value caption="the input clock REF bypasses PLL to PLLOUTx" name="POSC" value="0x1"/>
        <value caption="the input clock REF does not bypass PLL to PLLOUTx" name="UPLL" value="0x0"/>
      </value-group>
      <value-group caption="PLL Power Down Register bit" name="BTPLLCON__BTPLLPWDN">
        <value caption="PLL is powered down" name="PLL_OFF" value="0x1"/>
        <value caption="PLL is active" name="PLL_ON" value="0x0"/>
      </value-group>
      <value-group caption="First Post Divide Value. 1 to 63" name="BTPLLCON__BTPLLPOSTDIV1">
        <value caption="First post divide by 1" name="" value="0x1"/>
        <value caption="First post divide by 2" name="" value="0x2"/>
        <value caption="First post divide by 3" name="" value="0x3"/>
        <value caption="First post divide by 4" name="" value="0x4"/>
        <value caption="First post divide by 5" name="" value="0x5"/>
        <value caption="First post divide by 6" name="" value="0x6"/>
        <value caption="First post divide by 7" name="" value="0x7"/>
        <value caption="First post divide by 8" name="" value="0x8"/>
        <value caption="First post divide by 9" name="" value="0x9"/>
        <value caption="First post divide by 10" name="" value="0xa"/>
        <value caption="First post divide by 11" name="" value="0xb"/>
        <value caption="First post divide by 12" name="" value="0xc"/>
        <value caption="First post divide by 13" name="" value="0xd"/>
        <value caption="First post divide by 14" name="" value="0xe"/>
        <value caption="First post divide by 15" name="" value="0xf"/>
        <value caption="First post divide by 16" name="" value="0x10"/>
        <value caption="First post divide by 17" name="" value="0x11"/>
        <value caption="First post divide by 18" name="" value="0x12"/>
        <value caption="First post divide by 19" name="" value="0x13"/>
        <value caption="First post divide by 20" name="" value="0x14"/>
        <value caption="First post divide by 21" name="" value="0x15"/>
        <value caption="First post divide by 22" name="" value="0x16"/>
        <value caption="First post divide by 23" name="" value="0x17"/>
        <value caption="First post divide by 24" name="" value="0x18"/>
        <value caption="First post divide by 25" name="" value="0x19"/>
        <value caption="First post divide by 26" name="" value="0x1a"/>
        <value caption="First post divide by 27" name="" value="0x1b"/>
        <value caption="First post divide by 28" name="" value="0x1c"/>
        <value caption="First post divide by 29" name="" value="0x1d"/>
        <value caption="First post divide by 30" name="" value="0x1e"/>
        <value caption="First post divide by 31" name="" value="0x1f"/>
        <value caption="First post divide by 32" name="" value="0x20"/>
        <value caption="First post divide by 33" name="" value="0x21"/>
        <value caption="First post divide by 34" name="" value="0x22"/>
        <value caption="First post divide by 35" name="" value="0x23"/>
        <value caption="First post divide by 36" name="" value="0x24"/>
        <value caption="First post divide by 37" name="" value="0x25"/>
        <value caption="First post divide by 38" name="" value="0x26"/>
        <value caption="First post divide by 39" name="" value="0x27"/>
        <value caption="First post divide by 40" name="" value="0x28"/>
        <value caption="First post divide by 41" name="" value="0x29"/>
        <value caption="First post divide by 42" name="" value="0x2a"/>
        <value caption="First post divide by 43" name="" value="0x2b"/>
        <value caption="First post divide by 44" name="" value="0x2c"/>
        <value caption="First post divide by 45" name="" value="0x2d"/>
        <value caption="First post divide by 46" name="" value="0x2e"/>
        <value caption="First post divide by 47" name="" value="0x2f"/>
        <value caption="First post divide by 48" name="" value="0x30"/>
        <value caption="First post divide by 49" name="" value="0x31"/>
        <value caption="First post divide by 50" name="" value="0x32"/>
        <value caption="First post divide by 51" name="" value="0x33"/>
        <value caption="First post divide by 52" name="" value="0x34"/>
        <value caption="First post divide by 53" name="" value="0x35"/>
        <value caption="First post divide by 54" name="" value="0x36"/>
        <value caption="First post divide by 55" name="" value="0x37"/>
        <value caption="First post divide by 56" name="" value="0x38"/>
        <value caption="First post divide by 57" name="" value="0x39"/>
        <value caption="First post divide by 58" name="" value="0x3a"/>
        <value caption="First post divide by 59" name="" value="0x3b"/>
        <value caption="First post divide by 60" name="" value="0x3c"/>
        <value caption="First post divide by 61" name="" value="0x3d"/>
        <value caption="First post divide by 62" name="" value="0x3e"/>
        <value caption="First post divide by 63" name="" value="0x3f"/>
      </value-group>
      <value-group caption="BT PLL Force Lock" name="BTPLLCON__BTPLLFLOCK">
        <value caption="Force the BTPLL lock signal to be asserted" name="FORCE" value="0x1"/>
        <value caption="Do not force the BTPLL lock signal to be asserted" name="NO_FORCE" value="0x0"/>
      </value-group>
      <value-group caption="BT PLL Reset" name="BTPLLCON__BTPLLRST">
        <value caption="Assert the reset to the BTPLL" name="ASSERT" value="0x1"/>
        <value caption="De-assert the reset to the BTPLL" name="DEASSERT" value="0x0"/>
      </value-group>
      <value-group caption="PLL feedback divider" name="BTPLLCON__BTPLLFBDIV">
        <value caption="PLL feedback divide by 16" name="DIV_16" value="0x10"/>
        <value caption="PLL feedback divide by 17" name="DIV_17" value="0x11"/>
        <value caption="PLL feedback divide by 18" name="DIV_18" value="0x12"/>
        <value caption="PLL feedback divide by 1022" name="DIV_1022" value="0x3fe"/>
        <value caption="PLL feedback divide by 1023" name="DIV_1023" value="0x3ff"/>
      </value-group>
      <value-group caption="Reference Frequency Divide" name="BTPLLCON__BTPLLREFDIV">
        <value caption="Reference frequency divide by 1" name="" value="0x1"/>
        <value caption="Reference frequency divide by 2" name="" value="0x2"/>
        <value caption="Reference frequency divide by 3" name="" value="0x3"/>
        <value caption="Reference frequency divide by 4" name="" value="0x4"/>
        <value caption="Reference frequency divide by 5" name="" value="0x5"/>
        <value caption="Reference frequency divide by 6" name="" value="0x6"/>
        <value caption="Reference frequency divide by 7" name="" value="0x7"/>
        <value caption="Reference frequency divide by 8" name="" value="0x8"/>
        <value caption="Reference frequency divide by 9" name="" value="0x9"/>
        <value caption="Reference frequency divide by 10" name="" value="0xa"/>
        <value caption="Reference frequency divide by 11" name="" value="0xb"/>
        <value caption="Reference frequency divide by 12" name="" value="0xc"/>
        <value caption="Reference frequency divide by 13" name="" value="0xd"/>
        <value caption="Reference frequency divide by 14" name="" value="0xe"/>
        <value caption="Reference frequency divide by 15" name="" value="0xf"/>
        <value caption="Reference frequency divide by 16" name="" value="0x10"/>
        <value caption="Reference frequency divide by 17" name="" value="0x11"/>
        <value caption="Reference frequency divide by 18" name="" value="0x12"/>
        <value caption="Reference frequency divide by 19" name="" value="0x13"/>
        <value caption="Reference frequency divide by 20" name="" value="0x14"/>
        <value caption="Reference frequency divide by 21" name="" value="0x15"/>
        <value caption="Reference frequency divide by 22" name="" value="0x16"/>
        <value caption="Reference frequency divide by 23" name="" value="0x17"/>
        <value caption="Reference frequency divide by 24" name="" value="0x18"/>
        <value caption="Reference frequency divide by 25" name="" value="0x19"/>
        <value caption="Reference frequency divide by 26" name="" value="0x1a"/>
        <value caption="Reference frequency divide by 27" name="" value="0x1b"/>
        <value caption="Reference frequency divide by 28" name="" value="0x1c"/>
        <value caption="Reference frequency divide by 29" name="" value="0x1d"/>
        <value caption="Reference frequency divide by 30" name="" value="0x1e"/>
        <value caption="Reference frequency divide by 31" name="" value="0x1f"/>
        <value caption="Reference frequency divide by 32" name="" value="0x20"/>
        <value caption="Reference frequency divide by 33" name="" value="0x21"/>
        <value caption="Reference frequency divide by 34" name="" value="0x22"/>
        <value caption="Reference frequency divide by 35" name="" value="0x23"/>
        <value caption="Reference frequency divide by 36" name="" value="0x24"/>
        <value caption="Reference frequency divide by 37" name="" value="0x25"/>
        <value caption="Reference frequency divide by 38" name="" value="0x26"/>
        <value caption="Reference frequency divide by 39" name="" value="0x27"/>
        <value caption="Reference frequency divide by 40" name="" value="0x28"/>
        <value caption="Reference frequency divide by 41" name="" value="0x29"/>
        <value caption="Reference frequency divide by 42" name="" value="0x2a"/>
        <value caption="Reference frequency divide by 43" name="" value="0x2b"/>
        <value caption="Reference frequency divide by 44" name="" value="0x2c"/>
        <value caption="Reference frequency divide by 45" name="" value="0x2d"/>
        <value caption="Reference frequency divide by 46" name="" value="0x2e"/>
        <value caption="Reference frequency divide by 47" name="" value="0x2f"/>
        <value caption="Reference frequency divide by 48" name="" value="0x30"/>
        <value caption="Reference frequency divide by 49" name="" value="0x31"/>
        <value caption="Reference frequency divide by 50" name="" value="0x32"/>
        <value caption="Reference frequency divide by 51" name="" value="0x33"/>
        <value caption="Reference frequency divide by 52" name="" value="0x34"/>
        <value caption="Reference frequency divide by 53" name="" value="0x35"/>
        <value caption="Reference frequency divide by 54" name="" value="0x36"/>
        <value caption="Reference frequency divide by 55" name="" value="0x37"/>
        <value caption="Reference frequency divide by 56" name="" value="0x38"/>
        <value caption="Reference frequency divide by 57" name="" value="0x39"/>
        <value caption="Reference frequency divide by 58" name="" value="0x3a"/>
        <value caption="Reference frequency divide by 59" name="" value="0x3b"/>
        <value caption="Reference frequency divide by 60" name="" value="0x3c"/>
        <value caption="Reference frequency divide by 61" name="" value="0x3d"/>
        <value caption="Reference frequency divide by 62" name="" value="0x3e"/>
        <value caption="Reference frequency divide by 63" name="" value="0x3f"/>
      </value-group>
