Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-W_DFP/1.8.326/atdf/PIC32MZ2051W104132.atdf
        <register caption="" name="CVDSTAT" offset="0x8" rw="RW" size="4">
          <bitfield mask="0x00000001" name="SD1BUSY"/>
          <bitfield mask="0x00000002" name="SD1DONE"/>
          <bitfield mask="0x00000004" name="SD1INT"/>
          <bitfield mask="0x00000010" name="SD2BUSY"/>
          <bitfield mask="0x00000020" name="SD2DONE"/>
          <bitfield mask="0x00000040" name="SD2INT"/>
          <bitfield mask="0x00000100" name="SD3BUSY"/>
          <bitfield mask="0x00000200" name="SD3DONE"/>
          <bitfield mask="0x00000400" name="SD3INT"/>
          <bitfield mask="0x00001000" name="SD4BUSY"/>
          <bitfield mask="0x00002000" name="SD4DONE"/>
          <bitfield mask="0x00004000" name="SD4INT"/>
          <bitfield mask="0x03FF0000" name="FIFOCNT"/>
          <bitfield mask="0x20000000" name="FIFOMT"/>
          <bitfield mask="0x40000000" name="FIFOWM"/>
          <bitfield mask="0x80000000" name="FIFOFULL"/>
        </register>
        <register caption="" name="CVDRES0H" offset="0xc" rw="RW" size="4">
          <bitfield mask="0x00FFFFFF" name="POS"/>
        </register>
        <register caption="" name="CVDRES0L" offset="0x10" rw="RW" size="4">
          <bitfield mask="0x00FFFFFF" name="NEG"/>
        </register>
        <register caption="" name="CVDRES0D" offset="0x14" rw="RW" size="4">
          <bitfield mask="0x0003FFFF" name="DELTA"/>
          <bitfield mask="0x00F80000" name="RXINDEX"/>
          <bitfield mask="0x03000000" name="SDNUM"/>
          <bitfield mask="0xF8000000" name="TXINDEX"/>
        </register>
        <register caption="" name="CVDRX0" offset="0x80" rw="RW" size="4">
          <bitfield mask="0x0000003F" name="RXAN0"/>
          <bitfield mask="0x00003F00" name="RXAN1"/>
          <bitfield mask="0x003F0000" name="RXAN2"/>
          <bitfield mask="0x3F000000" name="RXAN3"/>
        </register>
        <register caption="" name="CVDRX1" offset="0x84" rw="RW" size="4">
          <bitfield mask="0x0000003F" name="RXAN4"/>
          <bitfield mask="0x00003F00" name="RXAN5"/>
          <bitfield mask="0x003F0000" name="RXAN6"/>
          <bitfield mask="0x3F000000" name="RXAN7"/>
        </register>
        <register caption="" name="CVDRX2" offset="0x88" rw="RW" size="4">
          <bitfield mask="0x0000003F" name="RXAN8"/>
          <bitfield mask="0x00003F00" name="RXAN9"/>
          <bitfield mask="0x003F0000" name="RXAN10"/>
          <bitfield mask="0x3F000000" name="RXAN11"/>
        </register>
        <register caption="" name="CVDRX3" offset="0x8c" rw="RW" size="4">
          <bitfield mask="0x0000003F" name="RXAN12"/>
          <bitfield mask="0x00003F00" name="RXAN13"/>
          <bitfield mask="0x003F0000" name="RXAN14"/>
          <bitfield mask="0x3F000000" name="RXAN15"/>
        </register>
        <register caption="" name="CVDTX0" offset="0xc0" rw="RW" size="4">
          <bitfield mask="0x0000003F" name="TXAN0"/>
          <bitfield mask="0x00003F00" name="TXAN1"/>
          <bitfield mask="0x003F0000" name="TXAN2"/>
          <bitfield mask="0x3F000000" name="TXAN3"/>
        </register>
        <register caption="" name="CVDTX1" offset="0xc4" rw="RW" size="4">
          <bitfield mask="0x0000003F" name="TXAN4"/>
          <bitfield mask="0x00003F00" name="TXAN5"/>
          <bitfield mask="0x003F0000" name="TXAN6"/>
          <bitfield mask="0x3F000000" name="TXAN7"/>
        </register>
        <register caption="" name="CVDTX2" offset="0xc8" rw="RW" size="4">
          <bitfield mask="0x0000003F" name="TXAN8"/>
          <bitfield mask="0x00003F00" name="TXAN9"/>
          <bitfield mask="0x003F0000" name="TXAN10"/>
          <bitfield mask="0x3F000000" name="TXAN11"/>
        </register>
        <register caption="" name="CVDTX3" offset="0xcc" rw="RW" size="4">
          <bitfield mask="0x0000003F" name="TXAN12"/>
          <bitfield mask="0x00003F00" name="TXAN13"/>
          <bitfield mask="0x003F0000" name="TXAN14"/>
          <bitfield mask="0x3F000000" name="TXAN15"/>
        </register>
        <register caption="" name="CVDSD0C1" offset="0x100" rw="RW" size="4">
          <bitfield mask="0x000000FF" name="SD0OVRSAMP"/>
          <bitfield mask="0xFFFFFF00" name="SD0THRESH"/>
        </register>
        <register caption="" name="CVDSD0C2" offset="0x104" rw="RW" size="4">
          <bitfield mask="0x0000003F" name="SD0RXBEG"/>
          <bitfield mask="0x000000C0" name="SD0RXSTRIDE1"/>
          <bitfield mask="0x00003F00" name="SD0RXEND"/>
          <bitfield mask="0x0000C000" name="SD0RXSTRIDE2"/>
          <bitfield mask="0x003F0000" name="SD0TXBEG"/>
          <bitfield mask="0x00C00000" name="SD0TXSTRIDE1"/>
          <bitfield mask="0x3F000000" name="SD0TXEND"/>
          <bitfield mask="0xC0000000" name="SD0TXSTRIDE2"/>
        </register>
        <register caption="" name="CVDSD0T1" offset="0x108" rw="RW" size="4">
          <bitfield mask="0x0000007F" name="SD0CHGTIME"/>
          <bitfield mask="0x00007F00" name="SD0ACQTIME"/>
          <bitfield mask="0x00FF0000" name="SD0ADCCON"/>
          <bitfield mask="0x01000000" name="SD0MUT"/>
          <bitfield mask="0x02000000" name="SD0SELF"/>
          <bitfield mask="0x04000000" name="SD0IEN"/>
          <bitfield mask="0x08000000" name="SD0BUF"/>
          <bitfield mask="0xC0000000" name="SD0EN"/>
        </register>
        <register caption="" name="CVDSD0T2" offset="0x10c" rw="RW" size="4">
          <bitfield mask="0x0000007F" name="SD0CONTIME"/>
          <bitfield mask="0x00007F00" name="SD0CHNTIME"/>
          <bitfield mask="0x007F0000" name="SD0OVRTIME"/>
          <bitfield mask="0x7F000000" name="SD0POLTIME"/>
        </register>
        <register caption="" name="CVDSD1C1" offset="0x110" rw="RW" size="4">
          <bitfield mask="0x000000FF" name="SD1OVRSAMP"/>
          <bitfield mask="0xFFFFFF00" name="SD1THRESH"/>
        </register>
        <register caption="" name="CVDSD1C2" offset="0x114" rw="RW" size="4">
          <bitfield mask="0x0000003F" name="SD1RXBEG"/>
          <bitfield mask="0x000000C0" name="SD1RXSTRIDE1"/>
          <bitfield mask="0x00003F00" name="SD1RXEND"/>
          <bitfield mask="0x0000C000" name="SD1RXSTRIDE2"/>
          <bitfield mask="0x003F0000" name="SD1TXBEG"/>
          <bitfield mask="0x00C00000" name="SD1TXSTRIDE1"/>
          <bitfield mask="0x3F000000" name="SD1TXEND"/>
          <bitfield mask="0xC0000000" name="SD1TXSTRIDE2"/>
        </register>
        <register caption="" name="CVDSD1T1" offset="0x118" rw="RW" size="4">
          <bitfield mask="0x0000007F" name="SD1CHGTIME"/>
          <bitfield mask="0x00007F00" name="SD1ACQTIME"/>
          <bitfield mask="0x00FF0000" name="SD1ADCCON"/>
          <bitfield mask="0x01000000" name="SD1MUT"/>
          <bitfield mask="0x02000000" name="SD1SELF"/>
          <bitfield mask="0x04000000" name="SD1IEN"/>
          <bitfield mask="0x08000000" name="SD1BUF"/>
          <bitfield mask="0xC0000000" name="SD1EN"/>
        </register>
