Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-W_DFP/1.8.326/atdf/PIC32MZ2051W104132.atdf
      <value-group caption="Channel Cell Transfer Complete Interrupt Flag bit" name="DCH3INT__CHCCIF">
        <value caption="A cell transfer has been completed (CHCSIZ bytes have been transferred)" name="" value="0x1"/>
        <value caption="No interrupt is pending" name="" value="0x0"/>
      </value-group>
      <value-group caption="Channel Block Transfer Complete Interrupt Flag bit" name="DCH3INT__CHBCIF">
        <value caption="A block transfer has been completed (the larger of CHSSIZ/CHDSIZ bytes has been transferred)" name="" value="0x1"/>
        <value caption="No interrupt is pending" name="" value="0x0"/>
      </value-group>
      <value-group caption="Channel Destination Half Full Interrupt Flag bit" name="DCH3INT__CHDHIF">
        <value caption="Channel Destination Pointer has reached midpoint of destination (CHDPTR = CHDSIZ/2)" name="" value="0x1"/>
        <value caption="No interrupt is pending" name="" value="0x0"/>
      </value-group>
      <value-group caption="Channel Destination Done Interrupt Flag bit" name="DCH3INT__CHDDIF">
        <value caption="Channel Destination Pointer has reached end of destination (CHDPTR = CHDSIZ)" name="" value="0x1"/>
        <value caption="No interrupt is pending" name="" value="0x0"/>
      </value-group>
      <value-group caption="Channel Source Half Empty Interrupt Flag bit" name="DCH3INT__CHSHIF">
        <value caption="Channel Source Pointer has reached midpoint of source (CHSPTR = CHSSIZ/2)" name="" value="0x1"/>
        <value caption="No interrupt is pending" name="" value="0x0"/>
      </value-group>
      <value-group caption="Channel Source Done Interrupt Flag bit" name="DCH3INT__CHSDIF">
        <value caption="Channel Source Pointer has reached end of source (CHSPTR = CHSSIZ)" name="" value="0x1"/>
        <value caption="No interrupt is pending" name="" value="0x0"/>
      </value-group>
      <value-group caption="Channel Address Error Interrupt Enable bit" name="DCH3INT__CHERIE">
        <value caption="Interrupt is enabled" name="" value="0x1"/>
        <value caption="Interrupt is disabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="Channel Transfer Abort Interrupt Enable bit" name="DCH3INT__CHTAIE">
        <value caption="Interrupt is enabled" name="" value="0x1"/>
        <value caption="Interrupt is disabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="Channel Cell Transfer Complete Interrupt Enable bit" name="DCH3INT__CHCCIE">
        <value caption="Interrupt is enabled" name="" value="0x1"/>
        <value caption="Interrupt is disabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="Channel Block Transfer Complete Interrupt Enable bit" name="DCH3INT__CHBCIE">
        <value caption="Interrupt is enabled" name="" value="0x1"/>
        <value caption="Interrupt is disabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="Channel Destination Half Full Interrupt Enable bit" name="DCH3INT__CHDHIE">
        <value caption="Interrupt is enabled" name="" value="0x1"/>
        <value caption="Interrupt is disabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="Channel Destination Done Interrupt Enable bit" name="DCH3INT__CHDDIE">
        <value caption="Interrupt is enabled" name="" value="0x1"/>
        <value caption="Interrupt is disabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="Channel Source Half Empty Interrupt Enable bit" name="DCH3INT__CHSHIE">
        <value caption="Interrupt is enabled" name="" value="0x1"/>
        <value caption="Interrupt is disabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="Channel Source Done Interrupt Enable bit" name="DCH3INT__CHSDIE">
        <value caption="Interrupt is enabled" name="" value="0x1"/>
        <value caption="Interrupt is disabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="Channel Address Error Interrupt Flag bit" name="DCH4INT__CHERIF">
        <value caption="A channel address error has been detected Either the source or the destination address is invalid." name="" value="0x1"/>
        <value caption="No interrupt is pending" name="" value="0x0"/>
      </value-group>
      <value-group caption="Channel Transfer Abort Interrupt Flag bit" name="DCH4INT__CHTAIF">
        <value caption="An interrupt matching CHAIRQ has been detected and the DMA transfer has been aborted" name="" value="0x1"/>
        <value caption="No interrupt is pending" name="" value="0x0"/>
      </value-group>
      <value-group caption="Channel Cell Transfer Complete Interrupt Flag bit" name="DCH4INT__CHCCIF">
        <value caption="A cell transfer has been completed (CHCSIZ bytes have been transferred)" name="" value="0x1"/>
        <value caption="No interrupt is pending" name="" value="0x0"/>
      </value-group>
      <value-group caption="Channel Block Transfer Complete Interrupt Flag bit" name="DCH4INT__CHBCIF">
        <value caption="A block transfer has been completed (the larger of CHSSIZ/CHDSIZ bytes has been transferred)" name="" value="0x1"/>
        <value caption="No interrupt is pending" name="" value="0x0"/>
      </value-group>
      <value-group caption="Channel Destination Half Full Interrupt Flag bit" name="DCH4INT__CHDHIF">
        <value caption="Channel Destination Pointer has reached midpoint of destination (CHDPTR = CHDSIZ/2)" name="" value="0x1"/>
        <value caption="No interrupt is pending" name="" value="0x0"/>
      </value-group>
      <value-group caption="Channel Destination Done Interrupt Flag bit" name="DCH4INT__CHDDIF">
        <value caption="Channel Destination Pointer has reached end of destination (CHDPTR = CHDSIZ)" name="" value="0x1"/>
        <value caption="No interrupt is pending" name="" value="0x0"/>
      </value-group>
      <value-group caption="Channel Source Half Empty Interrupt Flag bit" name="DCH4INT__CHSHIF">
        <value caption="Channel Source Pointer has reached midpoint of source (CHSPTR = CHSSIZ/2)" name="" value="0x1"/>
        <value caption="No interrupt is pending" name="" value="0x0"/>
      </value-group>
      <value-group caption="Channel Source Done Interrupt Flag bit" name="DCH4INT__CHSDIF">
        <value caption="Channel Source Pointer has reached end of source (CHSPTR = CHSSIZ)" name="" value="0x1"/>
        <value caption="No interrupt is pending" name="" value="0x0"/>
      </value-group>
      <value-group caption="Channel Address Error Interrupt Enable bit" name="DCH4INT__CHERIE">
        <value caption="Interrupt is enabled" name="" value="0x1"/>
        <value caption="Interrupt is disabled" name="" value="0x0"/>
      </value-group>
