Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-W_DFP/1.8.326/atdf/PIC32MZ2051W104132.atdf
      <value-group caption="Bad STEP2 Value Detect bit" name="DMTSTAT__BAD2">
        <value caption="Incorrect STEP2 value was detected" name="" value="0x2"/>
        <value caption="Incorrect STEP2 value was not detected" name="" value="0x0"/>
      </value-group>
      <value-group caption="Bad STEP1 Value Detect bit" name="DMTSTAT__BAD1">
        <value caption="Incorrect STEP1 value or out of sequence write to STEP2 was detected" name="" value="0x4"/>
        <value caption="Incorrect STEP1 value was not detected" name="" value="0x0"/>
      </value-group>
    </module>
    <module caption="" id="01348" name="DSCTRL" version="1">
      <register-group name="DSCTRL">
        <register caption="" name="DSCON" offset="0x0" rw="RW" size="4">
          <bitfield mask="0x00000001" name="RELEASE"/>
          <bitfield mask="0x00000002" name="DSBOR"/>
          <bitfield mask="0x00000100" name="RTCCWDIS"/>
          <bitfield mask="0x00001000" name="RTCDIS"/>
          <bitfield mask="0x00002000" name="DSGPREN"/>
          <bitfield mask="0x00008000" name="DSEN"/>
        </register>
        <register caption="" name="DSWAKE" offset="0x4" rw="RW" size="4">
          <bitfield mask="0x00000002" name="ICD"/>
          <bitfield mask="0x00000004" name="DSMCLR"/>
          <bitfield mask="0x00000008" name="DSRTC"/>
          <bitfield mask="0x00000010" name="DSWDT"/>
          <bitfield mask="0x00000020" name="EXT"/>
          <bitfield mask="0x00000080" name="DSFLT"/>
          <bitfield mask="0x00000100" name="DSINT0"/>
        </register>
        <register caption="" name="DSGPR0" offset="0x8" rw="RW" size="4">
          <bitfield mask="0xFFFFFFFF" name="DSGPR"/>
        </register>
        <register caption="" name="DSGPR1" offset="0x10" rw="RW" size="4">
          <bitfield mask="0xFFFFFFFF" name="DSGPR"/>
        </register>
        <register caption="" name="DSGPR2" offset="0x14" rw="RW" size="4">
          <bitfield mask="0xFFFFFFFF" name="DSGPR"/>
        </register>
        <register caption="" name="DSGPR3" offset="0x18" rw="RW" size="4">
          <bitfield mask="0xFFFFFFFF" name="DSGPR"/>
        </register>
        <register caption="" name="DSGPR4" offset="0x1c" rw="RW" size="4">
          <bitfield mask="0xFFFFFFFF" name="DSGPR"/>
        </register>
        <register caption="" name="DSGPR5" offset="0x20" rw="RW" size="4">
          <bitfield mask="0xFFFFFFFF" name="DSGPR"/>
        </register>
        <register caption="" name="DSGPR6" offset="0x24" rw="RW" size="4">
          <bitfield mask="0xFFFFFFFF" name="DSGPR"/>
        </register>
        <register caption="" name="DSGPR7" offset="0x28" rw="RW" size="4">
          <bitfield mask="0xFFFFFFFF" name="DSGPR"/>
        </register>
        <register caption="" name="DSGPR8" offset="0x2c" rw="RW" size="4">
          <bitfield mask="0xFFFFFFFF" name="DSGPR"/>
        </register>
        <register caption="" name="DSGPR9" offset="0x30" rw="RW" size="4">
          <bitfield mask="0xFFFFFFFF" name="DSGPR"/>
        </register>
        <register caption="" name="DSGPR10" offset="0x34" rw="RW" size="4">
          <bitfield mask="0xFFFFFFFF" name="DSGPR"/>
        </register>
        <register caption="" name="DSGPR11" offset="0x38" rw="RW" size="4">
          <bitfield mask="0xFFFFFFFF" name="DSGPR"/>
        </register>
        <register caption="" name="DSGPR12" offset="0x3c" rw="RW" size="4">
          <bitfield mask="0xFFFFFFFF" name="DSGPR"/>
        </register>
        <register caption="" name="DSGPR13" offset="0x40" rw="RW" size="4">
          <bitfield mask="0xFFFFFFFF" name="DSGPR"/>
        </register>
        <register caption="" name="DSGPR14" offset="0x44" rw="RW" size="4">
          <bitfield mask="0xFFFFFFFF" name="DSGPR"/>
        </register>
        <register caption="" name="DSGPR15" offset="0x48" rw="RW" size="4">
          <bitfield mask="0xFFFFFFFF" name="DSGPR"/>
        </register>
        <register caption="" name="DSGPR16" offset="0x4c" rw="RW" size="4">
          <bitfield mask="0xFFFFFFFF" name="DSGPR"/>
        </register>
        <register caption="" name="DSGPR17" offset="0x50" rw="RW" size="4">
          <bitfield mask="0xFFFFFFFF" name="DSGPR"/>
        </register>
        <register caption="" name="DSGPR18" offset="0x54" rw="RW" size="4">
          <bitfield mask="0xFFFFFFFF" name="DSGPR"/>
        </register>
        <register caption="" name="DSGPR19" offset="0x58" rw="RW" size="4">
          <bitfield mask="0xFFFFFFFF" name="DSGPR"/>
        </register>
        <register caption="" name="DSGPR20" offset="0x5c" rw="RW" size="4">
          <bitfield mask="0xFFFFFFFF" name="DSGPR"/>
        </register>
        <register caption="" name="DSGPR21" offset="0x60" rw="RW" size="4">
          <bitfield mask="0xFFFFFFFF" name="DSGPR"/>
        </register>
        <register caption="" name="DSGPR22" offset="0x64" rw="RW" size="4">
          <bitfield mask="0xFFFFFFFF" name="DSGPR"/>
        </register>
        <register caption="" name="DSGPR23" offset="0x68" rw="RW" size="4">
          <bitfield mask="0xFFFFFFFF" name="DSGPR"/>
        </register>
        <register caption="" name="DSGPR24" offset="0x6c" rw="RW" size="4">
          <bitfield mask="0xFFFFFFFF" name="DSGPR"/>
        </register>
        <register caption="" name="DSGPR25" offset="0x70" rw="RW" size="4">
          <bitfield mask="0xFFFFFFFF" name="DSGPR"/>
        </register>
        <register caption="" name="DSGPR26" offset="0x74" rw="RW" size="4">
          <bitfield mask="0xFFFFFFFF" name="DSGPR"/>
        </register>
        <register caption="" name="DSGPR27" offset="0x78" rw="RW" size="4">
          <bitfield mask="0xFFFFFFFF" name="DSGPR"/>
        </register>
        <register caption="" name="DSGPR28" offset="0x7c" rw="RW" size="4">
          <bitfield mask="0xFFFFFFFF" name="DSGPR"/>
        </register>
        <register caption="" name="DSGPR29" offset="0x80" rw="RW" size="4">
          <bitfield mask="0xFFFFFFFF" name="DSGPR"/>
        </register>
        <register caption="" name="DSGPR30" offset="0x84" rw="RW" size="4">
          <bitfield mask="0xFFFFFFFF" name="DSGPR"/>
        </register>
        <register caption="" name="DSGPR31" offset="0x88" rw="RW" size="4">
          <bitfield mask="0xFFFFFFFF" name="DSGPR"/>
        </register>
        <register caption="" name="DSGPR32" offset="0x8c" rw="RW" size="4">
          <bitfield mask="0xFFFFFFFF" name="DSGPR"/>
        </register>
      </register-group>
    </module>
    <module caption="" id="01114" name="ETH" version="1">
      <register-group name="ETH">
        <register caption="Ethernet Controller Control Register 1" name="ETHCON1" offset="0x0" rw="RW" size="4">
          <bitfield mask="0x00000001" name="BUFCDEC"/>
          <bitfield caption="Manual Flow Control bit" mask="0x00000010" name="MANFC" values="ETHCON1__MANFC"/>
          <bitfield caption="Automatic Flow Control bit" mask="0x00000080" name="AUTOFC" values="ETHCON1__AUTOFC"/>
          <bitfield caption="Receive Enable bit" mask="0x00000100" name="RXEN" values="ETHCON1__RXEN"/>
          <bitfield caption="Transmit Request to Send bit" mask="0x00000200" name="TXRTS" values="ETHCON1__TXRTS"/>
          <bitfield caption="Ethernet Stop in Idle Mode bit" mask="0x00002000" name="SIDL" values="ETHCON1__SIDL"/>
          <bitfield caption="Ethernet ON bit" mask="0x00008000" name="ON" values="ETHCON1__ON"/>
          <bitfield mask="0xFFFF0000" name="PTV"/>
        </register>
        <register caption="Ethernet Controller Control Register 2" name="ETHCON2" offset="0x10" rw="RW" size="4">
          <bitfield caption="RX Data Buffer Size for All RX Descriptors bits" mask="0x000007F0" name="RXBUFSZ" values="ETHCON2__RXBUFSZ"/>
        </register>
