Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-W_DFP/1.8.326/atdf/PIC32MZ2051W104132.atdf
        <register caption="" name="ODCA" offset="0x40" rw="RW" size="4">
          <bitfield mask="0x1" name="ODCA0"/>
          <bitfield mask="0x2" name="ODCA1"/>
          <bitfield mask="0x4" name="ODCA2"/>
          <bitfield mask="0x8" name="ODCA3"/>
          <bitfield mask="0x10" name="ODCA4"/>
          <bitfield mask="0x20" name="ODCA5"/>
          <bitfield mask="0x40" name="ODCA6"/>
          <bitfield mask="0x80" name="ODCA7"/>
          <bitfield mask="0x100" name="ODCA8"/>
          <bitfield mask="0x200" name="ODCA9"/>
          <bitfield mask="0x400" name="ODCA10"/>
          <bitfield mask="0x800" name="ODCA11"/>
          <bitfield mask="0x1000" name="ODCA12"/>
          <bitfield mask="0x2000" name="ODCA13"/>
          <bitfield mask="0x4000" name="ODCA14"/>
          <bitfield mask="0x8000" name="ODCA15"/>
        </register>
        <register caption="" name="ODCB" offset="0x140" rw="RW" size="4">
          <bitfield mask="0x1" name="ODCB0"/>
          <bitfield mask="0x2" name="ODCB1"/>
          <bitfield mask="0x4" name="ODCB2"/>
          <bitfield mask="0x8" name="ODCB3"/>
          <bitfield mask="0x10" name="ODCB4"/>
          <bitfield mask="0x20" name="ODCB5"/>
          <bitfield mask="0x40" name="ODCB6"/>
          <bitfield mask="0x80" name="ODCB7"/>
          <bitfield mask="0x100" name="ODCB8"/>
          <bitfield mask="0x200" name="ODCB9"/>
          <bitfield mask="0x400" name="ODCB10"/>
          <bitfield mask="0x800" name="ODCB11"/>
          <bitfield mask="0x1000" name="ODCB12"/>
          <bitfield mask="0x2000" name="ODCB13"/>
          <bitfield mask="0x4000" name="ODCB14"/>
        </register>
        <register caption="" name="ODCC" offset="0x240" rw="RW" size="4">
          <bitfield mask="0x1" name="ODCC0"/>
          <bitfield mask="0x2" name="ODCC1"/>
          <bitfield mask="0x4" name="ODCC2"/>
          <bitfield mask="0x8" name="ODCC3"/>
          <bitfield mask="0x10" name="ODCC4"/>
          <bitfield mask="0x20" name="ODCC5"/>
          <bitfield mask="0x40" name="ODCC6"/>
          <bitfield mask="0x80" name="ODCC7"/>
          <bitfield mask="0x100" name="ODCC8"/>
          <bitfield mask="0x200" name="ODCC9"/>
          <bitfield mask="0x400" name="ODCC10"/>
          <bitfield mask="0x800" name="ODCC11"/>
          <bitfield mask="0x1000" name="ODCC12"/>
          <bitfield mask="0x2000" name="ODCC13"/>
          <bitfield mask="0x4000" name="ODCC14"/>
          <bitfield mask="0x8000" name="ODCC15"/>
        </register>
        <register caption="" name="ODCK" offset="0x340" rw="RW" size="4">
          <bitfield mask="0x1" name="ODCK0"/>
          <bitfield mask="0x2" name="ODCK1"/>
          <bitfield mask="0x4" name="ODCK2"/>
          <bitfield mask="0x8" name="ODCK3"/>
          <bitfield mask="0x10" name="ODCK4"/>
          <bitfield mask="0x20" name="ODCK5"/>
          <bitfield mask="0x40" name="ODCK6"/>
          <bitfield mask="0x80" name="ODCK7"/>
          <bitfield mask="0x100" name="ODCK8"/>
          <bitfield mask="0x200" name="ODCK9"/>
          <bitfield mask="0x400" name="ODCK10"/>
          <bitfield mask="0x800" name="ODCK11"/>
          <bitfield mask="0x1000" name="ODCK12"/>
          <bitfield mask="0x2000" name="ODCK13"/>
          <bitfield mask="0x4000" name="ODCK14"/>
        </register>
        <register caption="" name="CNPUA" offset="0x50" rw="RW" size="4">
          <bitfield mask="0x1" name="CNPUA0"/>
          <bitfield mask="0x2" name="CNPUA1"/>
          <bitfield mask="0x4" name="CNPUA2"/>
          <bitfield mask="0x8" name="CNPUA3"/>
          <bitfield mask="0x10" name="CNPUA4"/>
          <bitfield mask="0x20" name="CNPUA5"/>
          <bitfield mask="0x40" name="CNPUA6"/>
          <bitfield mask="0x80" name="CNPUA7"/>
          <bitfield mask="0x100" name="CNPUA8"/>
          <bitfield mask="0x200" name="CNPUA9"/>
          <bitfield mask="0x400" name="CNPUA10"/>
          <bitfield mask="0x800" name="CNPUA11"/>
          <bitfield mask="0x1000" name="CNPUA12"/>
          <bitfield mask="0x2000" name="CNPUA13"/>
          <bitfield mask="0x4000" name="CNPUA14"/>
          <bitfield mask="0x8000" name="CNPUA15"/>
        </register>
        <register caption="" name="CNPUB" offset="0x150" rw="RW" size="4">
          <bitfield mask="0x1" name="CNPUB0"/>
          <bitfield mask="0x2" name="CNPUB1"/>
          <bitfield mask="0x4" name="CNPUB2"/>
          <bitfield mask="0x8" name="CNPUB3"/>
          <bitfield mask="0x10" name="CNPUB4"/>
          <bitfield mask="0x20" name="CNPUB5"/>
          <bitfield mask="0x40" name="CNPUB6"/>
          <bitfield mask="0x80" name="CNPUB7"/>
          <bitfield mask="0x100" name="CNPUB8"/>
          <bitfield mask="0x200" name="CNPUB9"/>
          <bitfield mask="0x400" name="CNPUB10"/>
          <bitfield mask="0x800" name="CNPUB11"/>
          <bitfield mask="0x1000" name="CNPUB12"/>
          <bitfield mask="0x2000" name="CNPUB13"/>
          <bitfield mask="0x4000" name="CNPUB14"/>
        </register>
        <register caption="" name="CNPUC" offset="0x250" rw="RW" size="4">
          <bitfield mask="0x1" name="CNPUC0"/>
          <bitfield mask="0x2" name="CNPUC1"/>
          <bitfield mask="0x4" name="CNPUC2"/>
          <bitfield mask="0x8" name="CNPUC3"/>
          <bitfield mask="0x10" name="CNPUC4"/>
          <bitfield mask="0x20" name="CNPUC5"/>
          <bitfield mask="0x40" name="CNPUC6"/>
          <bitfield mask="0x80" name="CNPUC7"/>
          <bitfield mask="0x100" name="CNPUC8"/>
          <bitfield mask="0x200" name="CNPUC9"/>
          <bitfield mask="0x400" name="CNPUC10"/>
          <bitfield mask="0x800" name="CNPUC11"/>
          <bitfield mask="0x1000" name="CNPUC12"/>
          <bitfield mask="0x2000" name="CNPUC13"/>
          <bitfield mask="0x4000" name="CNPUC14"/>
          <bitfield mask="0x8000" name="CNPUC15"/>
        </register>
        <register caption="" name="CNPUK" offset="0x350" rw="RW" size="4">
          <bitfield mask="0x1" name="CNPUK0"/>
          <bitfield mask="0x2" name="CNPUK1"/>
          <bitfield mask="0x4" name="CNPUK2"/>
          <bitfield mask="0x8" name="CNPUK3"/>
          <bitfield mask="0x10" name="CNPUK4"/>
          <bitfield mask="0x20" name="CNPUK5"/>
          <bitfield mask="0x40" name="CNPUK6"/>
          <bitfield mask="0x80" name="CNPUK7"/>
          <bitfield mask="0x100" name="CNPUK8"/>
          <bitfield mask="0x200" name="CNPUK9"/>
          <bitfield mask="0x400" name="CNPUK10"/>
          <bitfield mask="0x800" name="CNPUK11"/>
          <bitfield mask="0x1000" name="CNPUK12"/>
          <bitfield mask="0x2000" name="CNPUK13"/>
          <bitfield mask="0x4000" name="CNPUK14"/>
        </register>
        <register caption="" name="CNPDA" offset="0x60" rw="RW" size="4">
          <bitfield mask="0x1" name="CNPDA0"/>
          <bitfield mask="0x2" name="CNPDA1"/>
          <bitfield mask="0x4" name="CNPDA2"/>
          <bitfield mask="0x8" name="CNPDA3"/>
          <bitfield mask="0x10" name="CNPDA4"/>
          <bitfield mask="0x20" name="CNPDA5"/>
          <bitfield mask="0x40" name="CNPDA6"/>
          <bitfield mask="0x80" name="CNPDA7"/>
          <bitfield mask="0x100" name="CNPDA8"/>
          <bitfield mask="0x200" name="CNPDA9"/>
          <bitfield mask="0x400" name="CNPDA10"/>
          <bitfield mask="0x800" name="CNPDA11"/>
          <bitfield mask="0x1000" name="CNPDA12"/>
          <bitfield mask="0x2000" name="CNPDA13"/>
          <bitfield mask="0x4000" name="CNPDA14"/>
          <bitfield mask="0x8000" name="CNPDA15"/>
        </register>
        <register caption="" name="CNPDB" offset="0x160" rw="RW" size="4">
          <bitfield mask="0x1" name="CNPDB0"/>
          <bitfield mask="0x2" name="CNPDB1"/>
          <bitfield mask="0x4" name="CNPDB2"/>
          <bitfield mask="0x8" name="CNPDB3"/>
          <bitfield mask="0x10" name="CNPDB4"/>
          <bitfield mask="0x20" name="CNPDB5"/>
          <bitfield mask="0x40" name="CNPDB6"/>
          <bitfield mask="0x80" name="CNPDB7"/>
          <bitfield mask="0x100" name="CNPDB8"/>
          <bitfield mask="0x200" name="CNPDB9"/>
          <bitfield mask="0x400" name="CNPDB10"/>
          <bitfield mask="0x800" name="CNPDB11"/>
          <bitfield mask="0x1000" name="CNPDB12"/>
          <bitfield mask="0x2000" name="CNPDB13"/>
          <bitfield mask="0x4000" name="CNPDB14"/>
        </register>
        <register caption="" name="CNPDC" offset="0x260" rw="RW" size="4">
          <bitfield mask="0x1" name="CNPDC0"/>
          <bitfield mask="0x2" name="CNPDC1"/>
          <bitfield mask="0x4" name="CNPDC2"/>
          <bitfield mask="0x8" name="CNPDC3"/>
          <bitfield mask="0x10" name="CNPDC4"/>
          <bitfield mask="0x20" name="CNPDC5"/>
          <bitfield mask="0x40" name="CNPDC6"/>
          <bitfield mask="0x80" name="CNPDC7"/>
          <bitfield mask="0x100" name="CNPDC8"/>
          <bitfield mask="0x200" name="CNPDC9"/>
          <bitfield mask="0x400" name="CNPDC10"/>
          <bitfield mask="0x800" name="CNPDC11"/>
          <bitfield mask="0x1000" name="CNPDC12"/>
          <bitfield mask="0x2000" name="CNPDC13"/>
          <bitfield mask="0x4000" name="CNPDC14"/>
          <bitfield mask="0x8000" name="CNPDC15"/>
        </register>
