Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-W_DFP/1.8.326/atdf/PIC32MZ2051W104132.atdf
        <register caption="" name="CNFK" offset="0x3b0" rw="RW" size="4">
          <bitfield mask="0x00000001" name="CNFK"/>
          <bitfield mask="0x00000002" name="CNFK"/>
          <bitfield mask="0x00000004" name="CNFK"/>
          <bitfield mask="0x00000008" name="CNFK"/>
          <bitfield mask="0x00000010" name="CNFK"/>
          <bitfield mask="0x00000020" name="CNFK"/>
          <bitfield mask="0x00000040" name="CNFK"/>
          <bitfield mask="0x00000080" name="CNFK"/>
          <bitfield mask="0x00000100" name="CNFK"/>
          <bitfield mask="0x00000200" name="CNFK"/>
          <bitfield mask="0x00000400" name="CNFK"/>
          <bitfield mask="0x00000800" name="CNFK"/>
          <bitfield mask="0x00001000" name="CNFK"/>
          <bitfield mask="0x00002000" name="CNFK"/>
          <bitfield mask="0x00004000" name="CNFK"/>
          <bitfield mask="0x00008000" name="CNFK"/>
        </register>
        <register caption="" name="SRCON0A" offset="0xc0" rw="RW" size="4">
          <bitfield mask="0x00000001" name="SRCON0A"/>
          <bitfield mask="0x00000002" name="SRCON0A"/>
          <bitfield mask="0x00000004" name="SRCON0A"/>
          <bitfield mask="0x00000008" name="SRCON0A"/>
          <bitfield mask="0x00000010" name="SRCON0A"/>
          <bitfield mask="0x00000020" name="SRCON0A"/>
          <bitfield mask="0x00000040" name="SRCON0A"/>
          <bitfield mask="0x00000080" name="SRCON0A"/>
          <bitfield mask="0x00000100" name="SRCON0A"/>
          <bitfield mask="0x00000200" name="SRCON0A"/>
          <bitfield mask="0x00000400" name="SRCON0A"/>
          <bitfield mask="0x00000800" name="SRCON0A"/>
          <bitfield mask="0x00001000" name="SRCON0A"/>
          <bitfield mask="0x00002000" name="SRCON0A"/>
          <bitfield mask="0x00004000" name="SRCON0A"/>
          <bitfield mask="0x00008000" name="SRCON0A"/>
        </register>
        <register caption="" name="SRCON0C" offset="0x2c0" rw="RW" size="4">
          <bitfield mask="0x00000001" name="SRCON0C"/>
          <bitfield mask="0x00000002" name="SRCON0C"/>
          <bitfield mask="0x00000004" name="SRCON0C"/>
          <bitfield mask="0x00000008" name="SRCON0C"/>
          <bitfield mask="0x00000010" name="SRCON0C"/>
          <bitfield mask="0x00000020" name="SRCON0C"/>
          <bitfield mask="0x00000040" name="SRCON0C"/>
          <bitfield mask="0x00000080" name="SRCON0C"/>
          <bitfield mask="0x00000100" name="SRCON0C"/>
          <bitfield mask="0x00000200" name="SRCON0C"/>
          <bitfield mask="0x00000400" name="SRCON0C"/>
          <bitfield mask="0x00000800" name="SRCON0C"/>
          <bitfield mask="0x00001000" name="SRCON0C"/>
          <bitfield mask="0x00002000" name="SRCON0C"/>
          <bitfield mask="0x00004000" name="SRCON0C"/>
          <bitfield mask="0x00008000" name="SRCON0C"/>
        </register>
        <register caption="" name="SRCON0K" offset="0x3c0" rw="RW" size="4">
          <bitfield mask="0x00000001" name="SRCON0K"/>
          <bitfield mask="0x00000002" name="SRCON0K"/>
          <bitfield mask="0x00000004" name="SRCON0K"/>
          <bitfield mask="0x00000008" name="SRCON0K"/>
          <bitfield mask="0x00000010" name="SRCON0K"/>
          <bitfield mask="0x00000020" name="SRCON0K"/>
          <bitfield mask="0x00000040" name="SRCON0K"/>
          <bitfield mask="0x00000080" name="SRCON0K"/>
          <bitfield mask="0x00000100" name="SRCON0K"/>
          <bitfield mask="0x00000200" name="SRCON0K"/>
          <bitfield mask="0x00000400" name="SRCON0K"/>
          <bitfield mask="0x00000800" name="SRCON0K"/>
          <bitfield mask="0x00001000" name="SRCON0K"/>
          <bitfield mask="0x00002000" name="SRCON0K"/>
          <bitfield mask="0x00004000" name="SRCON0K"/>
          <bitfield mask="0x00008000" name="SRCON0K"/>
        </register>
        <register caption="" name="SRCON1A" offset="0xd0" rw="RW" size="4">
          <bitfield mask="0x00000001" name="SRCON1A"/>
          <bitfield mask="0x00000002" name="SRCON1A"/>
          <bitfield mask="0x00000004" name="SRCON1A"/>
          <bitfield mask="0x00000008" name="SRCON1A"/>
          <bitfield mask="0x00000010" name="SRCON1A"/>
          <bitfield mask="0x00000020" name="SRCON1A"/>
          <bitfield mask="0x00000040" name="SRCON1A"/>
          <bitfield mask="0x00000080" name="SRCON1A"/>
          <bitfield mask="0x00000100" name="SRCON1A"/>
          <bitfield mask="0x00000200" name="SRCON1A"/>
          <bitfield mask="0x00000400" name="SRCON1A"/>
          <bitfield mask="0x00000800" name="SRCON1A"/>
          <bitfield mask="0x00001000" name="SRCON1A"/>
          <bitfield mask="0x00002000" name="SRCON1A"/>
          <bitfield mask="0x00004000" name="SRCON1A"/>
          <bitfield mask="0x00008000" name="SRCON1A"/>
        </register>
        <register caption="" name="SRCON1C" offset="0x2d0" rw="RW" size="4">
          <bitfield mask="0x00000001" name="SRCON1C"/>
          <bitfield mask="0x00000002" name="SRCON1C"/>
          <bitfield mask="0x00000004" name="SRCON1C"/>
          <bitfield mask="0x00000008" name="SRCON1C"/>
          <bitfield mask="0x00000010" name="SRCON1C"/>
          <bitfield mask="0x00000020" name="SRCON1C"/>
          <bitfield mask="0x00000040" name="SRCON1C"/>
          <bitfield mask="0x00000080" name="SRCON1C"/>
          <bitfield mask="0x00000100" name="SRCON1C"/>
          <bitfield mask="0x00000200" name="SRCON1C"/>
          <bitfield mask="0x00000400" name="SRCON1C"/>
          <bitfield mask="0x00000800" name="SRCON1C"/>
          <bitfield mask="0x00001000" name="SRCON1C"/>
          <bitfield mask="0x00002000" name="SRCON1C"/>
          <bitfield mask="0x00004000" name="SRCON1C"/>
          <bitfield mask="0x00008000" name="SRCON1C"/>
        </register>
        <register caption="" name="SRCON1K" offset="0x3d0" rw="RW" size="4">
          <bitfield mask="0x00000001" name="SRCON1K"/>
          <bitfield mask="0x00000002" name="SRCON1K"/>
          <bitfield mask="0x00000004" name="SRCON1K"/>
          <bitfield mask="0x00000008" name="SRCON1K"/>
          <bitfield mask="0x00000010" name="SRCON1K"/>
          <bitfield mask="0x00000020" name="SRCON1K"/>
          <bitfield mask="0x00000040" name="SRCON1K"/>
          <bitfield mask="0x00000080" name="SRCON1K"/>
          <bitfield mask="0x00000100" name="SRCON1K"/>
          <bitfield mask="0x00000200" name="SRCON1K"/>
          <bitfield mask="0x00000400" name="SRCON1K"/>
          <bitfield mask="0x00000800" name="SRCON1K"/>
          <bitfield mask="0x00001000" name="SRCON1K"/>
          <bitfield mask="0x00002000" name="SRCON1K"/>
          <bitfield mask="0x00004000" name="SRCON1K"/>
          <bitfield mask="0x00008000" name="SRCON1K"/>
        </register>
      </register-group>
      <value-group caption="Change Notification Style bit" name="CNCONA__EDGEDETECT">
        <value caption="Edge Style. Detect edge transitions (CNFx used for CN Event)." name="" value="0x1"/>
        <value caption="Mismatch Style. Detect change from last PORTx read (CNSTATx used for CN Event)." name="" value="0x0"/>
      </value-group>
      <value-group caption="Change Notice Control ON bit" name="CNCONA__ON">
        <value caption="CN is enabled" name="" value="0x1"/>
        <value caption="CN is disabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="Change Notification Style bit" name="CNCONB__EDGEDETECT">
        <value caption="Edge Style. Detect edge transitions (CNFx used for CN Event)." name="" value="0x1"/>
        <value caption="Mismatch Style. Detect change from last PORTx read (CNSTATx used for CN Event)." name="" value="0x0"/>
      </value-group>
      <value-group caption="Change Notice Control ON bit" name="CNCONB__ON">
        <value caption="CN is enabled" name="" value="0x1"/>
        <value caption="CN is disabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="Change Notification Style bit" name="CNCONC__EDGEDETECT">
        <value caption="Edge Style. Detect edge transitions (CNFx used for CN Event)." name="" value="0x1"/>
        <value caption="Mismatch Style. Detect change from last PORTx read (CNSTATx used for CN Event)." name="" value="0x0"/>
      </value-group>
      <value-group caption="Change Notice Control ON bit" name="CNCONC__ON">
        <value caption="CN is enabled" name="" value="0x1"/>
        <value caption="CN is disabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="Change Notification Style bit" name="CNCONK__EDGEDETECT">
        <value caption="Edge Style. Detect edge transitions (CNFx used for CN Event)." name="" value="0x1"/>
        <value caption="Mismatch Style. Detect change from last PORTx read (CNSTATx used for CN Event)." name="" value="0x0"/>
      </value-group>
      <value-group caption="Change Notice Control ON bit" name="CNCONK__ON">
        <value caption="CN is enabled" name="" value="0x1"/>
        <value caption="CN is disabled" name="" value="0x0"/>
      </value-group>
    </module>
