Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-W_DFP/1.8.326/atdf/PIC32MZ2051W104132.atdf
    <module caption="" id="01441" name="I2C" version="">
      <register-group name="I2C">
        <register caption="I2C Control Register" name="I2C1CON" offset="0x0" rw="RW" size="4">
          <bitfield caption="Start Condition Enable bit" mask="0x00000001" name="SEN" values="I2C1CON__SEN"/>
          <bitfield caption="Repeated Start Condition Enable bit" mask="0x00000002" name="RSEN" values="I2C1CON__RSEN"/>
          <bitfield caption="Stop Condition Enable bit" mask="0x00000004" name="PEN" values="I2C1CON__PEN"/>
          <bitfield caption="Receive Enable bit" mask="0x00000008" name="RCEN" values="I2C1CON__RCEN"/>
          <bitfield caption="Acknowledge Sequence Enable bit" mask="0x00000010" name="ACKEN" values="I2C1CON__ACKEN"/>
          <bitfield caption="Acknowledge Data bit" mask="0x00000020" name="ACKDT" values="I2C1CON__ACKDT"/>
          <bitfield caption="SCLx Clock Stretch Enable bit" mask="0x00000040" name="STREN" values="I2C1CON__STREN"/>
          <bitfield caption="General Call Enable bit" mask="0x00000080" name="GCEN" values="I2C1CON__GCEN"/>
          <bitfield caption="SMBus Input Levels bit" mask="0x00000100" name="SMEN" values="I2C1CON__SMEN"/>
          <bitfield caption="Disable Slew Rate Control bit" mask="0x00000200" name="DISSLW" values="I2C1CON__DISSLW"/>
          <bitfield caption="10-bit Slave Address bit" mask="0x00000400" name="A10M" values="I2C1CON__A10M"/>
          <bitfield caption="Strict I 2 C Reserved Address Rule Enable bit" mask="0x00000800" name="STRICT" values="I2C1CON__STRICT"/>
          <bitfield caption="SCLx Release Control bit" mask="0x00001000" name="SCLREL" values="I2C1CON__SCLREL"/>
          <bitfield caption="Stop in Idle Mode bit" mask="0x00002000" name="SIDL" values="I2C1CON__SIDL"/>
          <bitfield caption="I2C Enable bit" mask="0x00008000" name="ON" values="I2C1CON__ON"/>
          <bitfield caption="Data Hold Enable bit" mask="0x00010000" name="DHEN" values="I2C1CON__DHEN"/>
          <bitfield caption="Address Hold Enable bit" mask="0x00020000" name="AHEN" values="I2C1CON__AHEN"/>
          <bitfield caption="Slave Mode Bus Collision Detect Enable bit" mask="0x00040000" name="SBCDE" values="I2C1CON__SBCDE"/>
          <bitfield caption="SDA Hold Time Selection bit" mask="0x00080000" name="SDAHT" values="I2C1CON__SDAHT"/>
          <bitfield caption="Buffer Overwrite Enable bit" mask="0x00100000" name="BOEN" values="I2C1CON__BOEN"/>
          <bitfield caption="Start Condition Interrupt Enable bit" mask="0x00200000" name="SCIE" values="I2C1CON__SCIE"/>
          <bitfield caption="Stop Condition Interrupt Enable bit" mask="0x00400000" name="PCIE" values="I2C1CON__PCIE"/>
        </register>
        <register caption="I2C Control Register" name="I2C2CON" offset="0x20000" rw="RW" size="4">
          <bitfield caption="Start Condition Enable bit" mask="0x00000001" name="SEN" values="I2C2CON__SEN"/>
          <bitfield caption="Repeated Start Condition Enable bit" mask="0x00000002" name="RSEN" values="I2C2CON__RSEN"/>
          <bitfield caption="Stop Condition Enable bit" mask="0x00000004" name="PEN" values="I2C2CON__PEN"/>
          <bitfield caption="Receive Enable bit" mask="0x00000008" name="RCEN" values="I2C2CON__RCEN"/>
          <bitfield caption="Acknowledge Sequence Enable bit" mask="0x00000010" name="ACKEN" values="I2C2CON__ACKEN"/>
          <bitfield caption="Acknowledge Data bit" mask="0x00000020" name="ACKDT" values="I2C2CON__ACKDT"/>
          <bitfield caption="SCLx Clock Stretch Enable bit" mask="0x00000040" name="STREN" values="I2C2CON__STREN"/>
          <bitfield caption="General Call Enable bit" mask="0x00000080" name="GCEN" values="I2C2CON__GCEN"/>
          <bitfield caption="SMBus Input Levels bit" mask="0x00000100" name="SMEN" values="I2C2CON__SMEN"/>
          <bitfield caption="Disable Slew Rate Control bit" mask="0x00000200" name="DISSLW" values="I2C2CON__DISSLW"/>
          <bitfield caption="10-bit Slave Address bit" mask="0x00000400" name="A10M" values="I2C2CON__A10M"/>
          <bitfield caption="Strict I 2 C Reserved Address Rule Enable bit" mask="0x00000800" name="STRICT" values="I2C2CON__STRICT"/>
          <bitfield caption="SCLx Release Control bit" mask="0x00001000" name="SCLREL" values="I2C2CON__SCLREL"/>
          <bitfield caption="Stop in Idle Mode bit" mask="0x00002000" name="SIDL" values="I2C2CON__SIDL"/>
          <bitfield caption="I2C Enable bit" mask="0x00008000" name="ON" values="I2C2CON__ON"/>
          <bitfield caption="Data Hold Enable bit" mask="0x00010000" name="DHEN" values="I2C2CON__DHEN"/>
          <bitfield caption="Address Hold Enable bit" mask="0x00020000" name="AHEN" values="I2C2CON__AHEN"/>
          <bitfield caption="Slave Mode Bus Collision Detect Enable bit" mask="0x00040000" name="SBCDE" values="I2C2CON__SBCDE"/>
          <bitfield caption="SDA Hold Time Selection bit" mask="0x00080000" name="SDAHT" values="I2C2CON__SDAHT"/>
          <bitfield caption="Buffer Overwrite Enable bit" mask="0x00100000" name="BOEN" values="I2C2CON__BOEN"/>
          <bitfield caption="Start Condition Interrupt Enable bit" mask="0x00200000" name="SCIE" values="I2C2CON__SCIE"/>
          <bitfield caption="Stop Condition Interrupt Enable bit" mask="0x00400000" name="PCIE" values="I2C2CON__PCIE"/>
        </register>
        <register caption="I2C Status Register" name="I2C1STAT" offset="0x10" rw="R" size="4">
          <bitfield caption="Transmit Buffer Full Status bit" mask="0x00000001" name="TBF" values="I2C1STAT__TBF"/>
          <bitfield caption="Receive Buffer Full Status bit" mask="0x00000002" name="RBF" values="I2C1STAT__RBF"/>
          <bitfield caption="Read/Write Information bit" mask="0x00000004" name="R_W" values="I2C1STAT__R_W"/>
          <bitfield caption="Start bit" mask="0x00000008" name="S" values="I2C1STAT__S"/>
          <bitfield caption="Stop bit" mask="0x00000010" name="P" values="I2C1STAT__P"/>
          <bitfield caption="Data/Address bit" mask="0x00000020" name="D_A" values="I2C1STAT__D_A"/>
          <bitfield caption="Receive Overflow Flag bit" mask="0x00000040" name="I2COV" values="I2C1STAT__I2COV"/>
          <bitfield caption="Write Collision Detect bit" mask="0x00000080" name="IWCOL" values="I2C1STAT__IWCOL"/>
          <bitfield caption="10-bit Address Status bit" mask="0x00000100" name="ADD10" values="I2C1STAT__ADD10"/>
          <bitfield caption="General Call Status bit" mask="0x00000200" name="GCSTAT" values="I2C1STAT__GCSTAT"/>
          <bitfield caption="Master Bus Collision Detect bit" mask="0x00000400" name="BCL" values="I2C1STAT__BCL"/>
          <bitfield caption="Acknowledge Time Status bit" mask="0x00002000" name="ACKTIM" values="I2C1STAT__ACKTIM"/>
          <bitfield caption="Transmit Status bit" mask="0x00004000" name="TRSTAT" values="I2C1STAT__TRSTAT"/>
          <bitfield caption="Acknowledge Status bit" mask="0x00008000" name="ACKSTAT" values="I2C1STAT__ACKSTAT"/>
        </register>
