Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-W_DFP/1.8.326/atdf/PIC32MZ2051W104132.atdf
        <register caption="Interrupt Priority Control Register 32" name="IPC32" offset="0x340" rw="RW" size="4">
          <bitfield caption="Interrupt subpriority" mask="0x00000003" name="AD1I22IS" values="IPC32__AD1I22IS"/>
          <bitfield caption="Interrupt priority" mask="0x0000001C" name="AD1I22IP" values="IPC32__AD1I22IP"/>
          <bitfield caption="Interrupt subpriority" mask="0x00000300" name="AD1I23IS" values="IPC32__AD1I23IS"/>
          <bitfield caption="Interrupt priority" mask="0x00001C00" name="AD1I23IP" values="IPC32__AD1I23IP"/>
        </register>
        <register caption="Interrupt Priority Control Register 35" name="IPC35" offset="0x370" rw="RW" size="4">
          <bitfield caption="Interrupt subpriority" mask="0x00030000" name="CAN1IS" values="IPC35__CAN1IS"/>
          <bitfield caption="Interrupt priority" mask="0x001C0000" name="CAN1IP" values="IPC35__CAN1IP"/>
          <bitfield caption="Interrupt subpriority" mask="0x03000000" name="CAN2RXIS" values="IPC35__CAN2RXIS"/>
          <bitfield caption="Interrupt priority" mask="0x1C000000" name="CAN2RXIP" values="IPC35__CAN2RXIP"/>
        </register>
        <register caption="Interrupt Priority Control Register 36" name="IPC36" offset="0x380" rw="RW" size="4">
          <bitfield caption="Interrupt subpriority" mask="0x00000003" name="CAN2TXIS" values="IPC36__CAN2TXIS"/>
          <bitfield caption="Interrupt priority" mask="0x0000001C" name="CAN2TXIP" values="IPC36__CAN2TXIP"/>
          <bitfield caption="Interrupt subpriority" mask="0x00000300" name="CAN2IS" values="IPC36__CAN2IS"/>
          <bitfield caption="Interrupt priority" mask="0x00001C00" name="CAN2IP" values="IPC36__CAN2IP"/>
        </register>
        <register caption="Interrupt Priority Control Register 37" name="IPC37" offset="0x390" rw="RW" size="4">
          <bitfield caption="Interrupt subpriority" mask="0x00030000" name="SQIIS" values="IPC37__SQIIS"/>
          <bitfield caption="Interrupt priority" mask="0x001C0000" name="SQIIP" values="IPC37__SQIIP"/>
        </register>
        <register caption="Interrupt Priority Control Register 38" name="IPC38" offset="0x3a0" rw="RW" size="4">
          <bitfield caption="Interrupt subpriority" mask="0x00000003" name="PTGSTEPIS" values="IPC38__PTGSTEPIS"/>
          <bitfield caption="Interrupt priority" mask="0x0000001C" name="PTGSTEPIP" values="IPC38__PTGSTEPIP"/>
          <bitfield caption="Interrupt subpriority" mask="0x00000300" name="PTGWDTIS" values="IPC38__PTGWDTIS"/>
          <bitfield caption="Interrupt priority" mask="0x00001C00" name="PTGWDTIP" values="IPC38__PTGWDTIP"/>
          <bitfield caption="Interrupt subpriority" mask="0x00030000" name="PTGTR0IS" values="IPC38__PTGTR0IS"/>
          <bitfield caption="Interrupt priority" mask="0x001C0000" name="PTGTR0IP" values="IPC38__PTGTR0IP"/>
          <bitfield caption="Interrupt subpriority" mask="0x03000000" name="PTGTR1IS" values="IPC38__PTGTR1IS"/>
          <bitfield caption="Interrupt priority" mask="0x1C000000" name="PTGTR1IP" values="IPC38__PTGTR1IP"/>
        </register>
        <register caption="Interrupt Priority Control Register 39" name="IPC39" offset="0x3b0" rw="RW" size="4">
          <bitfield caption="Interrupt subpriority" mask="0x00000003" name="PTGTR2IS" values="IPC39__PTGTR2IS"/>
          <bitfield caption="Interrupt priority" mask="0x0000001C" name="PTGTR2IP" values="IPC39__PTGTR2IP"/>
          <bitfield caption="Interrupt subpriority" mask="0x00000300" name="PTGTR3IS" values="IPC39__PTGTR3IS"/>
          <bitfield caption="Interrupt priority" mask="0x00001C00" name="PTGTR3IP" values="IPC39__PTGTR3IP"/>
        </register>
        <register caption="Interrupt Priority Control Register 40" name="IPC40" offset="0x3c0" rw="RW" size="4">
          <bitfield caption="Interrupt subpriority" mask="0x00030000" name="MPUPCIS" values="IPC40__MPUPCIS"/>
          <bitfield caption="Interrupt priority" mask="0x001C0000" name="MPUPCIP" values="IPC40__MPUPCIP"/>
          <bitfield caption="Interrupt subpriority" mask="0x03000000" name="FDCIS" values="IPC40__FDCIS"/>
          <bitfield caption="Interrupt priority" mask="0x1C000000" name="FDCIP" values="IPC40__FDCIP"/>
        </register>
        <register caption="Interrupt Priority Control Register 41" name="IPC41" offset="0x3d0" rw="RW" size="4">
          <bitfield caption="Interrupt subpriority" mask="0x00000003" name="CRPTIS" values="IPC41__CRPTIS"/>
          <bitfield caption="Interrupt priority" mask="0x0000001C" name="CRPTIP" values="IPC41__CRPTIP"/>
          <bitfield caption="Interrupt subpriority" mask="0x00000300" name="ETHIS" values="IPC41__ETHIS"/>
          <bitfield caption="Interrupt priority" mask="0x00001C00" name="ETHIP" values="IPC41__ETHIP"/>
          <bitfield caption="Interrupt subpriority" mask="0x00030000" name="CRPT1IS" values="IPC41__CRPT1IS"/>
          <bitfield caption="Interrupt priority" mask="0x001C0000" name="CRPT1IP" values="IPC41__CRPT1IP"/>
          <bitfield caption="Interrupt subpriority" mask="0x03000000" name="CRPT1EIS" values="IPC41__CRPT1EIS"/>
          <bitfield caption="Interrupt priority" mask="0x1C000000" name="CRPT1EIP" values="IPC41__CRPT1EIP"/>
        </register>
        <register caption="Interrupt Priority Control Register 42" name="IPC42" offset="0x3e0" rw="RW" size="4">
          <bitfield caption="Interrupt subpriority" mask="0x00000003" name="CVDIS" values="IPC42__CVDIS"/>
          <bitfield caption="Interrupt priority" mask="0x0000001C" name="CVDIP" values="IPC42__CVDIP"/>
        </register>
        <register caption="Interrupt Vector Address Offset Register" name="OFF000" offset="0x540" rw="RW" size="4">
          <bitfield caption="Interrupt Vector 000 Address Offset bits" mask="0x0003FFFE" name="VOFF" values="OFF000__VOFF"/>
        </register>
        <register caption="Interrupt Vector Address Offset Register" name="OFF001" offset="0x544" rw="RW" size="4">
          <bitfield caption="Interrupt Vector 001 Address Offset bits" mask="0x0003FFFE" name="VOFF" values="OFF001__VOFF"/>
        </register>
