Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-W_DFP/1.8.326/atdf/PIC32MZ2051W104132.atdf
        <register caption="Interrupt Vector Address Offset Register" name="OFF058" offset="0x628" rw="RW" size="4">
          <bitfield caption="Interrupt Vector 058 Address Offset bits" mask="0x0003FFFE" name="VOFF" values="OFF058__VOFF"/>
        </register>
        <register caption="Interrupt Vector Address Offset Register" name="OFF059" offset="0x62c" rw="RW" size="4">
          <bitfield caption="Interrupt Vector 059 Address Offset bits" mask="0x0003FFFE" name="VOFF" values="OFF059__VOFF"/>
        </register>
        <register caption="Interrupt Vector Address Offset Register" name="OFF060" offset="0x630" rw="RW" size="4">
          <bitfield caption="Interrupt Vector 060 Address Offset bits" mask="0x0003FFFE" name="VOFF" values="OFF060__VOFF"/>
        </register>
        <register caption="Interrupt Vector Address Offset Register" name="OFF061" offset="0x634" rw="RW" size="4">
          <bitfield caption="Interrupt Vector 061 Address Offset bits" mask="0x0003FFFE" name="VOFF" values="OFF061__VOFF"/>
        </register>
        <register caption="Interrupt Vector Address Offset Register" name="OFF062" offset="0x638" rw="RW" size="4">
          <bitfield caption="Interrupt Vector 062 Address Offset bits" mask="0x0003FFFE" name="VOFF" values="OFF062__VOFF"/>
        </register>
        <register caption="Interrupt Vector Address Offset Register" name="OFF063" offset="0x63c" rw="RW" size="4">
          <bitfield caption="Interrupt Vector 063 Address Offset bits" mask="0x0003FFFE" name="VOFF" values="OFF063__VOFF"/>
        </register>
        <register caption="Interrupt Vector Address Offset Register" name="OFF064" offset="0x640" rw="RW" size="4">
          <bitfield caption="Interrupt Vector 064 Address Offset bits" mask="0x0003FFFE" name="VOFF" values="OFF064__VOFF"/>
        </register>
        <register caption="Interrupt Vector Address Offset Register" name="OFF068" offset="0x650" rw="RW" size="4">
          <bitfield caption="Interrupt Vector 068 Address Offset bits" mask="0x0003FFFE" name="VOFF" values="OFF068__VOFF"/>
        </register>
        <register caption="Interrupt Vector Address Offset Register" name="OFF069" offset="0x654" rw="RW" size="4">
          <bitfield caption="Interrupt Vector 069 Address Offset bits" mask="0x0003FFFE" name="VOFF" values="OFF069__VOFF"/>
        </register>
        <register caption="Interrupt Vector Address Offset Register" name="OFF070" offset="0x658" rw="RW" size="4">
          <bitfield caption="Interrupt Vector 070 Address Offset bits" mask="0x0003FFFE" name="VOFF" values="OFF070__VOFF"/>
        </register>
        <register caption="Interrupt Vector Address Offset Register" name="OFF071" offset="0x65c" rw="RW" size="4">
          <bitfield caption="Interrupt Vector 071 Address Offset bits" mask="0x0003FFFE" name="VOFF" values="OFF071__VOFF"/>
        </register>
        <register caption="Interrupt Vector Address Offset Register" name="OFF072" offset="0x660" rw="RW" size="4">
          <bitfield caption="Interrupt Vector 072 Address Offset bits" mask="0x0003FFFE" name="VOFF" values="OFF072__VOFF"/>
        </register>
        <register caption="Interrupt Vector Address Offset Register" name="OFF073" offset="0x664" rw="RW" size="4">
          <bitfield caption="Interrupt Vector 073 Address Offset bits" mask="0x0003FFFE" name="VOFF" values="OFF073__VOFF"/>
        </register>
        <register caption="Interrupt Vector Address Offset Register" name="OFF074" offset="0x668" rw="RW" size="4">
          <bitfield caption="Interrupt Vector 074 Address Offset bits" mask="0x0003FFFE" name="VOFF" values="OFF074__VOFF"/>
        </register>
        <register caption="Interrupt Vector Address Offset Register" name="OFF075" offset="0x66c" rw="RW" size="4">
          <bitfield caption="Interrupt Vector 075 Address Offset bits" mask="0x0003FFFE" name="VOFF" values="OFF075__VOFF"/>
        </register>
        <register caption="Interrupt Vector Address Offset Register" name="OFF076" offset="0x670" rw="RW" size="4">
          <bitfield caption="Interrupt Vector 076 Address Offset bits" mask="0x0003FFFE" name="VOFF" values="OFF076__VOFF"/>
        </register>
        <register caption="Interrupt Vector Address Offset Register" name="OFF080" offset="0x680" rw="RW" size="4">
          <bitfield caption="Interrupt Vector 080 Address Offset bits" mask="0x0003FFFE" name="VOFF" values="OFF080__VOFF"/>
        </register>
        <register caption="Interrupt Vector Address Offset Register" name="OFF083" offset="0x68c" rw="RW" size="4">
          <bitfield caption="Interrupt Vector 083 Address Offset bits" mask="0x0003FFFE" name="VOFF" values="OFF083__VOFF"/>
        </register>
        <register caption="Interrupt Vector Address Offset Register" name="OFF084" offset="0x690" rw="RW" size="4">
          <bitfield caption="Interrupt Vector 084 Address Offset bits" mask="0x0003FFFE" name="VOFF" values="OFF084__VOFF"/>
        </register>
        <register caption="Interrupt Vector Address Offset Register" name="OFF085" offset="0x694" rw="RW" size="4">
          <bitfield caption="Interrupt Vector 085 Address Offset bits" mask="0x0003FFFE" name="VOFF" values="OFF085__VOFF"/>
        </register>
        <register caption="Interrupt Vector Address Offset Register" name="OFF086" offset="0x698" rw="RW" size="4">
          <bitfield caption="Interrupt Vector 086 Address Offset bits" mask="0x0003FFFE" name="VOFF" values="OFF086__VOFF"/>
        </register>
        <register caption="Interrupt Vector Address Offset Register" name="OFF087" offset="0x69c" rw="RW" size="4">
          <bitfield caption="Interrupt Vector 087 Address Offset bits" mask="0x0003FFFE" name="VOFF" values="OFF087__VOFF"/>
        </register>
        <register caption="Interrupt Vector Address Offset Register" name="OFF088" offset="0x6a0" rw="RW" size="4">
          <bitfield caption="Interrupt Vector 088 Address Offset bits" mask="0x0003FFFE" name="VOFF" values="OFF088__VOFF"/>
        </register>
        <register caption="Interrupt Vector Address Offset Register" name="OFF089" offset="0x6a4" rw="RW" size="4">
          <bitfield caption="Interrupt Vector 089 Address Offset bits" mask="0x0003FFFE" name="VOFF" values="OFF089__VOFF"/>
        </register>
        <register caption="Interrupt Vector Address Offset Register" name="OFF090" offset="0x6a8" rw="RW" size="4">
          <bitfield caption="Interrupt Vector 090 Address Offset bits" mask="0x0003FFFE" name="VOFF" values="OFF090__VOFF"/>
        </register>
        <register caption="Interrupt Vector Address Offset Register" name="OFF091" offset="0x6ac" rw="RW" size="4">
          <bitfield caption="Interrupt Vector 091 Address Offset bits" mask="0x0003FFFE" name="VOFF" values="OFF091__VOFF"/>
        </register>
        <register caption="Interrupt Vector Address Offset Register" name="OFF092" offset="0x6b0" rw="RW" size="4">
          <bitfield caption="Interrupt Vector 092 Address Offset bits" mask="0x0003FFFE" name="VOFF" values="OFF092__VOFF"/>
        </register>
        <register caption="Interrupt Vector Address Offset Register" name="OFF094" offset="0x6b8" rw="RW" size="4">
          <bitfield caption="Interrupt Vector 094 Address Offset bits" mask="0x0003FFFE" name="VOFF" values="OFF094__VOFF"/>
        </register>
