Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-W_DFP/1.8.326/atdf/PIC32MZ2051W104132.atdf
      <value-group caption="Interrupt Flag Status bit 30" name="IFS0__FCEIF">
        <value caption="Interrupt request has occurred" name="" value="0x1"/>
        <value caption="No interrupt request has occurred" name="" value="0x0"/>
      </value-group>
      <value-group caption="Interrupt Flag Status bit 31" name="IFS0__PREIF">
        <value caption="Interrupt request has occurred" name="" value="0x1"/>
        <value caption="No interrupt request has occurred" name="" value="0x0"/>
      </value-group>
      <value-group caption="Interrupt Flag Status bit 0" name="IFS1__PFWCRCIF">
        <value caption="Interrupt request has occurred" name="" value="0x1"/>
        <value caption="No interrupt request has occurred" name="" value="0x0"/>
      </value-group>
      <value-group caption="Interrupt Flag Status bit 1" name="IFS1__RTCCIF">
        <value caption="Interrupt request has occurred" name="" value="0x1"/>
        <value caption="No interrupt request has occurred" name="" value="0x0"/>
      </value-group>
      <value-group caption="Interrupt Flag Status bit 2" name="IFS1__USBIF">
        <value caption="Interrupt request has occurred" name="" value="0x1"/>
        <value caption="No interrupt request has occurred" name="" value="0x0"/>
      </value-group>
      <value-group caption="Interrupt Flag Status bit 3" name="IFS1__SPI1EIF">
        <value caption="Interrupt request has occurred" name="" value="0x1"/>
        <value caption="No interrupt request has occurred" name="" value="0x0"/>
      </value-group>
      <value-group caption="Interrupt Flag Status bit 4" name="IFS1__SPI1RXIF">
        <value caption="Interrupt request has occurred" name="" value="0x1"/>
        <value caption="No interrupt request has occurred" name="" value="0x0"/>
      </value-group>
      <value-group caption="Interrupt Flag Status bit 5" name="IFS1__SPI1TXIF">
        <value caption="Interrupt request has occurred" name="" value="0x1"/>
        <value caption="No interrupt request has occurred" name="" value="0x0"/>
      </value-group>
      <value-group caption="Interrupt Flag Status bit 6" name="IFS1__U1EIF">
        <value caption="Interrupt request has occurred" name="" value="0x1"/>
        <value caption="No interrupt request has occurred" name="" value="0x0"/>
      </value-group>
      <value-group caption="Interrupt Flag Status bit 7" name="IFS1__U1RXIF">
        <value caption="Interrupt request has occurred" name="" value="0x1"/>
        <value caption="No interrupt request has occurred" name="" value="0x0"/>
      </value-group>
      <value-group caption="Interrupt Flag Status bit 8" name="IFS1__U1TXIF">
        <value caption="Interrupt request has occurred" name="" value="0x1"/>
        <value caption="No interrupt request has occurred" name="" value="0x0"/>
      </value-group>
      <value-group caption="Interrupt Flag Status bit 9" name="IFS1__I2C1BIF">
        <value caption="Interrupt request has occurred" name="" value="0x1"/>
        <value caption="No interrupt request has occurred" name="" value="0x0"/>
      </value-group>
      <value-group caption="Interrupt Flag Status bit 10" name="IFS1__I2C1SIF">
        <value caption="Interrupt request has occurred" name="" value="0x1"/>
        <value caption="No interrupt request has occurred" name="" value="0x0"/>
      </value-group>
      <value-group caption="Interrupt Flag Status bit 11" name="IFS1__I2C1MIF">
        <value caption="Interrupt request has occurred" name="" value="0x1"/>
        <value caption="No interrupt request has occurred" name="" value="0x0"/>
      </value-group>
      <value-group caption="Interrupt Flag Status bit 12" name="IFS1__CNAIF">
        <value caption="Interrupt request has occurred" name="" value="0x1"/>
        <value caption="No interrupt request has occurred" name="" value="0x0"/>
      </value-group>
      <value-group caption="Interrupt Flag Status bit 13" name="IFS1__CNBIF">
        <value caption="Interrupt request has occurred" name="" value="0x1"/>
        <value caption="No interrupt request has occurred" name="" value="0x0"/>
      </value-group>
      <value-group caption="Interrupt Flag Status bit 14" name="IFS1__CNCIF">
        <value caption="Interrupt request has occurred" name="" value="0x1"/>
        <value caption="No interrupt request has occurred" name="" value="0x0"/>
      </value-group>
      <value-group caption="Interrupt Flag Status bit 15" name="IFS1__CNKIF">
        <value caption="Interrupt request has occurred" name="" value="0x1"/>
        <value caption="No interrupt request has occurred" name="" value="0x0"/>
      </value-group>
      <value-group caption="Interrupt Flag Status bit 21" name="IFS1__SPI2EIF">
        <value caption="Interrupt request has occurred" name="" value="0x1"/>
        <value caption="No interrupt request has occurred" name="" value="0x0"/>
      </value-group>
      <value-group caption="Interrupt Flag Status bit 22" name="IFS1__SPI2RXIF">
        <value caption="Interrupt request has occurred" name="" value="0x1"/>
        <value caption="No interrupt request has occurred" name="" value="0x0"/>
      </value-group>
      <value-group caption="Interrupt Flag Status bit 23" name="IFS1__SPI2TXIF">
        <value caption="Interrupt request has occurred" name="" value="0x1"/>
        <value caption="No interrupt request has occurred" name="" value="0x0"/>
      </value-group>
      <value-group caption="Interrupt Flag Status bit 24" name="IFS1__U2EIF">
        <value caption="Interrupt request has occurred" name="" value="0x1"/>
        <value caption="No interrupt request has occurred" name="" value="0x0"/>
      </value-group>
      <value-group caption="Interrupt Flag Status bit 25" name="IFS1__U2RXIF">
        <value caption="Interrupt request has occurred" name="" value="0x1"/>
        <value caption="No interrupt request has occurred" name="" value="0x0"/>
      </value-group>
      <value-group caption="Interrupt Flag Status bit 26" name="IFS1__U2TXIF">
        <value caption="Interrupt request has occurred" name="" value="0x1"/>
        <value caption="No interrupt request has occurred" name="" value="0x0"/>
      </value-group>
