Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-W_DFP/1.8.326/atdf/PIC32MZ2051W104132.atdf
      <value-group caption="Interrupt Flag Status bit 31" name="IFS2__ADCDC2IF">
        <value caption="Interrupt request has occurred" name="" value="0x1"/>
        <value caption="No interrupt request has occurred" name="" value="0x0"/>
      </value-group>
      <value-group caption="Interrupt Flag Status bit 0" name="IFS3__ADCDF1IF">
        <value caption="Interrupt request has occurred" name="" value="0x1"/>
        <value caption="No interrupt request has occurred" name="" value="0x0"/>
      </value-group>
      <value-group caption="Interrupt Flag Status bit 1" name="IFS3__ADCDF2IF">
        <value caption="Interrupt request has occurred" name="" value="0x1"/>
        <value caption="No interrupt request has occurred" name="" value="0x0"/>
      </value-group>
      <value-group caption="Interrupt Flag Status bit 4" name="IFS3__ADCFLTIF">
        <value caption="Interrupt request has occurred" name="" value="0x1"/>
        <value caption="No interrupt request has occurred" name="" value="0x0"/>
      </value-group>
      <value-group caption="Interrupt Flag Status bit 5" name="IFS3__ADCEOSIF">
        <value caption="Interrupt request has occurred" name="" value="0x1"/>
        <value caption="No interrupt request has occurred" name="" value="0x0"/>
      </value-group>
      <value-group caption="Interrupt Flag Status bit 6" name="IFS3__ADCARDYIF">
        <value caption="Interrupt request has occurred" name="" value="0x1"/>
        <value caption="No interrupt request has occurred" name="" value="0x0"/>
      </value-group>
      <value-group caption="Interrupt Flag Status bit 7" name="IFS3__ADCURDYIF">
        <value caption="Interrupt request has occurred" name="" value="0x1"/>
        <value caption="No interrupt request has occurred" name="" value="0x0"/>
      </value-group>
      <value-group caption="Interrupt Flag Status bit 8" name="IFS3__ADCFCBTIF">
        <value caption="Interrupt request has occurred" name="" value="0x1"/>
        <value caption="No interrupt request has occurred" name="" value="0x0"/>
      </value-group>
      <value-group caption="Interrupt Flag Status bit 10" name="IFS3__ADCD0IF">
        <value caption="Interrupt request has occurred" name="" value="0x1"/>
        <value caption="No interrupt request has occurred" name="" value="0x0"/>
      </value-group>
      <value-group caption="Interrupt Flag Status bit 11" name="IFS3__ADCD1IF">
        <value caption="Interrupt request has occurred" name="" value="0x1"/>
        <value caption="No interrupt request has occurred" name="" value="0x0"/>
      </value-group>
      <value-group caption="Interrupt Flag Status bit 12" name="IFS3__ADCD2IF">
        <value caption="Interrupt request has occurred" name="" value="0x1"/>
        <value caption="No interrupt request has occurred" name="" value="0x0"/>
      </value-group>
      <value-group caption="Interrupt Flag Status bit 13" name="IFS3__ADCD3IF">
        <value caption="Interrupt request has occurred" name="" value="0x1"/>
        <value caption="No interrupt request has occurred" name="" value="0x0"/>
      </value-group>
      <value-group caption="Interrupt Flag Status bit 14" name="IFS3__ADCD4IF">
        <value caption="Interrupt request has occurred" name="" value="0x1"/>
        <value caption="No interrupt request has occurred" name="" value="0x0"/>
      </value-group>
      <value-group caption="Interrupt Flag Status bit 15" name="IFS3__ADCD5IF">
        <value caption="Interrupt request has occurred" name="" value="0x1"/>
        <value caption="No interrupt request has occurred" name="" value="0x0"/>
      </value-group>
      <value-group caption="Interrupt Flag Status bit 16" name="IFS3__ADCD6IF">
        <value caption="Interrupt request has occurred" name="" value="0x1"/>
        <value caption="No interrupt request has occurred" name="" value="0x0"/>
      </value-group>
      <value-group caption="Interrupt Flag Status bit 17" name="IFS3__ADCD7IF">
        <value caption="Interrupt request has occurred" name="" value="0x1"/>
        <value caption="No interrupt request has occurred" name="" value="0x0"/>
      </value-group>
      <value-group caption="Interrupt Flag Status bit 18" name="IFS3__ADCD8IF">
        <value caption="Interrupt request has occurred" name="" value="0x1"/>
        <value caption="No interrupt request has occurred" name="" value="0x0"/>
      </value-group>
      <value-group caption="Interrupt Flag Status bit 19" name="IFS3__ADCD9IF">
        <value caption="Interrupt request has occurred" name="" value="0x1"/>
        <value caption="No interrupt request has occurred" name="" value="0x0"/>
      </value-group>
      <value-group caption="Interrupt Flag Status bit 20" name="IFS3__ADCD10IF">
        <value caption="Interrupt request has occurred" name="" value="0x1"/>
        <value caption="No interrupt request has occurred" name="" value="0x0"/>
      </value-group>
      <value-group caption="Interrupt Flag Status bit 21" name="IFS3__ADCD11IF">
        <value caption="Interrupt request has occurred" name="" value="0x1"/>
        <value caption="No interrupt request has occurred" name="" value="0x0"/>
      </value-group>
      <value-group caption="Interrupt Flag Status bit 22" name="IFS3__ADCD12IF">
        <value caption="Interrupt request has occurred" name="" value="0x1"/>
        <value caption="No interrupt request has occurred" name="" value="0x0"/>
      </value-group>
      <value-group caption="Interrupt Flag Status bit 23" name="IFS3__ADCD13IF">
        <value caption="Interrupt request has occurred" name="" value="0x1"/>
        <value caption="No interrupt request has occurred" name="" value="0x0"/>
      </value-group>
      <value-group caption="Interrupt Flag Status bit 24" name="IFS3__ADCD14IF">
        <value caption="Interrupt request has occurred" name="" value="0x1"/>
        <value caption="No interrupt request has occurred" name="" value="0x0"/>
      </value-group>
      <value-group caption="Interrupt Flag Status bit 25" name="IFS3__ADCD15IF">
        <value caption="Interrupt request has occurred" name="" value="0x1"/>
        <value caption="No interrupt request has occurred" name="" value="0x0"/>
      </value-group>
