Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-W_DFP/1.8.326/atdf/PIC32MZ2051W104132.atdf
      <value-group caption="Interrupt Enable bit 7" name="IEC5__CRPT1EIE">
        <value caption="Interrupt is enabled" name="" value="0x1"/>
        <value caption="Interrupt is disabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="Interrupt subpriority" name="IPC0__CTIS">
        <value caption="Interrupt subpriority is 3" name="" value="0x3"/>
        <value caption="Interrupt subpriority is 2" name="" value="0x2"/>
        <value caption="Interrupt subpriority is 1" name="" value="0x1"/>
        <value caption="Interrupt subpriority is 0" name="" value="0x0"/>
      </value-group>
      <value-group caption="Interrupt priority" name="IPC0__CTIP">
        <value caption="Interrupt priority is 7" name="" value="0x7"/>
        <value caption="Interrupt priority is 6" name="" value="0x6"/>
        <value caption="Interrupt priority is 5" name="" value="0x5"/>
        <value caption="Interrupt priority is 4" name="" value="0x4"/>
        <value caption="Interrupt priority is 3" name="" value="0x3"/>
        <value caption="Interrupt priority is 2" name="" value="0x2"/>
        <value caption="Interrupt priority is 1" name="" value="0x1"/>
        <value caption="Interrupt is disabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="Interrupt subpriority" name="IPC0__CS0IS">
        <value caption="Interrupt subpriority is 3" name="" value="0x3"/>
        <value caption="Interrupt subpriority is 2" name="" value="0x2"/>
        <value caption="Interrupt subpriority is 1" name="" value="0x1"/>
        <value caption="Interrupt subpriority is 0" name="" value="0x0"/>
      </value-group>
      <value-group caption="Interrupt priority" name="IPC0__CS0IP">
        <value caption="Interrupt priority is 7" name="" value="0x7"/>
        <value caption="Interrupt priority is 6" name="" value="0x6"/>
        <value caption="Interrupt priority is 5" name="" value="0x5"/>
        <value caption="Interrupt priority is 4" name="" value="0x4"/>
        <value caption="Interrupt priority is 3" name="" value="0x3"/>
        <value caption="Interrupt priority is 2" name="" value="0x2"/>
        <value caption="Interrupt priority is 1" name="" value="0x1"/>
        <value caption="Interrupt is disabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="Interrupt subpriority" name="IPC0__CS1IS">
        <value caption="Interrupt subpriority is 3" name="" value="0x3"/>
        <value caption="Interrupt subpriority is 2" name="" value="0x2"/>
        <value caption="Interrupt subpriority is 1" name="" value="0x1"/>
        <value caption="Interrupt subpriority is 0" name="" value="0x0"/>
      </value-group>
      <value-group caption="Interrupt priority" name="IPC0__CS1IP">
        <value caption="Interrupt priority is 7" name="" value="0x7"/>
        <value caption="Interrupt priority is 6" name="" value="0x6"/>
        <value caption="Interrupt priority is 5" name="" value="0x5"/>
        <value caption="Interrupt priority is 4" name="" value="0x4"/>
        <value caption="Interrupt priority is 3" name="" value="0x3"/>
        <value caption="Interrupt priority is 2" name="" value="0x2"/>
        <value caption="Interrupt priority is 1" name="" value="0x1"/>
        <value caption="Interrupt is disabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="Interrupt subpriority" name="IPC0__INT0IS">
        <value caption="Interrupt subpriority is 3" name="" value="0x3"/>
        <value caption="Interrupt subpriority is 2" name="" value="0x2"/>
        <value caption="Interrupt subpriority is 1" name="" value="0x1"/>
        <value caption="Interrupt subpriority is 0" name="" value="0x0"/>
      </value-group>
      <value-group caption="Interrupt priority" name="IPC0__INT0IP">
        <value caption="Interrupt priority is 7" name="" value="0x7"/>
        <value caption="Interrupt priority is 6" name="" value="0x6"/>
        <value caption="Interrupt priority is 5" name="" value="0x5"/>
        <value caption="Interrupt priority is 4" name="" value="0x4"/>
        <value caption="Interrupt priority is 3" name="" value="0x3"/>
        <value caption="Interrupt priority is 2" name="" value="0x2"/>
        <value caption="Interrupt priority is 1" name="" value="0x1"/>
        <value caption="Interrupt is disabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="Interrupt subpriority" name="IPC1__T1IS">
        <value caption="Interrupt subpriority is 3" name="" value="0x3"/>
        <value caption="Interrupt subpriority is 2" name="" value="0x2"/>
        <value caption="Interrupt subpriority is 1" name="" value="0x1"/>
        <value caption="Interrupt subpriority is 0" name="" value="0x0"/>
      </value-group>
      <value-group caption="Interrupt priority" name="IPC1__T1IP">
        <value caption="Interrupt priority is 7" name="" value="0x7"/>
        <value caption="Interrupt priority is 6" name="" value="0x6"/>
        <value caption="Interrupt priority is 5" name="" value="0x5"/>
        <value caption="Interrupt priority is 4" name="" value="0x4"/>
        <value caption="Interrupt priority is 3" name="" value="0x3"/>
        <value caption="Interrupt priority is 2" name="" value="0x2"/>
        <value caption="Interrupt priority is 1" name="" value="0x1"/>
        <value caption="Interrupt is disabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="Interrupt subpriority" name="IPC1__IC1EIS">
        <value caption="Interrupt subpriority is 3" name="" value="0x3"/>
        <value caption="Interrupt subpriority is 2" name="" value="0x2"/>
        <value caption="Interrupt subpriority is 1" name="" value="0x1"/>
        <value caption="Interrupt subpriority is 0" name="" value="0x0"/>
      </value-group>
      <value-group caption="Interrupt priority" name="IPC1__IC1EIP">
        <value caption="Interrupt priority is 7" name="" value="0x7"/>
        <value caption="Interrupt priority is 6" name="" value="0x6"/>
        <value caption="Interrupt priority is 5" name="" value="0x5"/>
        <value caption="Interrupt priority is 4" name="" value="0x4"/>
        <value caption="Interrupt priority is 3" name="" value="0x3"/>
        <value caption="Interrupt priority is 2" name="" value="0x2"/>
        <value caption="Interrupt priority is 1" name="" value="0x1"/>
        <value caption="Interrupt is disabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="Interrupt subpriority" name="IPC1__IC1IS">
        <value caption="Interrupt subpriority is 3" name="" value="0x3"/>
        <value caption="Interrupt subpriority is 2" name="" value="0x2"/>
        <value caption="Interrupt subpriority is 1" name="" value="0x1"/>
        <value caption="Interrupt subpriority is 0" name="" value="0x0"/>
      </value-group>
      <value-group caption="Interrupt priority" name="IPC1__IC1IP">
        <value caption="Interrupt priority is 7" name="" value="0x7"/>
        <value caption="Interrupt priority is 6" name="" value="0x6"/>
        <value caption="Interrupt priority is 5" name="" value="0x5"/>
        <value caption="Interrupt priority is 4" name="" value="0x4"/>
        <value caption="Interrupt priority is 3" name="" value="0x3"/>
        <value caption="Interrupt priority is 2" name="" value="0x2"/>
        <value caption="Interrupt priority is 1" name="" value="0x1"/>
        <value caption="Interrupt is disabled" name="" value="0x0"/>
      </value-group>
