Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-W_DFP/1.8.326/atdf/PIC32MZ2051W104132.atdf
      <value-group caption="Interrupt priority" name="IPC14__U2EIP">
        <value caption="Interrupt priority is 7" name="" value="0x7"/>
        <value caption="Interrupt priority is 6" name="" value="0x6"/>
        <value caption="Interrupt priority is 5" name="" value="0x5"/>
        <value caption="Interrupt priority is 4" name="" value="0x4"/>
        <value caption="Interrupt priority is 3" name="" value="0x3"/>
        <value caption="Interrupt priority is 2" name="" value="0x2"/>
        <value caption="Interrupt priority is 1" name="" value="0x1"/>
        <value caption="Interrupt is disabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="Interrupt subpriority" name="IPC14__U2RXIS">
        <value caption="Interrupt subpriority is 3" name="" value="0x3"/>
        <value caption="Interrupt subpriority is 2" name="" value="0x2"/>
        <value caption="Interrupt subpriority is 1" name="" value="0x1"/>
        <value caption="Interrupt subpriority is 0" name="" value="0x0"/>
      </value-group>
      <value-group caption="Interrupt priority" name="IPC14__U2RXIP">
        <value caption="Interrupt priority is 7" name="" value="0x7"/>
        <value caption="Interrupt priority is 6" name="" value="0x6"/>
        <value caption="Interrupt priority is 5" name="" value="0x5"/>
        <value caption="Interrupt priority is 4" name="" value="0x4"/>
        <value caption="Interrupt priority is 3" name="" value="0x3"/>
        <value caption="Interrupt priority is 2" name="" value="0x2"/>
        <value caption="Interrupt priority is 1" name="" value="0x1"/>
        <value caption="Interrupt is disabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="Interrupt subpriority" name="IPC14__U2TXIS">
        <value caption="Interrupt subpriority is 3" name="" value="0x3"/>
        <value caption="Interrupt subpriority is 2" name="" value="0x2"/>
        <value caption="Interrupt subpriority is 1" name="" value="0x1"/>
        <value caption="Interrupt subpriority is 0" name="" value="0x0"/>
      </value-group>
      <value-group caption="Interrupt priority" name="IPC14__U2TXIP">
        <value caption="Interrupt priority is 7" name="" value="0x7"/>
        <value caption="Interrupt priority is 6" name="" value="0x6"/>
        <value caption="Interrupt priority is 5" name="" value="0x5"/>
        <value caption="Interrupt priority is 4" name="" value="0x4"/>
        <value caption="Interrupt priority is 3" name="" value="0x3"/>
        <value caption="Interrupt priority is 2" name="" value="0x2"/>
        <value caption="Interrupt priority is 1" name="" value="0x1"/>
        <value caption="Interrupt is disabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="Interrupt subpriority" name="IPC14__I2C2BIS">
        <value caption="Interrupt subpriority is 3" name="" value="0x3"/>
        <value caption="Interrupt subpriority is 2" name="" value="0x2"/>
        <value caption="Interrupt subpriority is 1" name="" value="0x1"/>
        <value caption="Interrupt subpriority is 0" name="" value="0x0"/>
      </value-group>
      <value-group caption="Interrupt priority" name="IPC14__I2C2BIP">
        <value caption="Interrupt priority is 7" name="" value="0x7"/>
        <value caption="Interrupt priority is 6" name="" value="0x6"/>
        <value caption="Interrupt priority is 5" name="" value="0x5"/>
        <value caption="Interrupt priority is 4" name="" value="0x4"/>
        <value caption="Interrupt priority is 3" name="" value="0x3"/>
        <value caption="Interrupt priority is 2" name="" value="0x2"/>
        <value caption="Interrupt priority is 1" name="" value="0x1"/>
        <value caption="Interrupt is disabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="Interrupt subpriority" name="IPC15__I2C2SIS">
        <value caption="Interrupt subpriority is 3" name="" value="0x3"/>
        <value caption="Interrupt subpriority is 2" name="" value="0x2"/>
        <value caption="Interrupt subpriority is 1" name="" value="0x1"/>
        <value caption="Interrupt subpriority is 0" name="" value="0x0"/>
      </value-group>
      <value-group caption="Interrupt priority" name="IPC15__I2C2SIP">
        <value caption="Interrupt priority is 7" name="" value="0x7"/>
        <value caption="Interrupt priority is 6" name="" value="0x6"/>
        <value caption="Interrupt priority is 5" name="" value="0x5"/>
        <value caption="Interrupt priority is 4" name="" value="0x4"/>
        <value caption="Interrupt priority is 3" name="" value="0x3"/>
        <value caption="Interrupt priority is 2" name="" value="0x2"/>
        <value caption="Interrupt priority is 1" name="" value="0x1"/>
        <value caption="Interrupt is disabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="Interrupt subpriority" name="IPC15__I2C2MIS">
        <value caption="Interrupt subpriority is 3" name="" value="0x3"/>
        <value caption="Interrupt subpriority is 2" name="" value="0x2"/>
        <value caption="Interrupt subpriority is 1" name="" value="0x1"/>
        <value caption="Interrupt subpriority is 0" name="" value="0x0"/>
      </value-group>
      <value-group caption="Interrupt priority" name="IPC15__I2C2MIP">
        <value caption="Interrupt priority is 7" name="" value="0x7"/>
        <value caption="Interrupt priority is 6" name="" value="0x6"/>
        <value caption="Interrupt priority is 5" name="" value="0x5"/>
        <value caption="Interrupt priority is 4" name="" value="0x4"/>
        <value caption="Interrupt priority is 3" name="" value="0x3"/>
        <value caption="Interrupt priority is 2" name="" value="0x2"/>
        <value caption="Interrupt priority is 1" name="" value="0x1"/>
        <value caption="Interrupt is disabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="Interrupt subpriority" name="IPC15__U3EIS">
        <value caption="Interrupt subpriority is 3" name="" value="0x3"/>
        <value caption="Interrupt subpriority is 2" name="" value="0x2"/>
        <value caption="Interrupt subpriority is 1" name="" value="0x1"/>
        <value caption="Interrupt subpriority is 0" name="" value="0x0"/>
      </value-group>
      <value-group caption="Interrupt priority" name="IPC15__U3EIP">
        <value caption="Interrupt priority is 7" name="" value="0x7"/>
        <value caption="Interrupt priority is 6" name="" value="0x6"/>
        <value caption="Interrupt priority is 5" name="" value="0x5"/>
        <value caption="Interrupt priority is 4" name="" value="0x4"/>
        <value caption="Interrupt priority is 3" name="" value="0x3"/>
        <value caption="Interrupt priority is 2" name="" value="0x2"/>
        <value caption="Interrupt priority is 1" name="" value="0x1"/>
        <value caption="Interrupt is disabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="Interrupt subpriority" name="IPC15__U3RXIS">
        <value caption="Interrupt subpriority is 3" name="" value="0x3"/>
        <value caption="Interrupt subpriority is 2" name="" value="0x2"/>
        <value caption="Interrupt subpriority is 1" name="" value="0x1"/>
        <value caption="Interrupt subpriority is 0" name="" value="0x0"/>
      </value-group>
