Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-W_DFP/1.8.326/atdf/PIC32MZ2051W104132.atdf
      <value-group caption="Interrupt priority" name="IPC22__CTRTRGIP">
        <value caption="Interrupt priority is 7" name="" value="0x7"/>
        <value caption="Interrupt priority is 6" name="" value="0x6"/>
        <value caption="Interrupt priority is 5" name="" value="0x5"/>
        <value caption="Interrupt priority is 4" name="" value="0x4"/>
        <value caption="Interrupt priority is 3" name="" value="0x3"/>
        <value caption="Interrupt priority is 2" name="" value="0x2"/>
        <value caption="Interrupt priority is 1" name="" value="0x1"/>
        <value caption="Interrupt is disabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="Interrupt subpriority" name="IPC22__RFWCOEIS">
        <value caption="Interrupt subpriority is 3" name="" value="0x3"/>
        <value caption="Interrupt subpriority is 2" name="" value="0x2"/>
        <value caption="Interrupt subpriority is 1" name="" value="0x1"/>
        <value caption="Interrupt subpriority is 0" name="" value="0x0"/>
      </value-group>
      <value-group caption="Interrupt priority" name="IPC22__RFWCOEIP">
        <value caption="Interrupt priority is 7" name="" value="0x7"/>
        <value caption="Interrupt priority is 6" name="" value="0x6"/>
        <value caption="Interrupt priority is 5" name="" value="0x5"/>
        <value caption="Interrupt priority is 4" name="" value="0x4"/>
        <value caption="Interrupt priority is 3" name="" value="0x3"/>
        <value caption="Interrupt priority is 2" name="" value="0x2"/>
        <value caption="Interrupt priority is 1" name="" value="0x1"/>
        <value caption="Interrupt is disabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="Interrupt subpriority" name="IPC23__AD1IS">
        <value caption="Interrupt subpriority is 3" name="" value="0x3"/>
        <value caption="Interrupt subpriority is 2" name="" value="0x2"/>
        <value caption="Interrupt subpriority is 1" name="" value="0x1"/>
        <value caption="Interrupt subpriority is 0" name="" value="0x0"/>
      </value-group>
      <value-group caption="Interrupt priority" name="IPC23__AD1IP">
        <value caption="Interrupt priority is 7" name="" value="0x7"/>
        <value caption="Interrupt priority is 6" name="" value="0x6"/>
        <value caption="Interrupt priority is 5" name="" value="0x5"/>
        <value caption="Interrupt priority is 4" name="" value="0x4"/>
        <value caption="Interrupt priority is 3" name="" value="0x3"/>
        <value caption="Interrupt priority is 2" name="" value="0x2"/>
        <value caption="Interrupt priority is 1" name="" value="0x1"/>
        <value caption="Interrupt is disabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="Interrupt subpriority" name="IPC23__AD1DC1IS">
        <value caption="Interrupt subpriority is 3" name="" value="0x3"/>
        <value caption="Interrupt subpriority is 2" name="" value="0x2"/>
        <value caption="Interrupt subpriority is 1" name="" value="0x1"/>
        <value caption="Interrupt subpriority is 0" name="" value="0x0"/>
      </value-group>
      <value-group caption="Interrupt priority" name="IPC23__AD1DC1IP">
        <value caption="Interrupt priority is 7" name="" value="0x7"/>
        <value caption="Interrupt priority is 6" name="" value="0x6"/>
        <value caption="Interrupt priority is 5" name="" value="0x5"/>
        <value caption="Interrupt priority is 4" name="" value="0x4"/>
        <value caption="Interrupt priority is 3" name="" value="0x3"/>
        <value caption="Interrupt priority is 2" name="" value="0x2"/>
        <value caption="Interrupt priority is 1" name="" value="0x1"/>
        <value caption="Interrupt is disabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="Interrupt subpriority" name="IPC23__AD1DC2IS">
        <value caption="Interrupt subpriority is 3" name="" value="0x3"/>
        <value caption="Interrupt subpriority is 2" name="" value="0x2"/>
        <value caption="Interrupt subpriority is 1" name="" value="0x1"/>
        <value caption="Interrupt subpriority is 0" name="" value="0x0"/>
      </value-group>
      <value-group caption="Interrupt priority" name="IPC23__AD1DC2IP">
        <value caption="Interrupt priority is 7" name="" value="0x7"/>
        <value caption="Interrupt priority is 6" name="" value="0x6"/>
        <value caption="Interrupt priority is 5" name="" value="0x5"/>
        <value caption="Interrupt priority is 4" name="" value="0x4"/>
        <value caption="Interrupt priority is 3" name="" value="0x3"/>
        <value caption="Interrupt priority is 2" name="" value="0x2"/>
        <value caption="Interrupt priority is 1" name="" value="0x1"/>
        <value caption="Interrupt is disabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="Interrupt subpriority" name="IPC24__AD1DF1IS">
        <value caption="Interrupt subpriority is 3" name="" value="0x3"/>
        <value caption="Interrupt subpriority is 2" name="" value="0x2"/>
        <value caption="Interrupt subpriority is 1" name="" value="0x1"/>
        <value caption="Interrupt subpriority is 0" name="" value="0x0"/>
      </value-group>
      <value-group caption="Interrupt priority" name="IPC24__AD1DF1IP">
        <value caption="Interrupt priority is 7" name="" value="0x7"/>
        <value caption="Interrupt priority is 6" name="" value="0x6"/>
        <value caption="Interrupt priority is 5" name="" value="0x5"/>
        <value caption="Interrupt priority is 4" name="" value="0x4"/>
        <value caption="Interrupt priority is 3" name="" value="0x3"/>
        <value caption="Interrupt priority is 2" name="" value="0x2"/>
        <value caption="Interrupt priority is 1" name="" value="0x1"/>
        <value caption="Interrupt is disabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="Interrupt subpriority" name="IPC24__AD1DF2IS">
        <value caption="Interrupt subpriority is 3" name="" value="0x3"/>
        <value caption="Interrupt subpriority is 2" name="" value="0x2"/>
        <value caption="Interrupt subpriority is 1" name="" value="0x1"/>
        <value caption="Interrupt subpriority is 0" name="" value="0x0"/>
      </value-group>
      <value-group caption="Interrupt priority" name="IPC24__AD1DF2IP">
        <value caption="Interrupt priority is 7" name="" value="0x7"/>
        <value caption="Interrupt priority is 6" name="" value="0x6"/>
        <value caption="Interrupt priority is 5" name="" value="0x5"/>
        <value caption="Interrupt priority is 4" name="" value="0x4"/>
        <value caption="Interrupt priority is 3" name="" value="0x3"/>
        <value caption="Interrupt priority is 2" name="" value="0x2"/>
        <value caption="Interrupt priority is 1" name="" value="0x1"/>
        <value caption="Interrupt is disabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="Interrupt subpriority" name="IPC25__AD1DFIIS">
        <value caption="Interrupt subpriority is 3" name="" value="0x3"/>
        <value caption="Interrupt subpriority is 2" name="" value="0x2"/>
        <value caption="Interrupt subpriority is 1" name="" value="0x1"/>
        <value caption="Interrupt subpriority is 0" name="" value="0x0"/>
      </value-group>
      <value-group caption="Interrupt priority" name="IPC25__AD1DFIIP">
        <value caption="Interrupt priority is 7" name="" value="0x7"/>
        <value caption="Interrupt priority is 6" name="" value="0x6"/>
        <value caption="Interrupt priority is 5" name="" value="0x5"/>
        <value caption="Interrupt priority is 4" name="" value="0x4"/>
        <value caption="Interrupt priority is 3" name="" value="0x3"/>
        <value caption="Interrupt priority is 2" name="" value="0x2"/>
        <value caption="Interrupt priority is 1" name="" value="0x1"/>
        <value caption="Interrupt is disabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="Interrupt subpriority" name="IPC25__AD1EOSIS">
        <value caption="Interrupt subpriority is 3" name="" value="0x3"/>
        <value caption="Interrupt subpriority is 2" name="" value="0x2"/>
        <value caption="Interrupt subpriority is 1" name="" value="0x1"/>
        <value caption="Interrupt subpriority is 0" name="" value="0x0"/>
      </value-group>
      <value-group caption="Interrupt priority" name="IPC25__AD1EOSIP">
        <value caption="Interrupt priority is 7" name="" value="0x7"/>
        <value caption="Interrupt priority is 6" name="" value="0x6"/>
        <value caption="Interrupt priority is 5" name="" value="0x5"/>
        <value caption="Interrupt priority is 4" name="" value="0x4"/>
        <value caption="Interrupt priority is 3" name="" value="0x3"/>
        <value caption="Interrupt priority is 2" name="" value="0x2"/>
        <value caption="Interrupt priority is 1" name="" value="0x1"/>
        <value caption="Interrupt is disabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="Interrupt subpriority" name="IPC25__AD1ARIS">
        <value caption="Interrupt subpriority is 3" name="" value="0x3"/>
        <value caption="Interrupt subpriority is 2" name="" value="0x2"/>
        <value caption="Interrupt subpriority is 1" name="" value="0x1"/>
        <value caption="Interrupt subpriority is 0" name="" value="0x0"/>
      </value-group>
      <value-group caption="Interrupt priority" name="IPC25__AD1ARIP">
        <value caption="Interrupt priority is 7" name="" value="0x7"/>
        <value caption="Interrupt priority is 6" name="" value="0x6"/>
        <value caption="Interrupt priority is 5" name="" value="0x5"/>
        <value caption="Interrupt priority is 4" name="" value="0x4"/>
        <value caption="Interrupt priority is 3" name="" value="0x3"/>
        <value caption="Interrupt priority is 2" name="" value="0x2"/>
        <value caption="Interrupt priority is 1" name="" value="0x1"/>
        <value caption="Interrupt is disabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="Interrupt subpriority" name="IPC25__AD1RSIS">
        <value caption="Interrupt subpriority is 3" name="" value="0x3"/>
        <value caption="Interrupt subpriority is 2" name="" value="0x2"/>
        <value caption="Interrupt subpriority is 1" name="" value="0x1"/>
        <value caption="Interrupt subpriority is 0" name="" value="0x0"/>
      </value-group>
      <value-group caption="Interrupt priority" name="IPC25__AD1RSIP">
        <value caption="Interrupt priority is 7" name="" value="0x7"/>
        <value caption="Interrupt priority is 6" name="" value="0x6"/>
        <value caption="Interrupt priority is 5" name="" value="0x5"/>
        <value caption="Interrupt priority is 4" name="" value="0x4"/>
        <value caption="Interrupt priority is 3" name="" value="0x3"/>
        <value caption="Interrupt priority is 2" name="" value="0x2"/>
        <value caption="Interrupt priority is 1" name="" value="0x1"/>
        <value caption="Interrupt is disabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="Interrupt subpriority" name="IPC26__AD1FCIS">
        <value caption="Interrupt subpriority is 3" name="" value="0x3"/>
        <value caption="Interrupt subpriority is 2" name="" value="0x2"/>
        <value caption="Interrupt subpriority is 1" name="" value="0x1"/>
        <value caption="Interrupt subpriority is 0" name="" value="0x0"/>
      </value-group>
