Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-W_DFP/1.8.326/atdf/PIC32MZ2051W104132.atdf
      <value-group caption="Interrupt Vector 030 Address Offset bits" name="OFF030__VOFF">
        <value caption="Offset is 0" name="" value="0x0"/>
        <value caption="Offset is 1" name="" value="0x1"/>
        <value caption="Offset is 65536" name="" value="0x10000"/>
      </value-group>
      <value-group caption="Interrupt Vector 031 Address Offset bits" name="OFF031__VOFF">
        <value caption="Offset is 0" name="" value="0x0"/>
        <value caption="Offset is 1" name="" value="0x1"/>
        <value caption="Offset is 65536" name="" value="0x10000"/>
      </value-group>
      <value-group caption="Interrupt Vector 032 Address Offset bits" name="OFF032__VOFF">
        <value caption="Offset is 0" name="" value="0x0"/>
        <value caption="Offset is 1" name="" value="0x1"/>
        <value caption="Offset is 65536" name="" value="0x10000"/>
      </value-group>
      <value-group caption="Interrupt Vector 033 Address Offset bits" name="OFF033__VOFF">
        <value caption="Offset is 0" name="" value="0x0"/>
        <value caption="Offset is 1" name="" value="0x1"/>
        <value caption="Offset is 65536" name="" value="0x10000"/>
      </value-group>
      <value-group caption="Interrupt Vector 034 Address Offset bits" name="OFF034__VOFF">
        <value caption="Offset is 0" name="" value="0x0"/>
        <value caption="Offset is 1" name="" value="0x1"/>
        <value caption="Offset is 65536" name="" value="0x10000"/>
      </value-group>
      <value-group caption="Interrupt Vector 035 Address Offset bits" name="OFF035__VOFF">
        <value caption="Offset is 0" name="" value="0x0"/>
        <value caption="Offset is 1" name="" value="0x1"/>
        <value caption="Offset is 65536" name="" value="0x10000"/>
      </value-group>
      <value-group caption="Interrupt Vector 036 Address Offset bits" name="OFF036__VOFF">
        <value caption="Offset is 0" name="" value="0x0"/>
        <value caption="Offset is 1" name="" value="0x1"/>
        <value caption="Offset is 65536" name="" value="0x10000"/>
      </value-group>
      <value-group caption="Interrupt Vector 037 Address Offset bits" name="OFF037__VOFF">
        <value caption="Offset is 0" name="" value="0x0"/>
        <value caption="Offset is 1" name="" value="0x1"/>
        <value caption="Offset is 65536" name="" value="0x10000"/>
      </value-group>
      <value-group caption="Interrupt Vector 038 Address Offset bits" name="OFF038__VOFF">
        <value caption="Offset is 0" name="" value="0x0"/>
        <value caption="Offset is 1" name="" value="0x1"/>
        <value caption="Offset is 65536" name="" value="0x10000"/>
      </value-group>
      <value-group caption="Interrupt Vector 039 Address Offset bits" name="OFF039__VOFF">
        <value caption="Offset is 0" name="" value="0x0"/>
        <value caption="Offset is 1" name="" value="0x1"/>
        <value caption="Offset is 65536" name="" value="0x10000"/>
      </value-group>
      <value-group caption="Interrupt Vector 040 Address Offset bits" name="OFF040__VOFF">
        <value caption="Offset is 0" name="" value="0x0"/>
        <value caption="Offset is 1" name="" value="0x1"/>
        <value caption="Offset is 65536" name="" value="0x10000"/>
      </value-group>
      <value-group caption="Interrupt Vector 041 Address Offset bits" name="OFF041__VOFF">
        <value caption="Offset is 0" name="" value="0x0"/>
        <value caption="Offset is 1" name="" value="0x1"/>
        <value caption="Offset is 65536" name="" value="0x10000"/>
      </value-group>
      <value-group caption="Interrupt Vector 042 Address Offset bits" name="OFF042__VOFF">
        <value caption="Offset is 0" name="" value="0x0"/>
        <value caption="Offset is 1" name="" value="0x1"/>
        <value caption="Offset is 65536" name="" value="0x10000"/>
      </value-group>
      <value-group caption="Interrupt Vector 043 Address Offset bits" name="OFF043__VOFF">
        <value caption="Offset is 0" name="" value="0x0"/>
        <value caption="Offset is 1" name="" value="0x1"/>
        <value caption="Offset is 65536" name="" value="0x10000"/>
      </value-group>
      <value-group caption="Interrupt Vector 044 Address Offset bits" name="OFF044__VOFF">
        <value caption="Offset is 0" name="" value="0x0"/>
        <value caption="Offset is 1" name="" value="0x1"/>
        <value caption="Offset is 65536" name="" value="0x10000"/>
      </value-group>
      <value-group caption="Interrupt Vector 045 Address Offset bits" name="OFF045__VOFF">
        <value caption="Offset is 0" name="" value="0x0"/>
        <value caption="Offset is 1" name="" value="0x1"/>
        <value caption="Offset is 65536" name="" value="0x10000"/>
      </value-group>
      <value-group caption="Interrupt Vector 046 Address Offset bits" name="OFF046__VOFF">
        <value caption="Offset is 0" name="" value="0x0"/>
        <value caption="Offset is 1" name="" value="0x1"/>
        <value caption="Offset is 65536" name="" value="0x10000"/>
      </value-group>
      <value-group caption="Interrupt Vector 047 Address Offset bits" name="OFF047__VOFF">
        <value caption="Offset is 0" name="" value="0x0"/>
        <value caption="Offset is 1" name="" value="0x1"/>
        <value caption="Offset is 65536" name="" value="0x10000"/>
      </value-group>
      <value-group caption="Interrupt Vector 053 Address Offset bits" name="OFF053__VOFF">
        <value caption="Offset is 0" name="" value="0x0"/>
        <value caption="Offset is 1" name="" value="0x1"/>
        <value caption="Offset is 65536" name="" value="0x10000"/>
      </value-group>
      <value-group caption="Interrupt Vector 054 Address Offset bits" name="OFF054__VOFF">
        <value caption="Offset is 0" name="" value="0x0"/>
        <value caption="Offset is 1" name="" value="0x1"/>
        <value caption="Offset is 65536" name="" value="0x10000"/>
      </value-group>
      <value-group caption="Interrupt Vector 055 Address Offset bits" name="OFF055__VOFF">
        <value caption="Offset is 0" name="" value="0x0"/>
        <value caption="Offset is 1" name="" value="0x1"/>
        <value caption="Offset is 65536" name="" value="0x10000"/>
      </value-group>
      <value-group caption="Interrupt Vector 056 Address Offset bits" name="OFF056__VOFF">
        <value caption="Offset is 0" name="" value="0x0"/>
        <value caption="Offset is 1" name="" value="0x1"/>
        <value caption="Offset is 65536" name="" value="0x10000"/>
      </value-group>
      <value-group caption="Interrupt Vector 057 Address Offset bits" name="OFF057__VOFF">
        <value caption="Offset is 0" name="" value="0x0"/>
        <value caption="Offset is 1" name="" value="0x1"/>
        <value caption="Offset is 65536" name="" value="0x10000"/>
      </value-group>
