Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-W_DFP/1.8.326/atdf/PIC32MZ2051W104132.atdf
      <value-group caption="Interrupt Vector 090 Address Offset bits" name="OFF090__VOFF">
        <value caption="Offset is 0" name="" value="0x0"/>
        <value caption="Offset is 1" name="" value="0x1"/>
        <value caption="Offset is 65536" name="" value="0x10000"/>
      </value-group>
      <value-group caption="Interrupt Vector 091 Address Offset bits" name="OFF091__VOFF">
        <value caption="Offset is 0" name="" value="0x0"/>
        <value caption="Offset is 1" name="" value="0x1"/>
        <value caption="Offset is 65536" name="" value="0x10000"/>
      </value-group>
      <value-group caption="Interrupt Vector 092 Address Offset bits" name="OFF092__VOFF">
        <value caption="Offset is 0" name="" value="0x0"/>
        <value caption="Offset is 1" name="" value="0x1"/>
        <value caption="Offset is 65536" name="" value="0x10000"/>
      </value-group>
      <value-group caption="Interrupt Vector 094 Address Offset bits" name="OFF094__VOFF">
        <value caption="Offset is 0" name="" value="0x0"/>
        <value caption="Offset is 1" name="" value="0x1"/>
        <value caption="Offset is 65536" name="" value="0x10000"/>
      </value-group>
      <value-group caption="Interrupt Vector 095 Address Offset bits" name="OFF095__VOFF">
        <value caption="Offset is 0" name="" value="0x0"/>
        <value caption="Offset is 1" name="" value="0x1"/>
        <value caption="Offset is 65536" name="" value="0x10000"/>
      </value-group>
      <value-group caption="Interrupt Vector 096 Address Offset bits" name="OFF096__VOFF">
        <value caption="Offset is 0" name="" value="0x0"/>
        <value caption="Offset is 1" name="" value="0x1"/>
        <value caption="Offset is 65536" name="" value="0x10000"/>
      </value-group>
      <value-group caption="Interrupt Vector 097 Address Offset bits" name="OFF097__VOFF">
        <value caption="Offset is 0" name="" value="0x0"/>
        <value caption="Offset is 1" name="" value="0x1"/>
        <value caption="Offset is 65536" name="" value="0x10000"/>
      </value-group>
      <value-group caption="Interrupt Vector 100 Address Offset bits" name="OFF100__VOFF">
        <value caption="Offset is 0" name="" value="0x0"/>
        <value caption="Offset is 1" name="" value="0x1"/>
        <value caption="Offset is 65536" name="" value="0x10000"/>
      </value-group>
      <value-group caption="Interrupt Vector 101 Address Offset bits" name="OFF101__VOFF">
        <value caption="Offset is 0" name="" value="0x0"/>
        <value caption="Offset is 1" name="" value="0x1"/>
        <value caption="Offset is 65536" name="" value="0x10000"/>
      </value-group>
      <value-group caption="Interrupt Vector 102 Address Offset bits" name="OFF102__VOFF">
        <value caption="Offset is 0" name="" value="0x0"/>
        <value caption="Offset is 1" name="" value="0x1"/>
        <value caption="Offset is 65536" name="" value="0x10000"/>
      </value-group>
      <value-group caption="Interrupt Vector 103 Address Offset bits" name="OFF103__VOFF">
        <value caption="Offset is 0" name="" value="0x0"/>
        <value caption="Offset is 1" name="" value="0x1"/>
        <value caption="Offset is 65536" name="" value="0x10000"/>
      </value-group>
      <value-group caption="Interrupt Vector 104 Address Offset bits" name="OFF104__VOFF">
        <value caption="Offset is 0" name="" value="0x0"/>
        <value caption="Offset is 1" name="" value="0x1"/>
        <value caption="Offset is 65536" name="" value="0x10000"/>
      </value-group>
      <value-group caption="Interrupt Vector 106 Address Offset bits" name="OFF106__VOFF">
        <value caption="Offset is 0" name="" value="0x0"/>
        <value caption="Offset is 1" name="" value="0x1"/>
        <value caption="Offset is 65536" name="" value="0x10000"/>
      </value-group>
      <value-group caption="Interrupt Vector 107 Address Offset bits" name="OFF107__VOFF">
        <value caption="Offset is 0" name="" value="0x0"/>
        <value caption="Offset is 1" name="" value="0x1"/>
        <value caption="Offset is 65536" name="" value="0x10000"/>
      </value-group>
      <value-group caption="Interrupt Vector 108 Address Offset bits" name="OFF108__VOFF">
        <value caption="Offset is 0" name="" value="0x0"/>
        <value caption="Offset is 1" name="" value="0x1"/>
        <value caption="Offset is 65536" name="" value="0x10000"/>
      </value-group>
      <value-group caption="Interrupt Vector 109 Address Offset bits" name="OFF109__VOFF">
        <value caption="Offset is 0" name="" value="0x0"/>
        <value caption="Offset is 1" name="" value="0x1"/>
        <value caption="Offset is 65536" name="" value="0x10000"/>
      </value-group>
      <value-group caption="Interrupt Vector 110 Address Offset bits" name="OFF110__VOFF">
        <value caption="Offset is 0" name="" value="0x0"/>
        <value caption="Offset is 1" name="" value="0x1"/>
        <value caption="Offset is 65536" name="" value="0x10000"/>
      </value-group>
      <value-group caption="Interrupt Vector 111 Address Offset bits" name="OFF111__VOFF">
        <value caption="Offset is 0" name="" value="0x0"/>
        <value caption="Offset is 1" name="" value="0x1"/>
        <value caption="Offset is 65536" name="" value="0x10000"/>
      </value-group>
      <value-group caption="Interrupt Vector 112 Address Offset bits" name="OFF112__VOFF">
        <value caption="Offset is 0" name="" value="0x0"/>
        <value caption="Offset is 1" name="" value="0x1"/>
        <value caption="Offset is 65536" name="" value="0x10000"/>
      </value-group>
      <value-group caption="Interrupt Vector 113 Address Offset bits" name="OFF113__VOFF">
        <value caption="Offset is 0" name="" value="0x0"/>
        <value caption="Offset is 1" name="" value="0x1"/>
        <value caption="Offset is 65536" name="" value="0x10000"/>
      </value-group>
      <value-group caption="Interrupt Vector 114 Address Offset bits" name="OFF114__VOFF">
        <value caption="Offset is 0" name="" value="0x0"/>
        <value caption="Offset is 1" name="" value="0x1"/>
        <value caption="Offset is 65536" name="" value="0x10000"/>
      </value-group>
