Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-W_DFP/1.8.326/atdf/PIC32MZ2051W104132.atdf
      <value-group caption="PWM Fault Condition Status bit" name="OC3CON__OCFLT">
        <value caption="PWM Fault condition has occurred (cleared in HW only)" name="" value="0x1"/>
        <value caption="No PWM Fault condition has occurred" name="" value="0x0"/>
      </value-group>
      <value-group caption="32-bit Compare Mode bit" name="OC3CON__OC32">
        <value caption="OCxR(31-0) and/or OCxRS(31-0) are used for comparisions to the 32-bit timer source" name="" value="0x1"/>
        <value caption="OCxR(15-0) and OCxRS(15-0) are used for comparisons to the 16-bit timer source" name="" value="0x0"/>
      </value-group>
      <value-group caption="Stop in Idle Mode bit" name="OC3CON__SIDL">
        <value caption="Discontinue operation when CPU enters Idle mode" name="" value="0x1"/>
        <value caption="Continue operation in Idle mode" name="" value="0x0"/>
      </value-group>
      <value-group caption="Output Compare Peripheral On bit" name="OC3CON__ON">
        <value caption="Output Compare peripheral is enabled" name="" value="0x1"/>
        <value caption="Output Compare peripheral is disabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="Output Compare Mode Select bits" name="OC4CON__OCM">
        <value caption="PWM mode on OCx; Fault pin enabled" name="" value="0x7"/>
        <value caption="PWM mode on OCx; Fault pin disabled" name="" value="0x6"/>
        <value caption="Initialize OCx pin low; generate continious output pulses on OCx pin" name="" value="0x5"/>
        <value caption="Initialize OCx pin low: generate single output pulse on OCx pin" name="" value="0x4"/>
        <value caption="Compare event toggles OCx pin" name="" value="0x3"/>
        <value caption="Initialize OCx pin high; compare event forces OCx pin low" name="" value="0x2"/>
        <value caption="Initialize OCx pin low; compare event forces OCx pin high" name="" value="0x1"/>
        <value caption="Output compare peripheral is disabled but continues to draw current" name="" value="0x0"/>
      </value-group>
      <value-group caption="Output Compare Timer Select bit" name="OC4CON__OCTSEL">
        <value caption="Timer3 is the clock source for this Output Compare module" name="" value="0x1"/>
        <value caption="Timer2 is the clock source for this Output Compare module" name="" value="0x0"/>
      </value-group>
      <value-group caption="PWM Fault Condition Status bit" name="OC4CON__OCFLT">
        <value caption="PWM Fault condition has occurred (cleared in HW only)" name="" value="0x1"/>
        <value caption="No PWM Fault condition has occurred" name="" value="0x0"/>
      </value-group>
      <value-group caption="32-bit Compare Mode bit" name="OC4CON__OC32">
        <value caption="OCxR(31-0) and/or OCxRS(31-0) are used for comparisions to the 32-bit timer source" name="" value="0x1"/>
        <value caption="OCxR(15-0) and OCxRS(15-0) are used for comparisons to the 16-bit timer source" name="" value="0x0"/>
      </value-group>
      <value-group caption="Stop in Idle Mode bit" name="OC4CON__SIDL">
        <value caption="Discontinue operation when CPU enters Idle mode" name="" value="0x1"/>
        <value caption="Continue operation in Idle mode" name="" value="0x0"/>
      </value-group>
      <value-group caption="Output Compare Peripheral On bit" name="OC4CON__ON">
        <value caption="Output Compare peripheral is enabled" name="" value="0x1"/>
        <value caption="Output Compare peripheral is disabled" name="" value="0x0"/>
      </value-group>
    </module>
    <module caption="" id="03088" name="PCACHE" version="2">
      <register-group name="PCACHE">
        <register caption="" name="PRECON" offset="0x0" rw="RW" size="4">
          <bitfield caption="PFM Access Time Defined in Terms of SYSCLK Wait States bits" mask="0x0000000F" name="PFMWS" values="PRECON__PFMWS"/>
          <bitfield caption="Predictive Prefetch Enable bits" mask="0x00000030" name="PREFEN" values="PRECON__PREFEN"/>
          <bitfield mask="0x00000080" name="PFMSECEN"/>
          <bitfield caption="PFM Address Wait State Enable bit" mask="0x00000100" name="PFMAWSEN" values="PRECON__PFMAWSEN"/>
          <bitfield caption="Cache Performance Counters Enable bit" mask="0x00001000" name="CHEPERFEN" values="PRECON__CHEPERFEN"/>
          <bitfield caption="Instruction Auto-cache Coherency Control bit" mask="0x00010000" name="ICHECOH" values="PRECON__ICHECOH"/>
          <bitfield caption="Data Auto-cache Coherency Control bit" mask="0x00020000" name="DCHECOH" values="PRECON__DCHECOH"/>
          <bitfield caption="Peripheral Auto-cache Coherency Control bit" mask="0x00040000" name="PERCHECOH" values="PRECON__PERCHECOH"/>
          <bitfield caption="Instruction Cache Invalidate bit" mask="0x00100000" name="ICHEINV" values="PRECON__ICHEINV"/>
          <bitfield caption="Data Cache Invalidate bit" mask="0x00200000" name="DCHEINV" values="PRECON__DCHEINV"/>
          <bitfield caption="Peripheral Cache Invalidate bit" mask="0x00400000" name="PERCHEINV" values="PRECON__PERCHEINV"/>
          <bitfield caption="Instruction Cache Enable bit" mask="0x01000000" name="ICHEEN" values="PRECON__ICHEEN"/>
          <bitfield caption="Data Cache Enable bit" mask="0x02000000" name="DCHEEN" values="PRECON__DCHEEN"/>
          <bitfield caption="Peripheral Cache Enable bit" mask="0x04000000" name="PERCHEEN" values="PRECON__PERCHEEN"/>
        </register>
        <register caption="" name="PRESTAT" offset="0x10" rw="RW" size="4">
          <bitfield mask="0x000000FF" name="PFMSECCNT"/>
          <bitfield mask="0x04000000" name="PFMSEC"/>
          <bitfield mask="0x08000000" name="PFMDED"/>
        </register>
        <register caption="" name="PREHIT" offset="0x20" rw="R" size="4">
          <bitfield mask="0xFFFFFFFF" name="CHEHIT"/>
        </register>
        <register caption="" name="PREMIS" offset="0x30" rw="R" size="4">
          <bitfield mask="0xFFFFFFFF" name="CHEMIS"/>
        </register>
      </register-group>
      <value-group caption="PFM Access Time Defined in Terms of SYSCLK Wait States bits" name="PRECON__PFMWS">
        <value caption="Seven Wait states" name="" value="0x7"/>
        <value caption="Six Wait states" name="" value="0x6"/>
        <value caption="Five Wait states" name="" value="0x5"/>
        <value caption="Four Wait states" name="" value="0x4"/>
        <value caption="Three Wait states" name="" value="0x3"/>
        <value caption="Two Wait states" name="" value="0x2"/>
        <value caption="One Wait state" name="" value="0x1"/>
        <value caption="Zero Wait states" name="" value="0x0"/>
      </value-group>
      <value-group caption="Predictive Prefetch Enable bits" name="PRECON__PREFEN">
        <value caption="Enable predictive prefetch for CPU instructions only" name="" value="0x1"/>
        <value caption="Disable predictive prefetch" name="" value="0x0"/>
      </value-group>
