Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-W_DFP/1.8.326/atdf/PIC32MZ2051W104132.atdf
      <value-group caption="PFM Address Wait State Enable bit" name="PRECON__PFMAWSEN">
        <value caption="Add one more Wait State to flash address setup (suggested for higher system clock frequencies)" name="" value="0x1"/>
        <value caption="Add no Wait States to the flash address setup (suggested for lower system clock frequencies to achieve higher performance)" name="" value="0x0"/>
      </value-group>
      <value-group caption="Cache Performance Counters Enable bit" name="PRECON__CHEPERFEN">
        <value caption="Performance counters are enabled" name="" value="0x1"/>
        <value caption="Performance counters are disabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="Instruction Auto-cache Coherency Control bit" name="PRECON__ICHECOH">
        <value caption="Automatically invalidate cache on a programming event" name="" value="0x1"/>
        <value caption="Do not automatically invalidate cache on a programming event" name="" value="0x0"/>
      </value-group>
      <value-group caption="Data Auto-cache Coherency Control bit" name="PRECON__DCHECOH">
        <value caption="Automatically invalidate cache on a programming event" name="" value="0x1"/>
        <value caption="Do not automatically invalidate cache on a programming event" name="" value="0x0"/>
      </value-group>
      <value-group caption="Peripheral Auto-cache Coherency Control bit" name="PRECON__PERCHECOH">
        <value caption="Automatically invalidate cache on a programming event" name="" value="0x1"/>
        <value caption="Do not automatically invalidate cache on a programming event" name="" value="0x0"/>
      </value-group>
      <value-group caption="Instruction Cache Invalidate bit" name="PRECON__ICHEINV">
        <value caption="Force invalidate cache/invalidate busy" name="" value="0x1"/>
        <value caption="Cache Invalidation follows CHECOH/invalid complete" name="" value="0x0"/>
      </value-group>
      <value-group caption="Data Cache Invalidate bit" name="PRECON__DCHEINV">
        <value caption="Force invalidate cache/invalidate busy" name="" value="0x1"/>
        <value caption="Cache Invalidation follows CHECOH/invalid complete" name="" value="0x0"/>
      </value-group>
      <value-group caption="Peripheral Cache Invalidate bit" name="PRECON__PERCHEINV">
        <value caption="Force invalidate cache/invalidate busy" name="" value="0x1"/>
        <value caption="Cache Invalidation follows CHECOH/invalid complete" name="" value="0x0"/>
      </value-group>
      <value-group caption="Instruction Cache Enable bit" name="PRECON__ICHEEN">
        <value caption="Instruction cache is enabled" name="" value="0x1"/>
        <value caption="Instruction cache is disabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="Data Cache Enable bit" name="PRECON__DCHEEN">
        <value caption="Data cache is enabled" name="" value="0x1"/>
        <value caption="Data cache is disabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="Peripheral Cache Enable bit" name="PRECON__PERCHEEN">
        <value caption="Peripheral cache is enabled" name="" value="0x1"/>
        <value caption="Peripheral cache is disabled" name="" value="0x0"/>
      </value-group>
    </module>
    <module caption="" id="03337" name="PMU" version="">
      <register-group name="PMU">
        <register caption="" name="PMUSPICTRL" offset="0x0" rw="RW" size="4">
          <bitfield mask="0x0000FFFF" name="SPIWDATA"/>
          <bitfield mask="0x00FF0000" name="SPIADDR"/>
          <bitfield mask="0x01000000" name="CMD"/>
          <bitfield mask="0x40000000" name="PMUCRST"/>
          <bitfield mask="0x80000000" name="SPIRST"/>
        </register>
        <register caption="" name="PMUSPISTAT" offset="0x4" rw="RW" size="4">
          <bitfield mask="0x00000001" name="SPIERR"/>
          <bitfield mask="0x00000080" name="SPIRDY"/>
          <bitfield mask="0x0000FF00" name="SPIRADDR"/>
          <bitfield mask="0xFFFF0000" name="SPIRDATA"/>
        </register>
        <register caption="" name="PMUCLKCTRL" offset="0x8" rw="RW" size="4">
          <bitfield mask="0x0000003F" name="SPICLKDIV"/>
          <bitfield mask="0x00000040" name="PMUANABUCKBOREN"/>
          <bitfield mask="0x00000080" name="SPISRC"/>
          <bitfield mask="0x00003F00" name="BUCKCLKDIV"/>
          <bitfield mask="0x0000C000" name="BUCKSRC"/>
          <bitfield mask="0x00010000" name="BACWD"/>
          <bitfield mask="0x00020000" name="MLDOEXTEN"/>
          <bitfield mask="0x00040000" name="MVREFFSMEN"/>
          <bitfield mask="0x00080000" name="WCMRETEXBCWD"/>
          <bitfield mask="0x00F00000" name="CMPCYCLE"/>
          <bitfield mask="0x01000000" name="BKCLKHWOVR"/>
          <bitfield mask="0x04000000" name="MDLOEXTBOREN"/>
          <bitfield mask="0x08000000" name="ADCBOREN"/>
          <bitfield mask="0x10000000" name="BUCKBOREN"/>
          <bitfield mask="0x20000000" name="FBCLKCFG"/>
          <bitfield mask="0x40000000" name="WLDOOFF"/>
          <bitfield mask="0x80000000" name="WCMRET"/>
        </register>
        <register caption="" name="PMUMODECTRL1" offset="0xc" rw="RW" size="4">
          <bitfield mask="0x0000001F" name="VREG4CTRL"/>
          <bitfield mask="0x00001F00" name="VREG3CTRL"/>
          <bitfield mask="0x001F0000" name="VREG2CTRL"/>
          <bitfield mask="0x1F000000" name="VREG1CTRL"/>
          <bitfield mask="0x20000000" name="BUCKMODE"/>
          <bitfield mask="0x40000000" name="MLDOEN"/>
          <bitfield mask="0x80000000" name="BUCKEN"/>
        </register>
        <register caption="" name="PMUMODECTRL2" offset="0x10" rw="RW" size="4">
          <bitfield mask="0x0000001F" name="VREG4CTRL"/>
          <bitfield mask="0x00001F00" name="VREG3CTRL"/>
          <bitfield mask="0x001F0000" name="VREG2CTRL"/>
          <bitfield mask="0x1F000000" name="VREG1CTRL"/>
          <bitfield mask="0x20000000" name="BUCKMODE"/>
          <bitfield mask="0x40000000" name="MLDOEN"/>
          <bitfield mask="0x80000000" name="BUCKEN"/>
        </register>
        <register caption="" name="PMUMODECTRL3" offset="0x14" rw="RW" size="4">
          <bitfield mask="0x0000001F" name="VREG4CTRL"/>
          <bitfield mask="0x00001F00" name="VREG3CTRL"/>
          <bitfield mask="0x001F0000" name="VREG2CTRL"/>
          <bitfield mask="0x1F000000" name="VREG1CTRL"/>
          <bitfield mask="0x20000000" name="BUCKMODE"/>
          <bitfield mask="0x40000000" name="MLDOEN"/>
          <bitfield mask="0x80000000" name="BUCKEN"/>
        </register>
        <register caption="" name="PMUMODECTRL4" offset="0x18" rw="RW" size="4">
          <bitfield mask="0x0000001F" name="VREG4CTRL"/>
          <bitfield mask="0x00001F00" name="VREG3CTRL"/>
          <bitfield mask="0x001F0000" name="VREG2CTRL"/>
          <bitfield mask="0x1F000000" name="VREG1CTRL"/>
          <bitfield mask="0x20000000" name="BUCKMODE"/>
          <bitfield mask="0x40000000" name="MLDOEN"/>
          <bitfield mask="0x80000000" name="BUCKEN"/>
        </register>
        <register caption="" name="PMUOVERCTRL" offset="0x1c" rw="RW" size="4">
          <bitfield mask="0x0000001F" name="VREG4OCTRL"/>
          <bitfield mask="0x00001F00" name="VREG3OCTRL"/>
          <bitfield mask="0x00004000" name="ORETEXIT"/>
          <bitfield mask="0x00008000" name="OWLDOEN"/>
          <bitfield mask="0x001F0000" name="VREG2OCTRL"/>
          <bitfield mask="0x00400000" name="PHWC"/>
          <bitfield mask="0x00800000" name="OVEREN"/>
          <bitfield mask="0x1F000000" name="VREG1OCTRL"/>
          <bitfield mask="0x20000000" name="OBUCKMODE"/>
          <bitfield mask="0x40000000" name="OMLDOEN"/>
          <bitfield mask="0x80000000" name="OBUCKEN"/>
        </register>
