Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-W_DFP/1.8.326/atdf/PIC32MZ2051W104132.atdf
        <register caption="" name="PMUCMODE" offset="0x20" rw="R" size="4">
          <bitfield mask="0x0000001F" name="CVREG4OCTRL"/>
          <bitfield mask="0x00001F00" name="CVREG3OCTRL"/>
          <bitfield mask="0x001F0000" name="CVREG2OCTRL"/>
          <bitfield mask="0x00200000" name="ADCBOR"/>
          <bitfield mask="0x00400000" name="BUCKBOR"/>
          <bitfield mask="0x00800000" name="MLDOEXTBOR"/>
          <bitfield mask="0x1F000000" name="CVREG1OCTRL"/>
          <bitfield mask="0x20000000" name="CBUCKMODE"/>
          <bitfield mask="0x40000000" name="CMLDOEN"/>
          <bitfield mask="0x80000000" name="CBUCKEN"/>
        </register>
        <register caption="" name="PMUSTATUS" offset="0x24" rw="R" size="4">
          <bitfield mask="0x0000001F" name="STATUS"/>
          <bitfield mask="0x00000020" name="WCMRM"/>
          <bitfield mask="0x00000040" name="PMUANABUCKBOR"/>
          <bitfield mask="0x00000080" name="WLDORDY"/>
          <bitfield mask="0x00FFFF00" name="BSSEDATA"/>
          <bitfield mask="0x7F000000" name="BSSENUM"/>
          <bitfield mask="0x80000000" name="BSSERR"/>
        </register>
        <register caption="" name="PMUSEQ1" offset="0x28" rw="R" size="4">
          <bitfield mask="0x0000003F" name="DELAY"/>
          <bitfield mask="0x00000040" name="CMPBVAL"/>
          <bitfield mask="0x00000080" name="CMD"/>
          <bitfield mask="0x0000FF00" name="SPIADDR"/>
          <bitfield mask="0xFFFF0000" name="SPIDATA"/>
        </register>
        <register caption="" name="PMUSEQ2" offset="0x2c" rw="R" size="4">
          <bitfield mask="0x0000003F" name="DELAY"/>
          <bitfield mask="0x00000040" name="CMPBVAL"/>
          <bitfield mask="0x00000080" name="CMD"/>
          <bitfield mask="0x0000FF00" name="SPIADDR"/>
          <bitfield mask="0xFFFF0000" name="SPIDATA"/>
        </register>
        <register caption="" name="PMUSEQ3" offset="0x30" rw="R" size="4">
          <bitfield mask="0x0000003F" name="DELAY"/>
          <bitfield mask="0x00000040" name="CMPBVAL"/>
          <bitfield mask="0x00000080" name="CMD"/>
          <bitfield mask="0x0000FF00" name="SPIADDR"/>
          <bitfield mask="0xFFFF0000" name="SPIDATA"/>
        </register>
        <register caption="" name="PMUSEQ4" offset="0x34" rw="R" size="4">
          <bitfield mask="0x0000003F" name="DELAY"/>
          <bitfield mask="0x00000040" name="CMPBVAL"/>
          <bitfield mask="0x00000080" name="CMD"/>
          <bitfield mask="0x0000FF00" name="SPIADDR"/>
          <bitfield mask="0xFFFF0000" name="SPIDATA"/>
        </register>
        <register caption="" name="PMUCFG" offset="0x38" rw="R" size="4">
          <bitfield mask="0x0000007F" name="BUCKSWDELAY"/>
          <bitfield mask="0x00003F00" name="MLDOSWDELAY"/>
          <bitfield mask="0x0000C000" name="MLDOEXTL"/>
          <bitfield mask="0x000F0000" name="BUCKCPL"/>
          <bitfield mask="0x00F00000" name="BUCKCPH"/>
          <bitfield mask="0x0F000000" name="ADCCPL"/>
          <bitfield mask="0xF0000000" name="ADCCPH"/>
        </register>
        <register caption="" name="PMUWCMCMD" offset="0x3c" rw="RW" size="4">
          <bitfield mask="0x000007FF" name="WCMADDR"/>
          <bitfield mask="0x00070000" name="WCMCLKDIV"/>
          <bitfield mask="0x10000000" name="WCMRDY"/>
          <bitfield mask="0x40000000" name="CMD"/>
          <bitfield mask="0x80000000" name="MODE"/>
        </register>
        <register caption="" name="PMUWCMWDATA" offset="0x40" rw="RW" size="4">
          <bitfield mask="0xFFFFFFFF" name="WDATA"/>
        </register>
        <register caption="" name="PMUWCMRDATA" offset="0x44" rw="RW" size="4">
          <bitfield mask="0xFFFFFFFF" name="RDATA"/>
        </register>
        <register caption="" name="PMUVBCCMD" offset="0x48" rw="RW" size="4">
          <bitfield mask="0x0000FFFF" name="VBCADDR"/>
          <bitfield mask="0x10000000" name="VBCRDY"/>
          <bitfield mask="0x40000000" name="CMD"/>
        </register>
        <register caption="" name="PMUVCBWDATA" offset="0x4C" rw="RW" size="4">
          <bitfield mask="0xFFFFFFFF" name="WDATA"/>
        </register>
        <register caption="PMUVCBRDATA" name="" offset="0x50" rw="RW" size="4">
          <bitfield mask="0xFFFFFFFF" name="RDATA"/>
        </register>
        <register caption="WCMCFG" name="" offset="0x54" rw="RW" size="4">
          <bitfield mask="0x00000007" name="WCM1CFG"/>
          <bitfield mask="0x00000070" name="WCM2CFG"/>
          <bitfield mask="0x00000700" name="SRAM1CFG"/>
          <bitfield mask="0x00007000" name="SRAM2CFG"/>
          <bitfield mask="0x00070000" name="SRAM3CFG"/>
          <bitfield mask="0x00700000" name="SRAM4CFG"/>
          <bitfield mask="0x07000000" name="SRAM5CFG"/>
          <bitfield mask="0x70000000" name="SRAM6CFG"/>
        </register>
        <register caption="PMUIENB" name="" offset="0x58" rw="RW" size="4">
          <bitfield mask="0x00000001" name="ADCBORIEN"/>
          <bitfield mask="0x00000002" name="BUCKBORIEN"/>
          <bitfield mask="0x00000004" name="SCMPIEN"/>
          <bitfield mask="0x00000008" name="WCMIAIEN"/>
          <bitfield mask="0x00000010" name="VBCIAIEN"/>
        </register>
        <register caption="PMUISTAT" name="" offset="0x5C" rw="RW" size="4">
          <bitfield mask="0x00000001" name="ADCBORINT"/>
          <bitfield mask="0x00000002" name="BUCKBORINT"/>
          <bitfield mask="0x00000004" name="SCMPINT"/>
          <bitfield mask="0x00000008" name="WCMIAINT"/>
          <bitfield mask="0x00000010" name="VBCIAINT"/>
        </register>
        <register caption="WCMSIZ" name="" offset="0x60" rw="RW" size="4">
          <bitfield mask="0x00000003" name="WCM1SIZ"/>
          <bitfield mask="0x00000030" name="WCM2SIZ"/>
          <bitfield mask="0x00000300" name="SRAM1SIZ"/>
          <bitfield mask="0x00003000" name="SRAM2SIZ"/>
          <bitfield mask="0x00030000" name="SRAM3SIZ"/>
          <bitfield mask="0x00300000" name="SRAM4SIZ"/>
          <bitfield mask="0x03000000" name="SRAM5SIZ"/>
          <bitfield mask="0x30000000" name="SRAM6SIZ"/>
        </register>
        <register caption="PMUWCM" name="" offset="0x0200" rw="RW" size="4">
          <bitfield mask="0xFFFFFFFF" name="WCMDATA"/>
        </register>
      </register-group>
    </module>
