Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-W_DFP/1.8.326/atdf/PIC32MZ2051W104132.atdf
    <module caption="" id="03337" name="PPS" version="1">
      <register-group name="PPS">
        <register caption="" name="INT0R" offset="0x0" rw="RW" size="4">
          <bitfield mask="0x0000000F" name="INT0R"/>
        </register>
        <register caption="" name="INT1R" offset="0x4" rw="RW" size="4">
          <bitfield mask="0x0000000F" name="INT1R"/>
        </register>
        <register caption="" name="INT2R" offset="0x8" rw="RW" size="4">
          <bitfield mask="0x0000000F" name="INT2R"/>
        </register>
        <register caption="" name="INT3R" offset="0xc" rw="RW" size="4">
          <bitfield mask="0x0000000F" name="INT3R"/>
        </register>
        <register caption="" name="INT4R" offset="0x10" rw="RW" size="4">
          <bitfield mask="0x0000000F" name="INT4R"/>
        </register>
        <register caption="" name="T1CKR" offset="0x14" rw="RW" size="4">
          <bitfield mask="0x0000000F" name="T1CKR"/>
        </register>
        <register caption="" name="T2CKR" offset="0x18" rw="RW" size="4">
          <bitfield mask="0x0000000F" name="T2CKR"/>
        </register>
        <register caption="" name="T3CKR" offset="0x1c" rw="RW" size="4">
          <bitfield mask="0x0000000F" name="T3CKR"/>
        </register>
        <register caption="" name="T4CKR" offset="0x20" rw="RW" size="4">
          <bitfield mask="0x0000000F" name="T4CKR"/>
        </register>
        <register caption="" name="T5CKR" offset="0x24" rw="RW" size="4">
          <bitfield mask="0x0000000F" name="T5CKR"/>
        </register>
        <register caption="" name="T6CKR" offset="0x28" rw="RW" size="4">
          <bitfield mask="0x0000000F" name="T6CKR"/>
        </register>
        <register caption="" name="T7CKR" offset="0x2c" rw="RW" size="4">
          <bitfield mask="0x0000000F" name="T7CKR"/>
        </register>
        <register caption="" name="IC1R" offset="0x38" rw="RW" size="4">
          <bitfield mask="0x0000000F" name="IC1R"/>
        </register>
        <register caption="" name="IC2R" offset="0x3c" rw="RW" size="4">
          <bitfield mask="0x0000000F" name="IC2R"/>
        </register>
        <register caption="" name="IC3R" offset="0x40" rw="RW" size="4">
          <bitfield mask="0x0000000F" name="IC3R"/>
        </register>
        <register caption="" name="IC4R" offset="0x44" rw="RW" size="4">
          <bitfield mask="0x0000000F" name="IC4R"/>
        </register>
        <register caption="" name="OCFAR" offset="0x5c" rw="RW" size="4">
          <bitfield mask="0x0000000F" name="OCFAR"/>
        </register>
        <register caption="" name="OCFBR" offset="0x60" rw="RW" size="4">
          <bitfield mask="0x0000000F" name="OCFBR"/>
        </register>
        <register caption="" name="OCFCR" offset="0x64" rw="RW" size="4">
          <bitfield mask="0x0000000F" name="OCFCR"/>
        </register>
        <register caption="" name="OCFDR" offset="0x68" rw="RW" size="4">
          <bitfield mask="0x0000000F" name="OCFDR"/>
        </register>
        <register caption="" name="U1RXR" offset="0x6c" rw="RW" size="4">
          <bitfield mask="0x0000000F" name="U1RXR"/>
        </register>
        <register caption="" name="U1CTSR" offset="0x70" rw="RW" size="4">
          <bitfield mask="0x0000000F" name="U1CTSR"/>
        </register>
        <register caption="" name="U2RXR" offset="0x74" rw="RW" size="4">
          <bitfield mask="0x0000000F" name="U2RXR"/>
        </register>
        <register caption="" name="U2CTSR" offset="0x78" rw="RW" size="4">
          <bitfield mask="0x0000000F" name="U2CTSR"/>
        </register>
        <register caption="" name="U3RXR" offset="0x7c" rw="RW" size="4">
          <bitfield mask="0x0000000F" name="U3RXR"/>
        </register>
        <register caption="" name="U3CTSR" offset="0x80" rw="RW" size="4">
          <bitfield mask="0x0000000F" name="U3CTSR"/>
        </register>
        <register caption="" name="PTG30R" offset="0x8c" rw="RW" size="4">
          <bitfield mask="0x0000000F" name="PTG30R"/>
        </register>
        <register caption="" name="PTG31R" offset="0x90" rw="RW" size="4">
          <bitfield mask="0x0000000F" name="PTG31R"/>
        </register>
        <register caption="" name="SDI1R" offset="0x98" rw="RW" size="4">
          <bitfield mask="0x0000000F" name="SDI1R"/>
        </register>
        <register caption="" name="SS1INR" offset="0x9c" rw="RW" size="4">
          <bitfield mask="0x0000000F" name="SS1INR"/>
        </register>
        <register caption="" name="SDI2R" offset="0xa4" rw="RW" size="4">
          <bitfield mask="0x0000000F" name="SDI2R"/>
        </register>
        <register caption="" name="SS2INR" offset="0xa8" rw="RW" size="4">
          <bitfield mask="0x0000000F" name="SS2INR"/>
        </register>
        <register caption="" name="C1RXR" offset="0xc4" rw="RW" size="4">
          <bitfield mask="0x0000000F" name="C1RXR"/>
        </register>
        <register caption="" name="C2RXR" offset="0xc8" rw="RW" size="4">
          <bitfield mask="0x0000000F" name="C2RXR"/>
        </register>
        <register caption="" name="REFIR" offset="0xcc" rw="RW" size="4">
          <bitfield mask="0x0000000F" name="REFIR"/>
        </register>
        <register caption="" name="ECOLR" offset="0x174" rw="RW" size="4">
          <bitfield mask="0x0000000F" name="ECOLR"/>
        </register>
        <register caption="" name="ECRSR" offset="0x178" rw="RW" size="4">
          <bitfield mask="0x0000000F" name="ECRSR"/>
        </register>
        <register caption="" name="ETXCLKR" offset="0x17c" rw="RW" size="4">
          <bitfield mask="0x0000000F" name="ETXCLKR"/>
        </register>
        <register caption="" name="ERXD3R" offset="0x180" rw="RW" size="4">
          <bitfield mask="0x0000000F" name="ERXD3R"/>
        </register>
        <register caption="" name="ERXD2R" offset="0x184" rw="RW" size="4">
          <bitfield mask="0x0000000F" name="ERXD2R"/>
        </register>
        <register caption="" name="RPA0R" offset="0x200" rw="RW" size="4">
          <bitfield mask="0x0000000F" name="RPA0R"/>
        </register>
