Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-W_DFP/1.8.326/atdf/PIC32MZ2051W104132.atdf
        <register caption="" name="RPA1R" offset="0x204" rw="RW" size="4">
          <bitfield mask="0x0000000F" name="RPA1R"/>
        </register>
        <register caption="" name="RPA2R" offset="0x208" rw="RW" size="4">
          <bitfield mask="0x0000000F" name="RPA2R"/>
        </register>
        <register caption="" name="RPA3R" offset="0x20c" rw="RW" size="4">
          <bitfield mask="0x0000000F" name="RPA3R"/>
        </register>
        <register caption="" name="RPA4R" offset="0x210" rw="RW" size="4">
          <bitfield mask="0x0000000F" name="RPA4R"/>
        </register>
        <register caption="" name="RPA5R" offset="0x214" rw="RW" size="4">
          <bitfield mask="0x0000000F" name="RPA5R"/>
        </register>
        <register caption="" name="RPA10R" offset="0x228" rw="RW" size="4">
          <bitfield mask="0x0000000F" name="RPA10R"/>
        </register>
        <register caption="" name="RPA11R" offset="0x22c" rw="RW" size="4">
          <bitfield mask="0x0000000F" name="RPA11R"/>
        </register>
        <register caption="" name="RPA12R" offset="0x230" rw="RW" size="4">
          <bitfield mask="0x0000000F" name="RPA12R"/>
        </register>
        <register caption="" name="RPA13R" offset="0x234" rw="RW" size="4">
          <bitfield mask="0x0000000F" name="RPA13R"/>
        </register>
        <register caption="" name="RPA14R" offset="0x238" rw="RW" size="4">
          <bitfield mask="0x0000000F" name="RPA14R"/>
        </register>
        <register caption="" name="RPA15R" offset="0x23c" rw="RW" size="4">
          <bitfield mask="0x0000000F" name="RPA15R"/>
        </register>
        <register caption="" name="RPB0R" offset="0x240" rw="RW" size="4">
          <bitfield mask="0x0000000F" name="RPB0R"/>
        </register>
        <register caption="" name="RPB1R" offset="0x244" rw="RW" size="4">
          <bitfield mask="0x0000000F" name="RPB1R"/>
        </register>
        <register caption="" name="RPB2R" offset="0x248" rw="RW" size="4">
          <bitfield mask="0x0000000F" name="RPB2R"/>
        </register>
        <register caption="" name="RPB3R" offset="0x24c" rw="RW" size="4">
          <bitfield mask="0x0000000F" name="RPB3R"/>
        </register>
        <register caption="" name="RPB4R" offset="0x250" rw="RW" size="4">
          <bitfield mask="0x0000000F" name="RPB4R"/>
        </register>
        <register caption="" name="RPB5R" offset="0x254" rw="RW" size="4">
          <bitfield mask="0x0000000F" name="RPB5R"/>
        </register>
        <register caption="" name="RPB6R" offset="0x258" rw="RW" size="4">
          <bitfield mask="0x0000000F" name="RPB6R"/>
        </register>
        <register caption="" name="RPB7R" offset="0x25c" rw="RW" size="4">
          <bitfield mask="0x0000000F" name="RPB7R"/>
        </register>
        <register caption="" name="RPB8R" offset="0x260" rw="RW" size="4">
          <bitfield mask="0x0000000F" name="RPB8R"/>
        </register>
        <register caption="" name="RPB9R" offset="0x264" rw="RW" size="4">
          <bitfield mask="0x0000000F" name="RPB9R"/>
        </register>
        <register caption="" name="RPB10R" offset="0x268" rw="RW" size="4">
          <bitfield mask="0x0000000F" name="RPB10R"/>
        </register>
        <register caption="" name="RPB11R" offset="0x26c" rw="RW" size="4">
          <bitfield mask="0x0000000F" name="RPB11R"/>
        </register>
        <register caption="" name="RPB12R" offset="0x270" rw="RW" size="4">
          <bitfield mask="0x0000000F" name="RPB12R"/>
        </register>
        <register caption="" name="RPB13R" offset="0x274" rw="RW" size="4">
          <bitfield mask="0x0000000F" name="RPB13R"/>
        </register>
        <register caption="" name="RPB14R" offset="0x278" rw="RW" size="4">
          <bitfield mask="0x0000000F" name="RPB14R"/>
        </register>
        <register caption="" name="RPC0R" offset="0x280" rw="RW" size="4">
          <bitfield mask="0x0000000F" name="RPC0R"/>
        </register>
        <register caption="" name="RPC1R" offset="0x284" rw="RW" size="4">
          <bitfield mask="0x0000000F" name="RPC1R"/>
        </register>
        <register caption="" name="RPC2R" offset="0x288" rw="RW" size="4">
          <bitfield mask="0x0000000F" name="RPC2R"/>
        </register>
        <register caption="" name="RPC3R" offset="0x28c" rw="RW" size="4">
          <bitfield mask="0x0000000F" name="RPC3R"/>
        </register>
        <register caption="" name="RPC4R" offset="0x290" rw="RW" size="4">
          <bitfield mask="0x0000000F" name="RPC4R"/>
        </register>
        <register caption="" name="RPC5R" offset="0x294" rw="RW" size="4">
          <bitfield mask="0x0000000F" name="RPC5R"/>
        </register>
        <register caption="" name="RPC6R" offset="0x298" rw="RW" size="4">
          <bitfield mask="0x0000000F" name="RPC6R"/>
        </register>
        <register caption="" name="RPC7R" offset="0x29c" rw="RW" size="4">
          <bitfield mask="0x0000000F" name="RPC7R"/>
        </register>
        <register caption="" name="RPC8R" offset="0x2a0" rw="RW" size="4">
          <bitfield mask="0x0000000F" name="RPC8R"/>
        </register>
        <register caption="" name="RPC9R" offset="0x2a4" rw="RW" size="4">
          <bitfield mask="0x0000000F" name="RPC9R"/>
        </register>
        <register caption="" name="RPC10R" offset="0x2a8" rw="RW" size="4">
          <bitfield mask="0x0000000F" name="RPC10R"/>
        </register>
        <register caption="" name="RPC11R" offset="0x2ac" rw="RW" size="4">
          <bitfield mask="0x0000000F" name="RPC11R"/>
        </register>
        <register caption="" name="RPC12R" offset="0x2b0" rw="RW" size="4">
          <bitfield mask="0x0000000F" name="RPC12R"/>
        </register>
        <register caption="" name="RPC13R" offset="0x2b4" rw="RW" size="4">
          <bitfield mask="0x0000000F" name="RPC13R"/>
        </register>
        <register caption="" name="RPC14R" offset="0x2b8" rw="RW" size="4">
          <bitfield mask="0x0000000F" name="RPC14R"/>
        </register>
        <register caption="" name="RPC15R" offset="0x2bc" rw="RW" size="4">
          <bitfield mask="0x0000000F" name="RPC15R"/>
        </register>
        <register caption="" name="RPK0R" offset="0x2c0" rw="RW" size="4">
          <bitfield mask="0x0000000F" name="RPK0R"/>
        </register>
        <register caption="" name="RPK1R" offset="0x2c4" rw="RW" size="4">
          <bitfield mask="0x0000000F" name="RPK1R"/>
        </register>
        <register caption="" name="RPK2R" offset="0x2c8" rw="RW" size="4">
          <bitfield mask="0x0000000F" name="RPK2R"/>
        </register>
