Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-W_DFP/1.8.326/atdf/PIC32MZ2051W104132.atdf
        <register caption="" name="RPK3R" offset="0x2cc" rw="RW" size="4">
          <bitfield mask="0x0000000F" name="RPK3R"/>
        </register>
        <register caption="" name="RPK4R" offset="0x2d0" rw="RW" size="4">
          <bitfield mask="0x0000000F" name="RPK4R"/>
        </register>
        <register caption="" name="RPK5R" offset="0x2d4" rw="RW" size="4">
          <bitfield mask="0x0000000F" name="RPK5R"/>
        </register>
        <register caption="" name="RPK6R" offset="0x2d8" rw="RW" size="4">
          <bitfield mask="0x0000000F" name="RPK6R"/>
        </register>
        <register caption="" name="RPK7R" offset="0x2dc" rw="RW" size="4">
          <bitfield mask="0x0000000F" name="RPK7R"/>
        </register>
        <register caption="" name="RPK8R" offset="0x2e0" rw="RW" size="4">
          <bitfield mask="0x0000000F" name="RPK8R"/>
        </register>
        <register caption="" name="RPK9R" offset="0x2e4" rw="RW" size="4">
          <bitfield mask="0x0000000F" name="RPK9R"/>
        </register>
        <register caption="" name="RPK10R" offset="0x2e8" rw="RW" size="4">
          <bitfield mask="0x0000000F" name="RPK10R"/>
        </register>
        <register caption="" name="RPK11R" offset="0x2ec" rw="RW" size="4">
          <bitfield mask="0x0000000F" name="RPK11R"/>
        </register>
        <register caption="" name="RPK12R" offset="0x2f0" rw="RW" size="4">
          <bitfield mask="0x0000000F" name="RPK12R"/>
        </register>
        <register caption="" name="RPK13R" offset="0x2f4" rw="RW" size="4">
          <bitfield mask="0x0000000F" name="RPK13R"/>
        </register>
        <register caption="" name="RPK14R" offset="0x2f8" rw="RW" size="4">
          <bitfield mask="0x0000000F" name="RPK14R"/>
        </register>
      </register-group>
    </module>
    <module caption="" id="01459" name="PTG" version="">
      <register-group name="PTG">
        <register caption="" name="PTGCON" offset="0x0" rw="RW" size="4">
          <bitfield mask="0x00000003" name="PTGITM"/>
          <bitfield mask="0x00000020" name="PTGBUSY"/>
          <bitfield mask="0x00000040" name="PTGWDTO"/>
          <bitfield mask="0x00000080" name="PTGSTRT"/>
          <bitfield mask="0x00000100" name="PTGIVIS"/>
          <bitfield mask="0x00000200" name="PTGSSEN"/>
          <bitfield mask="0x00000400" name="PTGSWT"/>
          <bitfield mask="0x00000800" name="RESERVED"/>
          <bitfield mask="0x00001000" name="PTGTOGL"/>
          <bitfield mask="0x00002000" name="PTGSIDL"/>
          <bitfield mask="0x00004000" name="PTGFRZ"/>
          <bitfield mask="0x00008000" name="PTGON"/>
          <bitfield mask="0x00070000" name="PTGWDT"/>
          <bitfield mask="0x00F00000" name="PTGPWD"/>
          <bitfield mask="0x1F000000" name="PTGDIV"/>
          <bitfield mask="0xE0000000" name="PTGCLK"/>
        </register>
        <register caption="" name="PTGBTE" offset="0x10" rw="RW" size="4">
          <bitfield mask="0xFFFFFFFF" name="PTGBTE"/>
        </register>
        <register caption="" name="PTGHOLD" offset="0x20" rw="RW" size="4">
          <bitfield mask="0x0000FFFF" name="PTGHOLD"/>
        </register>
        <register caption="" name="PTGT0LIM" offset="0x30" rw="RW" size="4">
          <bitfield mask="0x0000FFFF" name="PTGT0LIM"/>
        </register>
        <register caption="" name="PTGT1LIM" offset="0x40" rw="RW" size="4">
          <bitfield mask="0x0000FFFF" name="PTGT1LIM"/>
        </register>
        <register caption="" name="PTGSDLIM" offset="0x50" rw="RW" size="4">
          <bitfield mask="0x0000FFFF" name="PTGSDLIM"/>
        </register>
        <register caption="" name="PTGC0LIM" offset="0x60" rw="RW" size="4">
          <bitfield mask="0x0000FFFF" name="PTGC0LIM"/>
        </register>
        <register caption="" name="PTGC1LIM" offset="0x70" rw="RW" size="4">
          <bitfield mask="0x0000FFFF" name="PTGC1LIM"/>
        </register>
        <register caption="" name="PTGADJ" offset="0x80" rw="RW" size="4">
          <bitfield mask="0x0000FFFF" name="PTGADJ"/>
        </register>
        <register caption="" name="PTGL0" offset="0x90" rw="RW" size="4">
          <bitfield mask="0x0000FFFF" name="PTGL0"/>
        </register>
        <register caption="" name="PTGQPTR" offset="0xa0" rw="RW" size="4">
          <bitfield mask="0x0000001F" name="PTGQPTR"/>
        </register>
        <register caption="" name="PTGQUE0" offset="0xc0" rw="RW" size="4">
          <bitfield mask="0x000000FF" name="STEP0"/>
          <bitfield mask="0x0000FF00" name="STEP1"/>
          <bitfield mask="0x00FF0000" name="STEP2"/>
          <bitfield mask="0xFF000000" name="STEP3"/>
        </register>
        <register caption="" name="PTGQUE1" offset="0xd0" rw="RW" size="4">
          <bitfield mask="0x000000FF" name="STEP4"/>
          <bitfield mask="0x0000FF00" name="STEP5"/>
          <bitfield mask="0x00FF0000" name="STEP6"/>
          <bitfield mask="0xFF000000" name="STEP7"/>
        </register>
        <register caption="" name="PTGQUE2" offset="0xe0" rw="RW" size="4">
          <bitfield mask="0x000000FF" name="STEP8"/>
          <bitfield mask="0x0000FF00" name="STEP9"/>
          <bitfield mask="0x00FF0000" name="STEP10"/>
          <bitfield mask="0xFF000000" name="STEP11"/>
        </register>
        <register caption="" name="PTGQUE3" offset="0xf0" rw="RW" size="4">
          <bitfield mask="0x000000FF" name="STEP12"/>
          <bitfield mask="0x0000FF00" name="STEP13"/>
          <bitfield mask="0x00FF0000" name="STEP14"/>
          <bitfield mask="0xFF000000" name="STEP15"/>
        </register>
        <register caption="" name="PTGQUE4" offset="0x100" rw="RW" size="4">
          <bitfield mask="0x000000FF" name="STEP16"/>
          <bitfield mask="0x0000FF00" name="STEP17"/>
          <bitfield mask="0x00FF0000" name="STEP18"/>
          <bitfield mask="0xFF000000" name="STEP19"/>
        </register>
        <register caption="" name="PTGQUE5" offset="0x110" rw="RW" size="4">
          <bitfield mask="0x000000FF" name="STEP20"/>
          <bitfield mask="0x0000FF00" name="STEP21"/>
          <bitfield mask="0x00FF0000" name="STEP22"/>
          <bitfield mask="0xFF000000" name="STEP23"/>
        </register>
