Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-W_DFP/1.8.326/atdf/PIC32MZ2051W104132.atdf
    <module caption="" id="01329" name="SPI" version="2">
      <register-group name="SPI">
        <register caption="SPI Control Register" name="SPI1CON" offset="0x0" rw="RW" size="4">
          <bitfield caption="SPI Receive Buffer Full Interrupt Mode bits" mask="0x00000003" name="SRXISEL" values="SPI1CON__SRXISEL"/>
          <bitfield caption="SPI Transmit Buffer Empty Interrupt Mode bits" mask="0x0000000C" name="STXISEL" values="SPI1CON__STXISEL"/>
          <bitfield caption="Disable SDI bit" mask="0x00000010" name="DISSDI" values="SPI1CON__DISSDI"/>
          <bitfield caption="Master Mode Enable bit" mask="0x00000020" name="MSTEN" values="SPI1CON__MSTEN"/>
          <bitfield caption="Clock Polarity Select bit" mask="0x00000040" name="CKP" values="SPI1CON__CKP"/>
          <bitfield caption="Slave Select Enable bit" mask="0x00000080" name="SSEN" values="SPI1CON__SSEN"/>
          <bitfield caption="SPI Clock Edge Select bit" mask="0x00000100" name="CKE" values="SPI1CON__CKE"/>
          <bitfield caption="SPI Data Input Sample Phase bit (master mode only)" mask="0x00000200" name="SMP" values="SPI1CON__SMP"/>
          <bitfield caption="32/16-Bit Communication Select bits" mask="0x00000C00" name="MODE32" values="SPI1CON__MODE32"/>
          <bitfield caption="Disable SDOx pin bit" mask="0x00001000" name="DISSDO" values="SPI1CON__DISSDO"/>
          <bitfield caption="Stop in Idle Mode bit" mask="0x00002000" name="SIDL" values="SPI1CON__SIDL"/>
          <bitfield caption="SPI Peripheral On bit" mask="0x00008000" name="ON" values="SPI1CON__ON"/>
          <bitfield caption="Enhanced Buffer Enable bit" mask="0x00010000" name="ENHBUF" values="SPI1CON__ENHBUF"/>
          <bitfield caption="Frame Sync Pulse Edge Select bit" mask="0x00020000" name="SPIFE" values="SPI1CON__SPIFE"/>
          <bitfield caption="Master Clock Enable bit" mask="0x00040000" name="MCLKSEL" values="SPI1CON__MCLKSEL"/>
          <bitfield caption="Frame Sync Pulse Counter bits. Controls the number of data characters transmitted per pulse. This bit is only valid in FRAMED_SYNC mode." mask="0x07000000" name="FRMCNT" values="SPI1CON__FRMCNT"/>
          <bitfield caption="Frame Sync Pulse Width bit" mask="0x08000000" name="FRMSYPW" values="SPI1CON__FRMSYPW"/>
          <bitfield caption="Master Mode Slave Select Enable bit" mask="0x10000000" name="MSSEN" values="SPI1CON__MSSEN"/>
          <bitfield caption="Frame Sync Polarity bit (Framed SPI mode only)" mask="0x20000000" name="FRMPOL" values="SPI1CON__FRMPOL"/>
          <bitfield caption="Frame Sync Pulse Direction Control on SSx pin bit (Framed SPI mode only)" mask="0x40000000" name="FRMSYNC" values="SPI1CON__FRMSYNC"/>
          <bitfield caption="Framed SPI Support bit" mask="0x80000000" name="FRMEN" values="SPI1CON__FRMEN"/>
        </register>
        <register caption="SPI Control Register" name="SPI2CON" offset="0x200" rw="RW" size="4">
          <bitfield caption="SPI Receive Buffer Full Interrupt Mode bits" mask="0x00000003" name="SRXISEL" values="SPI2CON__SRXISEL"/>
          <bitfield caption="SPI Transmit Buffer Empty Interrupt Mode bits" mask="0x0000000C" name="STXISEL" values="SPI2CON__STXISEL"/>
          <bitfield caption="Disable SDI bit" mask="0x00000010" name="DISSDI" values="SPI2CON__DISSDI"/>
          <bitfield caption="Master Mode Enable bit" mask="0x00000020" name="MSTEN" values="SPI2CON__MSTEN"/>
          <bitfield caption="Clock Polarity Select bit" mask="0x00000040" name="CKP" values="SPI2CON__CKP"/>
          <bitfield caption="Slave Select Enable bit" mask="0x00000080" name="SSEN" values="SPI2CON__SSEN"/>
          <bitfield caption="SPI Clock Edge Select bit" mask="0x00000100" name="CKE" values="SPI2CON__CKE"/>
          <bitfield caption="SPI Data Input Sample Phase bit (master mode only)" mask="0x00000200" name="SMP" values="SPI2CON__SMP"/>
          <bitfield caption="32/16-Bit Communication Select bits" mask="0x00000C00" name="MODE32" values="SPI2CON__MODE32"/>
          <bitfield caption="Disable SDOx pin bit" mask="0x00001000" name="DISSDO" values="SPI2CON__DISSDO"/>
          <bitfield caption="Stop in Idle Mode bit" mask="0x00002000" name="SIDL" values="SPI2CON__SIDL"/>
          <bitfield caption="SPI Peripheral On bit" mask="0x00008000" name="ON" values="SPI2CON__ON"/>
          <bitfield caption="Enhanced Buffer Enable bit" mask="0x00010000" name="ENHBUF" values="SPI2CON__ENHBUF"/>
          <bitfield caption="Frame Sync Pulse Edge Select bit" mask="0x00020000" name="SPIFE" values="SPI2CON__SPIFE"/>
          <bitfield caption="Master Clock Enable bit" mask="0x00040000" name="MCLKSEL" values="SPI2CON__MCLKSEL"/>
          <bitfield caption="Frame Sync Pulse Counter bits. Controls the number of data characters transmitted per pulse. This bit is only valid in FRAMED_SYNC mode." mask="0x07000000" name="FRMCNT" values="SPI2CON__FRMCNT"/>
          <bitfield caption="Frame Sync Pulse Width bit" mask="0x08000000" name="FRMSYPW" values="SPI2CON__FRMSYPW"/>
          <bitfield caption="Master Mode Slave Select Enable bit" mask="0x10000000" name="MSSEN" values="SPI2CON__MSSEN"/>
          <bitfield caption="Frame Sync Polarity bit (Framed SPI mode only)" mask="0x20000000" name="FRMPOL" values="SPI2CON__FRMPOL"/>
          <bitfield caption="Frame Sync Pulse Direction Control on SSx pin bit (Framed SPI mode only)" mask="0x40000000" name="FRMSYNC" values="SPI2CON__FRMSYNC"/>
          <bitfield caption="Framed SPI Support bit" mask="0x80000000" name="FRMEN" values="SPI2CON__FRMEN"/>
        </register>
        <register caption="SPI Status Register" name="SPI1STAT" offset="0x10" rw="RW" size="4">
          <bitfield caption="SPI Receive Buffer Full Status bit" mask="0x00000001" name="SPIRBF" values="SPI1STAT__SPIRBF"/>
          <bitfield caption="SPI Transmit Buffer Full Status bit" mask="0x00000002" name="SPITBF" values="SPI1STAT__SPITBF"/>
          <bitfield caption="SPI Transmit Buffer Empty Status bit" mask="0x00000008" name="SPITBE" values="SPI1STAT__SPITBE"/>
          <bitfield caption="RX FIFO Empty bit (valid only when ENHBUF = 1)" mask="0x00000020" name="SPIRBE" values="SPI1STAT__SPIRBE"/>
          <bitfield caption="Receive Overflow Flag bit" mask="0x00000040" name="SPIROV" values="SPI1STAT__SPIROV"/>
          <bitfield caption="Shift Register Empty bit (valid only when ENHBUF = 1)" mask="0x00000080" name="SRMT" values="SPI1STAT__SRMT"/>
          <bitfield caption="Transmit Under Run bit" mask="0x00000100" name="SPITUR" values="SPI1STAT__SPITUR"/>
          <bitfield caption="SPI Activity Status bit" mask="0x00000800" name="SPIBUSY" values="SPI1STAT__SPIBUSY"/>
          <bitfield caption="SPI Frame Error status bit" mask="0x00001000" name="FRMERR" values="SPI1STAT__FRMERR"/>
          <bitfield mask="0x001F0000" name="TXBUFELM"/>
          <bitfield mask="0x1F000000" name="RXBUFELM"/>
        </register>
        <register caption="SPI Status Register" name="SPI2STAT" offset="0x210" rw="RW" size="4">
          <bitfield caption="SPI Receive Buffer Full Status bit" mask="0x00000001" name="SPIRBF" values="SPI2STAT__SPIRBF"/>
          <bitfield caption="SPI Transmit Buffer Full Status bit" mask="0x00000002" name="SPITBF" values="SPI2STAT__SPITBF"/>
          <bitfield caption="SPI Transmit Buffer Empty Status bit" mask="0x00000008" name="SPITBE" values="SPI2STAT__SPITBE"/>
          <bitfield caption="RX FIFO Empty bit (valid only when ENHBUF = 1)" mask="0x00000020" name="SPIRBE" values="SPI2STAT__SPIRBE"/>
          <bitfield caption="Receive Overflow Flag bit" mask="0x00000040" name="SPIROV" values="SPI2STAT__SPIROV"/>
          <bitfield caption="Shift Register Empty bit (valid only when ENHBUF = 1)" mask="0x00000080" name="SRMT" values="SPI2STAT__SRMT"/>
          <bitfield caption="Transmit Under Run bit" mask="0x00000100" name="SPITUR" values="SPI2STAT__SPITUR"/>
          <bitfield caption="SPI Activity Status bit" mask="0x00000800" name="SPIBUSY" values="SPI2STAT__SPIBUSY"/>
          <bitfield caption="SPI Frame Error status bit" mask="0x00001000" name="FRMERR" values="SPI2STAT__FRMERR"/>
          <bitfield mask="0x001F0000" name="TXBUFELM"/>
          <bitfield mask="0x1F000000" name="RXBUFELM"/>
        </register>
        <register caption="" name="SPI1BUF" offset="0x20" rw="RW" size="4">
          <bitfield mask="0xFFFFFFFF" name="SPI1BUF"/>
        </register>
