Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-W_DFP/1.8.326/atdf/PIC32MZ2051W104132.atdf
        <register caption="SQI Command Threshold Register" name="SQI1CMDTHR" offset="0x14" rw="RW" size="4">
          <bitfield mask="0x0000003F" name="RXCMDTHR"/>
          <bitfield mask="0x00003F00" name="TXCMDTHR"/>
        </register>
        <register caption="SQI Interrupt Threshold Register" name="SQI1INTTHR" offset="0x18" rw="RW" size="4">
          <bitfield mask="0x0000003F" name="RXINTTHR"/>
          <bitfield mask="0x00003F00" name="TXINTTHR"/>
        </register>
        <register caption="SQI Interrupt Enable Register" name="SQI1INTEN" offset="0x1c" rw="RW" size="4">
          <bitfield caption="Transmit Buffer Empty Interrupt Enable bit" mask="0x00000001" name="TXEMPTYIE" values="SQI1INTEN__TXEMPTYIE"/>
          <bitfield caption="Transmit Buffer Full Interrupt Enable bit" mask="0x00000002" name="TXFULLIE" values="SQI1INTEN__TXFULLIE"/>
          <bitfield caption="Transmit Buffer Threshold Interrupt Enable bit" mask="0x00000004" name="TXTHRIE" values="SQI1INTEN__TXTHRIE"/>
          <bitfield caption="Receive Buffer Empty Interrupt Enabled bit" mask="0x00000008" name="RXEMPTYIE" values="SQI1INTEN__RXEMPTYIE"/>
          <bitfield caption="Receive Buffer Full Interrupt Enable bit" mask="0x00000010" name="RXFULLIE" values="SQI1INTEN__RXFULLIE"/>
          <bitfield caption="Receive Buffer Threshold Interrupt Enable bit" mask="0x00000020" name="RXTHRIE" values="SQI1INTEN__RXTHRIE"/>
          <bitfield caption="Control Buffer Full Interrupt Enable bit" mask="0x00000040" name="CONFULLIE" values="SQI1INTEN__CONFULLIE"/>
          <bitfield caption="Control Buffer Empty Interrupt Enabled bit" mask="0x00000080" name="CONEMPTYIE" values="SQI1INTEN__CONEMPTYIE"/>
          <bitfield caption="Control Buffer Threshold Interrupt Enable bit" mask="0x00000100" name="CONTHRIE" values="SQI1INTEN__CONTHRIE"/>
          <bitfield caption="DMA Buffer Descriptor Done Interrupt Enable bit" mask="0x00000200" name="BDDONEIE" values="SQI1INTEN__BDDONEIE"/>
          <bitfield caption="DMA Buffer Descriptor Packet Complete Interrupt Enable bit" mask="0x00000400" name="PKTCOMPIE" values="SQI1INTEN__PKTCOMPIE"/>
          <bitfield caption="DMA Bus Error Interrupt Enable bit" mask="0x00000800" name="DMAEIE" values="SQI1INTEN__DMAEIE"/>
        </register>
        <register caption="" name="SQI1INTSTAT" offset="0x20" rw="RW" size="4">
          <bitfield caption="Transmit Buffer Empty Interrupt Status bit" mask="0x00000001" name="TXEMPTYIF" values="SQI1INTSTAT__TXEMPTYIF"/>
          <bitfield caption="Transmit Buffer Full Interrupt Status bit" mask="0x00000002" name="TXFULLIF" values="SQI1INTSTAT__TXFULLIF"/>
          <bitfield caption="Transmit Buffer Threshold Interrupt Status bit" mask="0x00000004" name="TXTHRIF" values="SQI1INTSTAT__TXTHRIF"/>
          <bitfield caption="Receive Buffer Empty Interrupt Status bit" mask="0x00000008" name="RXEMPTYIF" values="SQI1INTSTAT__RXEMPTYIF"/>
          <bitfield caption="Receive Buffer Full Interrupt Status bit" mask="0x00000010" name="RXFULLIF" values="SQI1INTSTAT__RXFULLIF"/>
          <bitfield caption="Receive Buffer Threshold Interrupt Status bit" mask="0x00000020" name="RXTHRIF" values="SQI1INTSTAT__RXTHRIF"/>
          <bitfield caption="Control Buffer Full Interrupt Status bit" mask="0x00000040" name="CONFULLIF" values="SQI1INTSTAT__CONFULLIF"/>
          <bitfield caption="Control Buffer Empty Interrupt Status bit" mask="0x00000080" name="CONEMPTYIF" values="SQI1INTSTAT__CONEMPTYIF"/>
          <bitfield caption="Control Buffer Threshold Interrupt Status bit" mask="0x00000100" name="CONTHRIF" values="SQI1INTSTAT__CONTHRIF"/>
          <bitfield caption="DMA Buffer Descriptor Done Interrupt Status bit" mask="0x00000200" name="BDDONEIF" values="SQI1INTSTAT__BDDONEIF"/>
          <bitfield caption="DMA Buffer Descriptor Processor Packet Complete Interrupt Status bit" mask="0x00000400" name="PKTCOMPIF" values="SQI1INTSTAT__PKTCOMPIF"/>
          <bitfield caption="DMA Bus Error Interrupt Flag bit" mask="0x00000800" name="DMAEIF" values="SQI1INTSTAT__DMAEIF"/>
        </register>
        <register caption="SQI Transmit Data Buffer Register" name="SQI1TXDATA" offset="0x24" rw="RW" size="4">
          <bitfield mask="0xFFFFFFFF" name="TXDATA"/>
        </register>
        <register caption="SQI Receive Data Buffer Register" name="SQI1RXDATA" offset="0x28" rw="R" size="4">
          <bitfield mask="0xFFFFFFFF" name="RXDATA"/>
        </register>
        <register caption="SQI Status Register 1" name="SQI1STAT1" offset="0x2c" rw="R" size="4">
          <bitfield mask="0x0000003F" name="RXBUFCNT"/>
          <bitfield mask="0x003F0000" name="TXBUFFREE"/>
        </register>
        <register caption="SQI Status Register 2" name="SQI1STAT2" offset="0x30" rw="R" size="4">
          <bitfield caption="Transmit Buffer Overflow Status bit" mask="0x00000001" name="TXOV" values="SQI1STAT2__TXOV"/>
          <bitfield caption="Receive Buffer Underflow Status bit" mask="0x00000002" name="RXUN" values="SQI1STAT2__RXUN"/>
          <bitfield caption="SQID0 Status bit" mask="0x00000008" name="SQID0" values="SQI1STAT2__SQID0"/>
          <bitfield caption="SQID1 Status bit" mask="0x00000010" name="SQID1" values="SQI1STAT2__SQID1"/>
          <bitfield caption="SQID2 Status bit" mask="0x00000020" name="SQID2" values="SQI1STAT2__SQID2"/>
          <bitfield caption="SQID3 Status bit" mask="0x00000040" name="SQID3" values="SQI1STAT2__SQID3"/>
          <bitfield caption="Control IFO Space Available bits" mask="0x00000780" name="CONAVAIL" values="SQI1STAT2__CONAVAIL"/>
          <bitfield caption="Current Command Status bits" mask="0x00030000" name="CMDSTAT" values="SQI1STAT2__CMDSTAT"/>
        </register>
        <register caption="SQI Buffer Descriptor Control Register" name="SQI1BDCON" offset="0x34" rw="RW" size="4">
          <bitfield caption="DMA Enable bit" mask="0x00000001" name="DMAEN" values="SQI1BDCON__DMAEN"/>
          <bitfield caption="Buffer Descriptor Poll Enable bit" mask="0x00000002" name="POLLEN" values="SQI1BDCON__POLLEN"/>
          <bitfield caption="Buffer Descriptor Processor Start bit" mask="0x00000004" name="START" values="SQI1BDCON__START"/>
        </register>
